{
    "text_id": "315d2108-bfeb-4d81-ade8-b4758053e2f0",
    "segments": [
        {
            "content": "",
            "type": "source",
            "mapping": []
        },
        {
            "content": "རྒྱ་གར་སྐད་དུ། །ཨཱརྱ་བཛྲ་ཞེས་སོགས་ཏེ། །དེ་བོད་སྐད་དུ་བསྒྱུར་ན། །ཨཱརྱ་ནི་འཕགས་པ། བཛྲ་ནི་རྡོ་རྗེ། ཙྪེ་ད་ཀ་ནི་གཅོད་པ། པྲཛྙཱ་ནི་ཤེས་རབ། པཱ་ར་ནི་ཕ་རོལ་ཏུ། ཨི་ཏ་ནི་ཕྱིན་པ། ནཱ་མ་ནི་ཞེས་བྱ་བ། མ་ཧཱ་ནི་ཆེན་པོ། ཡ་ན་ནི་ཐེག་པ། སཱུ་ཏྲ་ནི་མདོ་ཞེས་པར་འགྱུར་རོ། །འདིར་པཱ་ར་མི་ཏ་ཞེས་འབྱུང་བ་ནི། །པཱ་ར་དང་ཨི་ཏའི་བར་དུ་རྣམ་དབྱེ་གཉིས་པའི་ཨས་བྱིན་ནས་ཨི་ཕྱག་ཏེ་མ་ཨི་ལ་ཕྱིན་ནས་མཚམས་སྦྱར་བས་མི་ཏར་སོང་བའོ། །འདིའི་མཚན་དོན་བཤད་པ་ནི། །བརྒྱ་བྱིན་གྱི་ལག་གི་རྡོ་རྗེ་དེ་ཕྱིའི་དངོས་པོ་གཞན་གྱིས་གཞིག་པར་མི་ནུས་ཤིང༌། །དེ་རི་བྲག་སོགས་ཀྱི་དངོས་པོ་གང་ལ་བསྣུན་ཀྱང་ཐལ་བར་བྱེད་ནུས་པ་ལྟར། གཞུང་འདིའི་བརྗོད་བྱ་དོན་གྱི་ཤེར་ཕྱིན་སྟོང་ཉིད་རྟོགས་པའི་ཡེ་ཤེས་དེ་ལ་མི་མཐུན་ཕྱོགས་ཀྱིས་མི་ཚུགས་ཤིང༌། དེས་ཉོན་མོངས་པ་དང་སྡུག་བསྔལ་ཐམས་ཅད་རྩད་ནས་གཅོད་པའི་དོན་ནོ། །",
            "type": "source",
            "mapping": []
        },
        {
            "content": "རྒྱ་གར་སྐད་དུ། །ཨཱརྱ་བཛྲ་ཞེས་སོགས་ཏེ། །དེ་བོད་སྐད་དུ་བསྒྱུར་ན། །ཨཱརྱ་ནི་འཕགས་པ། བཛྲ་ནི་རྡོ་རྗེ། ཙྪེ་ད་ཀ་ནི་གཅོད་པ། པྲཛྙཱ་ནི་ཤེས་རབ། པཱ་ར་ནི་ཕ་རོལ་ཏུ། ཨི་ཏ་ནི་ཕྱིན་པ། ནཱ་མ་ནི་ཞེས་བྱ་བ། མ་ཧཱ་ནི་ཆེན་པོ། ཡ་ན་ནི་ཐེག་པ། སཱུ་ཏྲ་ནི་མདོ་ཞེས་པར་འགྱུར་རོ། །འདིར་པཱ་ར་མི་ཏ་ཞེས་འབྱུང་བ་ནི། །པཱ་ར་དང་ཨི་ཏའི་བར་དུ་རྣམ་དབྱེ་གཉིས་པའི་ཨས་བྱིན་ནས་ཨི་ཕྱག་ཏེ་མ་ཨི་ལ་ཕྱིན་ནས་མཚམས་སྦྱར་བས་མི་ཏར་སོང་བའོ། །འདིའི་མཚན་དོན་བཤད་པ་ནི། །བརྒྱ་བྱིན་གྱི་ལག་གི་རྡོ་རྗེ་དེ་ཕྱིའི་དངོས་པོ་གཞན་གྱིས་གཞིག་པར་མི་ནུས་ཤིང༌། །དེ་རི་བྲག་སོགས་ཀྱི་དངོས་པོ་གང་ལ་བསྣུན་ཀྱང་ཐལ་བར་བྱེད་ནུས་པ་ལྟར། གཞུང་འདིའི་བརྗོད་བྱ་དོན་གྱི་ཤེར་ཕྱིན་སྟོང་ཉིད་རྟོགས་པའི་ཡེ་ཤེས་དེ་ལ་མི་མཐུན་ཕྱོགས་ཀྱིས་མི་ཚུགས་ཤིང༌། དེས་ཉོན་མོངས་པ་དང་སྡུག་བསྔལ་ཐམས་ཅད་རྩད་ནས་གཅོད་པའི་དོན་ནོ། །",
            "type": "source",
            "mapping": []
        },
        {
            "content": "",
            "type": "source",
            "mapping": []
        },
        {
            "content": "གླེང་གཞི།གསུམ་པ་གླེང་གཞི་ནི།  གཞུང་འདི་སྐད་ཅེས་སྡུད་པ་པོ་བདག་གིས་ཐོས་པ་ནི་དུས་གཅིག་གི་ཚེ་ན།  བཅོམ་ལྡན་འདས་མཉན་ཡོད་ན་རྒྱལ་བུ་རྒྱལ་བྱེད་ཀྱི་ཚལ་མགོན་མེད་ཟས་སྦྱིན་གྱི་ཀུན་དགའ་ར་བ་ན། དགེ་སློང་གི་དགེ་འདུན་ཆེན་པོ་ཉན་ཐོས་སྟོང་ཉིས་བརྒྱ་ལྔ་བཅུ་དང༌། བྱང་ཆུབ་སེམས་དཔའ་རབ་ཏུ་མང་པོ་དག་དང་ཐབས་གཅིག་སྟེ་ལྷན་ཅིག་ཏུ་བཞུགས་སོ། །",
            "type": "source",
            "mapping": []
        },
        {
            "content": "གླེང་གཞི།གསུམ་པ་གླེང་གཞི་ནི།  གཞུང་འདི་སྐད་ཅེས་སྡུད་པ་པོ་བདག་གིས་ཐོས་པ་ནི་དུས་གཅིག་གི་ཚེ་ན།  བཅོམ་ལྡན་འདས་མཉན་ཡོད་ན་རྒྱལ་བུ་རྒྱལ་བྱེད་ཀྱི་ཚལ་མགོན་མེད་ཟས་སྦྱིན་གྱི་ཀུན་དགའ་ར་བ་ན། དགེ་སློང་གི་དགེ་འདུན་ཆེན་པོ་ཉན་ཐོས་སྟོང་ཉིས་བརྒྱ་ལྔ་བཅུ་དང༌། བྱང་ཆུབ་སེམས་དཔའ་རབ་ཏུ་མང་པོ་དག་དང་ཐབས་གཅིག་སྟེ་ལྷན་ཅིག་ཏུ་བཞུགས་སོ། །",
            "type": "source",
            "mapping": []
        },
        {
            "content": "དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་གདུལ་བྱའི་དོན་དུ་སྔ་དྲོའི་དུས་སུ་ཆོས་གོས་རྣམ་གསུམ་སྐུ་ལ་གསོལ་ཞིང་ལྷུང་བཟེད་བསྣམས་ནས་མཉན་ཡོད་ཀྱི་གྲོང་ཁྱེར་ཆེན་པོར་བསོད་སྙོམས་ཀྱི་ཕྱིར་ཏེ་ཆེད་དུ་གཤེགས་སོ། །",
            "type": "source",
            "mapping": []
        },
        {
            "content": "བསོད་སྙོམས་བླངས་ཏེ་མཇུག་ཏུ་སླར་བྱོན་ནས་ཞལ་ཟས་གསོལ་བའི་བྱ་བ་མཛད་དོ། །",
            "type": "source",
            "mapping": []
        },
        {
            "content": "ཟས་ཕྱི་མ་ཕྱི་དྲོའི་བསོད་སྙོམས་ཟ་བ་སྤངས་ནས། ལྷུང་བཟེད་སོགས་བཞག་ནས་ཞབས་བཀྲུས་ཤིང་བསིལ་ཏེ། གདན་བཤམས་པ་ཉིད་ལ་དཀྱིལ་མོ་ཀྲུང་བཅས་ནས་སྐུ་དྲང་པོར་སྲང་སྟེ། གཞུང་འདི་སྟོན་པར་འགྱུར་བ་མཁྱེན་པའི་དྲན་པ་མངོན་དུ་བཞག་ནས་བཞུགས་སོ། །",
            "type": "source",
            "mapping": []
        },
        {
            "content": "དེ་ནས་དགེ་སློང་མང་པོ་ཡང་བཅོམ་ལྡན་འདས་ཀྱི་དྲུང་དུ་ལྷགས་པ་སྟེ་ཕྱིན་ནས་ལན་གསུམ་བསྐོར་བ་བྱས་ནས་ཕྱོགས་གཅིག་སྟེ་ལྷན་ཅིག་ཏུ་འཁོད་དོ། །",
            "type": "source",
            "mapping": []
        },
        {
            "content": "དེ་ནས་དགེ་སློང་མང་པོ་ཡང་བཅོམ་ལྡན་འདས་ཀྱི་དྲུང་དུ་ལྷགས་པ་སྟེ་ཕྱིན་ནས་ལན་གསུམ་བསྐོར་བ་བྱས་ནས་ཕྱོགས་གཅིག་སྟེ་ལྷན་ཅིག་ཏུ་འཁོད་དོ། །",
            "type": "source",
            "mapping": []
        },
        {
            "content": "དེར་མ་ཟད། དེའི་ཚེ་གནས་བརྟན་རབ་འབྱོར་ཡང་ཁོར་དེ་ཉིད་དུ་འདུས་ནས་འདུག་གོ །",
            "type": "source",
            "mapping": []
        },
        {
            "content": "དངོས་གཞི་གཞུང་དོན་བཤད་པ། གཉིས་པ་དངོས་གཞི་གཞུང་དོན་བཤད་པ་ལ་གཉིས། ཐོག་མར་ཞུས་ཚུལ་དང༌། དེའི་ལན་རྣམས་རིམ་པར་བཤད་པའོ། ། ཐོག་མར་ཞུས་ཚུལ།དང་པོ་(ཐོག་མར་ཞུས་ཚུལ་ནི།  དེ་ནས་ཚེ་དང་ལྡན་པ་རབ་འབྱོར་རང་གི་འདུག་པའི་སྟན་ལས་ལངས་ཏེ། བླ་གོས་ཏེ་སྟོད་གོས་ཕྲག་པ་གཡོན་པའི་ཕྱོགས་གཅིག་ཏུ་གཟར་ནས། རྐང་པ་གཡོན་པའི་མཐིལ་དང༌། གཡས་པའི་པུས་མོའི་ལྷ་ང་ས་ལ་བཙུགས་ཏེ་བཅོམ་ལྡན་འདས་ཕྱོགས་གཡས་དེར་ཐལ་མོ་སྦྱར་བ་བཏུད་ནས་བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །",
            "type": "source",
            "mapping": []
        },
        {
            "content": "དངོས་གཞི་གཞུང་དོན་བཤད་པ། གཉིས་པ་དངོས་གཞི་གཞུང་དོན་བཤད་པ་ལ་གཉིས། ཐོག་མར་ཞུས་ཚུལ་དང༌། དེའི་ལན་རྣམས་རིམ་པར་བཤད་པའོ། ། ཐོག་མར་ཞུས་ཚུལ།དང་པོ་(ཐོག་མར་ཞུས་ཚུལ་ནི།  དེ་ནས་ཚེ་དང་ལྡན་པ་རབ་འབྱོར་རང་གི་འདུག་པའི་སྟན་ལས་ལངས་ཏེ། བླ་གོས་ཏེ་སྟོད་གོས་ཕྲག་པ་གཡོན་པའི་ཕྱོགས་གཅིག་ཏུ་གཟར་ནས། རྐང་པ་གཡོན་པའི་མཐིལ་དང༌། གཡས་པའི་པུས་མོའི་ལྷ་ང་ས་ལ་བཙུགས་ཏེ་བཅོམ་ལྡན་འདས་ཕྱོགས་གཡས་དེར་ཐལ་མོ་སྦྱར་བ་བཏུད་ནས་བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །",
            "type": "source",
            "mapping": []
        },
        {
            "content": "དེ་ནས་ཚིག་སྣ་བསྡུས་ཏེ་བརྗོད་ན། བཅོམ་ལྡན་འདས་ཁྱོད་ཀྱིས་བྱང་ཆུབ་སེམས་དཔའ་ཆེན་པོ་རྣམས་ལ་ཆོས་ཀྱི་སྒོ་ནས་འདི་ཕྱི་རྣམས་ལ་ཕན་གདགས་པའི་དམ་པ་མཆོག་ཇི་སྙེད་པ་ཅིག་མཛད་ནས་ཕན་གདགས་པ་དང༌།ཡང་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ལ་གནས་དང་ཆོས་དང་བཀར་གདགས་པའི་ཡོངས་སུ་གཏད་པ་རྣམ་པ་གསུམ་གྱི་དམ་པ་ཇི་སྙེད་པས་ཡོངས་སུ་གཏད་པར་མཛད་ན། བཅོམ་ལྡན་འདས་ངོ་མཚར་ཆེ་སོགས་ཞེས་གསོལ་ཏོ། ། དེ་ལ་གནས་ནི་དགེ་བའི་བཤེས་གཉེན་ལ་གཏད་པ་དང༌། ཆོས་ནི་དེས་ཕན་འདོགས་བྱེད་དུ་བཅུག་པ་དང༌། བཀར་བཏགས་པ་ནི་བྱང་སེམས་ཁྱེད་རྣམས་ཀྱིས་སེམས་ཅན་ལ་ཕན་གདགས་པར་བྱའོ་ཞེས་གཏད་པ་སྟེ་སློབ་དཔོན་ཀཱ་མ་ཤཱིའི་དགོངས་པའོ། །",
            "type": "source",
            "mapping": []
        },
        {
            "content": "ཞུས་ཚུལ་དངོས་ནི་བཅོམ་ལྡན་འདས་བྱང་ཆུབ་སེམས་དཔའི་ས་གང་ལ་ཡང་དག་པར་ཞུགས་པས་ཇི་ལྟར་གནས་པར་བགྱི། ཇི་ལྟར་སྒྲུབ་པར་བགྱི། ཇི་ལྟར་སེམས་རབ་ཏུ་གཟུང་བར་བགྱི་ཞེས་དོན་ཚན་གསུམ་ཞུས་སོ། །",
            "type": "source",
            "mapping": []
        },
        {
            "content": "ཞུས་ཚུལ་དངོས་ནི་བཅོམ་ལྡན་འདས་བྱང་ཆུབ་སེམས་དཔའི་ས་གང་ལ་ཡང་དག་པར་ཞུགས་པས་ཇི་ལྟར་གནས་པར་བགྱི། ཇི་ལྟར་སྒྲུབ་པར་བགྱི། ཇི་ལྟར་སེམས་རབ་ཏུ་གཟུང་བར་བགྱི་ཞེས་དོན་ཚན་གསུམ་ཞུས་སོ། །",
            "type": "source",
            "mapping": []
        },
        {
            "content": "ཞུས་ཚུལ་དངོས་ནི་བཅོམ་ལྡན་འདས་བྱང་ཆུབ་སེམས་དཔའི་ས་གང་ལ་ཡང་དག་པར་ཞུགས་པས་ཇི་ལྟར་གནས་པར་བགྱི། ཇི་ལྟར་སྒྲུབ་པར་བགྱི། ཇི་ལྟར་སེམས་རབ་ཏུ་གཟུང་བར་བགྱི་ཞེས་དོན་ཚན་གསུམ་ཞུས་སོ། །",
            "type": "source",
            "mapping": []
        },
        {
            "content": "ཞུས་ཚུལ་དངོས་ནི་བཅོམ་ལྡན་འདས་བྱང་ཆུབ་སེམས་དཔའི་ས་གང་ལ་ཡང་དག་པར་ཞུགས་པས་ཇི་ལྟར་གནས་པར་བགྱི། ཇི་ལྟར་སྒྲུབ་པར་བགྱི། ཇི་ལྟར་སེམས་རབ་ཏུ་གཟུང་བར་བགྱི་ཞེས་དོན་ཚན་གསུམ་ཞུས་སོ། །",
            "type": "source",
            "mapping": []
        },
        {
            "content": "དེའི་ལན་རྣམས་རིམ་པར་བཤད་པ།གཉིས་པ་ལན་ལ། བཅོམ་ལྡན་འདས་ལ་རབ་འབྱོར་གྱིས་དེ་ལྟར་ཞུས་པ་ལ་ཐུགས་དགྱེས་ནས་ལེགས་སོ་དང་དེ་ཡིན་པའི་བདེན་ཁ་གནང་སྟེ།  དེ་བཞིན་གཤེགས་པས་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ལ་ཕན་གདགས་པ་དང༌། ཡོངས་སུ་གཏད་པར་ཞལ་གྱིས་བཞེས་སོ། །",
            "type": "source",
            "mapping": []
        },
        {
            "content": "དེའི་ལན་རྣམས་རིམ་པར་བཤད་པ།གཉིས་པ་ལན་ལ། བཅོམ་ལྡན་འདས་ལ་རབ་འབྱོར་གྱིས་དེ་ལྟར་ཞུས་པ་ལ་ཐུགས་དགྱེས་ནས་ལེགས་སོ་དང་དེ་ཡིན་པའི་བདེན་ཁ་གནང་སྟེ།  དེ་བཞིན་གཤེགས་པས་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ལ་ཕན་གདགས་པ་དང༌། ཡོངས་སུ་གཏད་པར་ཞལ་གྱིས་བཞེས་སོ། །",
            "type": "source",
            "mapping": []
        },
        {
            "content": "དེའི་ལན་རྣམས་རིམ་པར་བཤད་པ།གཉིས་པ་ལན་ལ། བཅོམ་ལྡན་འདས་ལ་རབ་འབྱོར་གྱིས་དེ་ལྟར་ཞུས་པ་ལ་ཐུགས་དགྱེས་ནས་ལེགས་སོ་དང་དེ་ཡིན་པའི་བདེན་ཁ་གནང་སྟེ།  དེ་བཞིན་གཤེགས་པས་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ལ་ཕན་གདགས་པ་དང༌། ཡོངས་སུ་གཏད་པར་ཞལ་གྱིས་བཞེས་སོ། །",
            "type": "source",
            "mapping": []
        },
        {
            "content": "དེའི་ལན་རྣམས་རིམ་པར་བཤད་པ།གཉིས་པ་ལན་ལ། བཅོམ་ལྡན་འདས་ལ་རབ་འབྱོར་གྱིས་དེ་ལྟར་ཞུས་པ་ལ་ཐུགས་དགྱེས་ནས་ལེགས་སོ་དང་དེ་ཡིན་པའི་བདེན་ཁ་གནང་སྟེ།  དེ་བཞིན་གཤེགས་པས་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ལ་ཕན་གདགས་པ་དང༌། ཡོངས་སུ་གཏད་པར་ཞལ་གྱིས་བཞེས་སོ། །",
            "type": "source",
            "mapping": []
        },
        {
            "content": "དེའི་ལན་རྣམས་རིམ་པར་བཤད་པ།གཉིས་པ་ལན་ལ། བཅོམ་ལྡན་འདས་ལ་རབ་འབྱོར་གྱིས་དེ་ལྟར་ཞུས་པ་ལ་ཐུགས་དགྱེས་ནས་ལེགས་སོ་དང་དེ་ཡིན་པའི་བདེན་ཁ་གནང་སྟེ།  དེ་བཞིན་གཤེགས་པས་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ལ་ཕན་གདགས་པ་དང༌། ཡོངས་སུ་གཏད་པར་ཞལ་གྱིས་བཞེས་སོ། །",
            "type": "source",
            "mapping": []
        },
        {
            "content": "རྒྱུ་མཚན་དེའི་ཕྱིར་ན། ལེགས་པར་ཉོན་ལ་ལེགས་པར་ཡིད་ལ་མི་བརྗེད་པར་ཟུངས་ཤིག་ཅེས་དང༌།",
            "type": "source",
            "mapping": []
        },
        {
            "content": "གོང་དུ་ཞུས་པའི་ཇི་ལྟར་གནས་པར་བྱ་བ་སོགས་གསུམ་ཁྱོད་ལ་བཤད་པར་བྱའོ་ཞེས་གསུངས།",
            "type": "source",
            "mapping": []
        },
        {
            "content": "ལན་ལ་རབ་འབྱོར་གྱིས་བཅོམ་ལྡན་འདས་དེ་དེ་བཞིན་ནོ་ཞེས་གསོལ་ནས་བཅོམ་ལྡན་འདས་ཀྱི་གསུངས་པ་ལྟར་མཉན་པ་དང༌།",
            "type": "source",
            "mapping": []
        },
        {
            "content": "ལན་ལ་རབ་འབྱོར་གྱིས་བཅོམ་ལྡན་འདས་དེ་དེ་བཞིན་ནོ་ཞེས་གསོལ་ནས་བཅོམ་ལྡན་འདས་ཀྱི་གསུངས་པ་ལྟར་མཉན་པ་དང༌།",
            "type": "source",
            "mapping": []
        },
        {
            "content": "འདིར་ཅུང་ཟད་བསྡུས་ནས་འཆད་པར་འདོད་པས་དང་པོ་བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་པ་ནི། རབ་འབྱོར་འདི་ལ་བྱང་ཆུབ་སེམས་དཔའི་ཐེག་པ་ལ་ཞུགས་པས་ཐོག་མར་སེམས་བསྐྱེད་པའི་ཚེ།འདི་སྙམ་དུ་སེམས་པར་བྱ་སྟེ། བདག་གིས་ནི་སེམས་ཅན་གྱི་ཁམས་དཔག་ཏུ་མེད་ཅིང་གྲངས་མེད་པ་ཞིག་ཡོད་པ་ཇི་ཙམ་པ་དེ་རྣམས་སྐྱེ་གནས་ཀྱི་སྒོ་ནས་སེམས་ཅན་གྱི་རིགས་སུ་བསྡུ་བས་བསྡུས་པ་ན། \n\nསྒོ་ང་ལས་སྐྱེས་པའམ། དེ་བཞིན་དུ་མངལ་དང༌། དྲོད་གཤེར་དང༌། རྫུས་ཏེ་སྐྱེས་པ་བཞི་དང༌། འདོད་ཁམས་དང་གཟུགས་ཁམས་ན་ཡོད་པའི་སེམས་ཅན་གཟུགས་ཅན་དང༌། གཟུགས་མེད་ན་ཡོད་པའི་གཟུགས་ཅན་མ་ཡིན་པ་དང༌། \n\nའབྲས་བུ་ཆེ་བ་དང་སྲིད་རྩེའི་སེམས་ཅན་ལས་གཞན་པའི་འདུ་ཤེས་ཅན་གྱི་སེམས་ཅན་དང༌། འབྲས་བུ་ཆེ་བའི་ཕྱོགས་གཅིག་གི་སེམས་ཅན་རྣམས་འདུ་ཤེས་མེད་པ་དང༌། སྲིད་རྩེར་སྐྱེས་པའི་སེམས་ཅན་རྣམས་འདུ་ཤེས་རགས་པ་མེད་ཅིང་ཕྲ་བ་མེད་པའང་མ་ཡིན་པ་སྟེ། \n\nམདོར་ན་སེམས་ཅན་གྱི་ཁམས་ཅི་ཙམ་དུ་སེམས་ཅན་ཞེས་མིང་གིས་གདགས་པས་བཏགས་པ་དེ་དག་ཐམས་ཅད་སྒྲིབ་གཉིས་དང་སྡུག་བསྔལ་གྱི་ཕུང་པོ་ལྷག་མ་མེད་པའི་མི་གནས་པའི་མྱ་ངན་ལས་འདས་པའི་དབྱིངས་སུ་ཡོངས་སུ་མྱ་ངན་ལས་བཟླའོ་སྙམ་དུ་སེམས་བསྐྱེད་པར་བྱའོ། ། དོན་བསྡུས་ན་སེམས་ཅན་དེ་ཐམས་ཅད་མི་གནས་པའི་མྱང་འདས་སངས་རྒྱས་ཀྱི་ཆོས་ཀྱི་སྐུ་ངོ་བོ་ཉིད་སྐུ་ཐོབ་པའི་ཆེད་དུ་སེམས་བསྐྱེད་པའོ།།",
            "type": "source",
            "mapping": []
        },
        {
            "content": "སེམས་ཅན་ཀུན་སྡུག་བསྔལ་གསུམ་པོ་ཅི་རིགས་ལས་སྐྱོབ་འདོད་ཀྱི་སྙིང་རྗེ་ཆེན་པོ་སྔོན་དུ་བཏང་ནས་མྱང་འདས་མཐར་ཐུག་ལ་འགོད་འདོད་ཀྱི་སེམས་གསར་དུ་བསྐྱེད་པ་དང༌། སྔར་བསྐྱེད་ཟིན་པ་ཞིག་ཡིན་ན་ནི་བསྐྱེད་པ་དེ་གསལ་བཏབ་སྟེ་གོང་འཕེལ་དུ་བྱེད་པའོ། །",
            "type": "source",
            "mapping": []
        },
        {
            "content": "གོང་གི་ཕྲོ་ནི། བདེན་པར་གྲུབ་པའི་སེམས་ཅན་གང་ཡང་མྱང་འདས་ཐོབ་པ་མེད་པར་སེམས་བསྐྱེད་དགོས་པའི་རྒྱུ་མཚན་ལ་དེ་ཅིའི་ཕྱིར་ཞེ་ན། རབ་འབྱོར་ཞེས་བོས་ནས་གལ་ཏེ་བྱང་ཆུབ་སེམས་དཔའ་གང་སེམས་ཅན་ལ་སེམས་ཅན་དུ་བདེན་པར་གྲུབ་པའི་འདུ་ཤེས་འཇུག་ན། བྱང་ཆུབ་སེམས་དཔའ་དེ་བདག་མེད་རྟོགས་པའི་བྱང་ཆུབ་སེམས་དཔའ་ཞེས་མི་བྱའོ། །",
            "type": "source",
            "mapping": []
        },
        {
            "content": "དེ་ཅིའི་ཕྱིར་ཞེ་ན། བྱང་ཆུབ་སེམས་དཔའ་གང་སེམས་ཅན་ལ་སེམས་ཅན་དུ་བདེན་པའི་འདུ་ཤེས་འཇུག་གམ། སྲོག་ཏུ་སྟེ་སྲོག་ལྡན་དུ་འདུ་ཤེས་འཇུག་གམ། །གང་ཟག་ཏུ་བདེན་པའི་འདུ་ཤེས་བདེན་འཛིན་སྐྱེ་ཞིང་འཇུག་ན་ནི། །དེ་བདེན་མེད་ཤེས་པའི་བྱང་སེམས་ཞེས་བྱར་མི་རུང་བའི་ཕྱིར་རོ། ། འཇུག་པ་ལས། དོན་དམ་སེམས་བསྐྱེད་རྒྱུད་ལ་མ་སྐྱེས་ན་དོན་དམ་པའི་བྱང་ཆུབ་སེམས་དཔའ་ཞེས་མི་བྱ་བར་གསུངས་པ་ནི་སྟོང་ཉིད་མངོན་སུམ་དུ་རྟོགས་མ་མྱོང་ན་དོན་དམ་པའི་བྱང་ཆུབ་སེམས་དཔའ་ཞེས་མི་བྱ་བའི་དོན་ཡིན་ལ། འདིར་ནི་ཚོགས་སྦྱོར་གཉིས་ན་བྱང་ཆུབ་སེམས་དཔའ་ཡོད་པས་དེའི་དབང་དུ་བྱས་ནས་བཤད་དོ། །",
            "type": "source",
            "mapping": []
        },
        {
            "content": "དེ་ལྟར་སེམས་བསྐྱེད་ནས་སྤྱོད་པ་ལ་སློབ་ཚུལ་ནི། སྦྱིན་པས་མཚོན་ནས་ཕར་ཕྱིན་གཞན་རྣམས་ལའང་སློབ་པར་སྟོན་པས་དང་པོ་སྦྱིན་པ་ནི། ཡང་རབ་འབྱོར་བྱང་ཆུབ་སེམས་དཔས་དངོས་པོ་ལ་མི་གནས་པར་སྦྱིན་པ་སྦྱིན་པར་བྱའོ་ཞེས་པའི་དངོས་པོ་ནི་སྦྱིན་བྱའི་དངོས་པོ་སྟེ་དེ་དང་སྦྱིན་པ་དང་གང་ལ་སྦྱིན་པའི་འཁོར་གསུམ་གྱི་དངོས་པོ་གསུམ་ལ་བདེན་ཞེན་གྱིས་མི་གནས་པར་སྦྱིན་པ་བྱེད་པའོ། ། དེ་ནི་བྱམས་སྨོན་ལས། དངོས་པོ་ཀུན་ལ་མི་གནས་པར། །སེར་སྣ་མ་མཆིས་སྦྱིན་གཏོང་ཤོག །ཅེས་དང༌། གང་གིས་སྦྱིན་པ་གང་ལ་སྦྱིན། །སྦྱིན་པ་ཇི་ལྟར་མི་དམིགས་པའི། །སྦྱིན་པ་ཞེས་གསུངས་པ་ལྟར་དང༌། དབུ་མ་འཇུག་པ་ལས།སྦྱིན་པ་སྦྱིན་བྱ་ལེན་པོ་གཏོང་བོས་སྟོང༌། །འཇིག་རྟེན་འདས་པའི་ཕ་རོལ་ཕྱིན་ཅེས་བྱ། །གསུམ་པོ་དག་ལ་ཆགས་སྐྱེས་གྱུར་པ་དེ། ། འཇིག་རྟེན་ལ་ཡི་ཕ་རོལ་ཕྱིན་ཅེས་བསྟན། །ཞེས་སྦྱིན་པའི་འཁོར་གསུམ་བདེན་མེད་དུ་མངོན་སུམ་དུ་རྟོག་པའི་ཤེས་རབ་ཟིན་པའི་སྦྱིན་པ་དེ་འཇིག་རྟེན་ལས་འདས་པའི་སྦྱིན་པའི་ཕར་ཕྱིན་དང༌། དེས་མ་ཟིན་པའི་སྦྱིན་པ་འཇིག་རྟེན་པའི་ཕར་ཕྱིན་དུ་བཤད་དེ། སྔ་མ་འཕགས་པ་དང་ཕྱི་མ་སོ་སྐྱེ་ལ་ཡོད་པའོ། །ལམ་མ་ཞུགས་ན་སྦྱིན་པ་ཡོད་ཀྱང་སྦྱིན་པའི་ཕར་ཕྱིན་མེད་ཅིང་གཞན་ལྔ་ལའང་འདྲའོ། ། སྦྱིན་པ་སྦྱིན་པ་ལ་བརྩོན་པ་ལྟ་བུ་ནི་ཇི་ལྟར་གནས་པར་བྱ་ཞེས་པའི་དོན་དང༌། དེའི་འཁོར་གསུམ་ལ་བདེན་པར་མི་ཞེན་པ་ནི་ཇི་ལྟར་བསྒྲུབ་པར་བྱ་ཞེས་པའི་དོན་དང༌། བདེན་མེད་དུ་རྟོགས་པའི་བློ་ལ་སེམས་རྩེ་གཅིག་ཏུ་བྱེད་པ་ནི་སེམས་རབ་ཏུ་གཟུང་བར་བྱ་ཞེས་པའི་དོན་དུ་བཤད་དེ། ཕར་ཕྱིན་གཞན་ལའང་སྦྱར་བར་བྱའོ། །",
            "type": "source",
            "mapping": []
        },
        {
            "content": "སྦྱིན་པའི་འཁོར་གསུམ་དུ་མ་ཟད་དངོས་པོ་གཞན་ཅི་ལ་ཡང་བདེན་པར་ཞེན་ཏེ་མི་གནས་པར་སྦྱིན་པ་བྱའོ། །",
            "type": "source",
            "mapping": []
        },
        {
            "content": "ཅུང་ཟད་ཕྱེ་སྟེ་བཤད་པ་ནི་གཟུགས་ལ་དང་སྒྲ་དང་དྲི་དང་རོ་དང་རེག་བྱ་དང་ཆོས་ལ་ཡང་བདེན་ཞེན་གྱིས་མི་གནས་པར་སྦྱིན་པ་བྱའོ་ཞེས་པ་སྟེ།  གཟུགས་ནི་ཕྱི་རོལ་གྱི་གཟུགས་མིག་ཤེས་ཀྱི་ཡུལ་རྣམས་དང༌། སྒྲ་ནི་རྣ་བའི་ཡུལ། དྲི་ནི་སྣའི་ཡུལ། རོ་ནི་ལྕེའི་ཡུལ། རེག་བྱ་ནི་ལུས་ཀྱི་ཡུལ། ཆོས་ནི་ཡིད་ཀྱི་ཡུལ་ཏེ། ཇི་ལྟ་ཇི་སྙེད་པའི་ཆོས་ཐམས་ཅད་དོ། །",
            "type": "source",
            "mapping": []
        },
        {
            "content": "ཅུང་ཟད་ཕྱེ་སྟེ་བཤད་པ་ནི་གཟུགས་ལ་དང་སྒྲ་དང་དྲི་དང་རོ་དང་རེག་བྱ་དང་ཆོས་ལ་ཡང་བདེན་ཞེན་གྱིས་མི་གནས་པར་སྦྱིན་པ་བྱའོ་ཞེས་པ་སྟེ།  གཟུགས་ནི་ཕྱི་རོལ་གྱི་གཟུགས་མིག་ཤེས་ཀྱི་ཡུལ་རྣམས་དང༌། སྒྲ་ནི་རྣ་བའི་ཡུལ། དྲི་ནི་སྣའི་ཡུལ། རོ་ནི་ལྕེའི་ཡུལ། རེག་བྱ་ནི་ལུས་ཀྱི་ཡུལ། ཆོས་ནི་ཡིད་ཀྱི་ཡུལ་ཏེ། ཇི་ལྟ་ཇི་སྙེད་པའི་ཆོས་ཐམས་ཅད་དོ། །",
            "type": "source",
            "mapping": []
        },
        {
            "content": "རབ་འབྱོར་ཆོས་ཐམས་ཅད་ཐ་སྙད་བཏགས་པ་ཙམ་དུ་ཡོད་པ་མ་གཏོགས། རང་བཞིན་གྱི་གྲུབ་པ་རྡུལ་ཙམ་ཡང་མེད་པའི་ཕྱིར་རང་བཞིན་གྱི་གྲུབ་པར་འཛིན་པ་ནི་ཕྱིན་ཅི་ལོག་ཏུ་ཞེན་པ་ཡིན་པས། ཅི་ནས་ཀྱང་རང་བཞིན་གྱི་གྲུབ་པར་ཞེན་པའི་མཚན་མར་འཛིན་པའི་འདུ་ཤེས་ལ་བྱང་ཆུབ་སེམས་དཔས་གནས་པར་མི་བྱའོ། ། མཚན་མར་འཛིན་པ་ནི་བདེན་འཛིན་གྱི་མིང་གི་རྣམ་གྲངས་ཏེ། བདེན་འཛིན་གྱིས་བཅིངས་ན་སྐྱོན་ཆེ་བའི་དཔེ་འོག་ཏུ་འཆད་དོ། །བདེན་འཛིན་གྱིས་བཅིངས་པའི་སྦྱིན་སོགས་ལས་བསོད་ནམས་ཆེན་པོ་འབྱུང་མོད། བདེན་འཛིན་གྱིས་བཅིངས་པ་དང་བྲལ་བའི་སྒོ་ནས་སྦྱིན་སོགས་བསྒྲུབས་ན་བསོད་ནམས་ལྷག་པར་ཆེ་བར་ངེས་ཞེས་སྟོན་པ་ནི།",
            "type": "source",
            "mapping": []
        },
        {
            "content": "དེ་ཅིའི་ཕྱིར་ཞེ་ན། རབ་འབྱོར་བྱང་ཆུབ་སེམས་དཔའ་གང་མི་གནས་པར་སྦྱིན་པ་སྦྱིན་པ་དེའི་བསོད་ནམས་ཀྱི་ཕུང་པོ་ཆེ་བའི་མཐའ་ཚད་ནི་གཞན་གྱིས་གཟུང་བར་སླ་བ་མིན་ཏེ་དཀའ་བའི་ཕྱིར་རོ། །",
            "type": "source",
            "mapping": []
        },
        {
            "content": "དེའི་དཔེ་སྟོན་པ་ནི། ཤར་ལ་སོགས་པ་ཕྱོགས་བཅུའི་ནམ་མཁའི་ཚད་གཟུང་བ་སླ་བ་མ་ཡིན་པ་ལྟ་བུ་སྟེ། རབ་འབྱོར་དེ་བཞིན་དུ་ཞེས་སོགས་ཀྱིས་དཔེ་བསྟན་པའི་དོན་བསྡུས་སོ། །སྦྱིན་སོགས་བསོད་ནམས་ཀྱི་ཚོགས་ལས་སངས་རྒྱས་ཀྱི་གཟུགས་སྐུ་འགྲུབ་པར་འགྱུར་ཞིང༌། གཟུགས་ཀྱི་སྐུ་ནི་མཚན་དཔེས་བརྒྱན་པའོ། །",
            "type": "source",
            "mapping": []
        },
        {
            "content": "དེའི་དཔེ་སྟོན་པ་ནི། ཤར་ལ་སོགས་པ་ཕྱོགས་བཅུའི་ནམ་མཁའི་ཚད་གཟུང་བ་སླ་བ་མ་ཡིན་པ་ལྟ་བུ་སྟེ། རབ་འབྱོར་དེ་བཞིན་དུ་ཞེས་སོགས་ཀྱིས་དཔེ་བསྟན་པའི་དོན་བསྡུས་སོ། །སྦྱིན་སོགས་བསོད་ནམས་ཀྱི་ཚོགས་ལས་སངས་རྒྱས་ཀྱི་གཟུགས་སྐུ་འགྲུབ་པར་འགྱུར་ཞིང༌། གཟུགས་ཀྱི་སྐུ་ནི་མཚན་དཔེས་བརྒྱན་པའོ། །",
            "type": "source",
            "mapping": []
        },
        {
            "content": "དེའི་དཔེ་སྟོན་པ་ནི། ཤར་ལ་སོགས་པ་ཕྱོགས་བཅུའི་ནམ་མཁའི་ཚད་གཟུང་བ་སླ་བ་མ་ཡིན་པ་ལྟ་བུ་སྟེ། རབ་འབྱོར་དེ་བཞིན་དུ་ཞེས་སོགས་ཀྱིས་དཔེ་བསྟན་པའི་དོན་བསྡུས་སོ། །སྦྱིན་སོགས་བསོད་ནམས་ཀྱི་ཚོགས་ལས་སངས་རྒྱས་ཀྱི་གཟུགས་སྐུ་འགྲུབ་པར་འགྱུར་ཞིང༌། གཟུགས་ཀྱི་སྐུ་ནི་མཚན་དཔེས་བརྒྱན་པའོ། །",
            "type": "source",
            "mapping": []
        },
        {
            "content": "དེའི་དཔེ་སྟོན་པ་ནི། ཤར་ལ་སོགས་པ་ཕྱོགས་བཅུའི་ནམ་མཁའི་ཚད་གཟུང་བ་སླ་བ་མ་ཡིན་པ་ལྟ་བུ་སྟེ། རབ་འབྱོར་དེ་བཞིན་དུ་ཞེས་སོགས་ཀྱིས་དཔེ་བསྟན་པའི་དོན་བསྡུས་སོ། །སྦྱིན་སོགས་བསོད་ནམས་ཀྱི་ཚོགས་ལས་སངས་རྒྱས་ཀྱི་གཟུགས་སྐུ་འགྲུབ་པར་འགྱུར་ཞིང༌། གཟུགས་ཀྱི་སྐུ་ནི་མཚན་དཔེས་བརྒྱན་པའོ། །",
            "type": "source",
            "mapping": []
        },
        {
            "content": "དེའི་དཔེ་སྟོན་པ་ནི། ཤར་ལ་སོགས་པ་ཕྱོགས་བཅུའི་ནམ་མཁའི་ཚད་གཟུང་བ་སླ་བ་མ་ཡིན་པ་ལྟ་བུ་སྟེ། རབ་འབྱོར་དེ་བཞིན་དུ་ཞེས་སོགས་ཀྱིས་དཔེ་བསྟན་པའི་དོན་བསྡུས་སོ། །སྦྱིན་སོགས་བསོད་ནམས་ཀྱི་ཚོགས་ལས་སངས་རྒྱས་ཀྱི་གཟུགས་སྐུ་འགྲུབ་པར་འགྱུར་ཞིང༌། གཟུགས་ཀྱི་སྐུ་ནི་མཚན་དཔེས་བརྒྱན་པའོ། །",
            "type": "source",
            "mapping": []
        },
        {
            "content": "རབ་འབྱོར་འདི་ཅི་སྙམ་དུ་སེམས་ཞེས་པ་ནི། རབ་འབྱོར་ཁྱོད་ཀྱིས་དོན་འདི་ལ་ཇི་ལྟར་ཡིན་སྙམ་དུ་སེམས་པ་སྟེ་བསམ། དེ་བཞིན་གཤེགས་པའི་གཟུགས་ཀྱི་སྐུ་རྣམ་པ་གཉིས་ནི་མཚན་དཔེ་ཕུན་སུམ་ཚོགས་པ་དང་ལྡན་པ་ཡིན་མོད། འོན་ཀྱང་མཚན་དཔེ་ཕུན་སུམ་ཚོགས་པ་ཡོད་པ་དེ་ཙམ་གྱིས་དེ་བཞིན་གཤེགས་པར་ལྟ་བ་སྟེ་འདོད་པར་བྱ་བ་ཡིན་སྙམ་མམ་ཞེས་དྲིས་པ་ན། རབ་འབྱོར་གྱིས་བཅོམ་ལྡན་འདས་དེ་ནི་དེ་ལྟར་བལྟ་བ་མ་ལགས་སོ་ཞེས་གསོལ་ཏེ།",
            "type": "source",
            "mapping": []
        },
        {
            "content": "རབ་འབྱོར་འདི་ཅི་སྙམ་དུ་སེམས་ཞེས་པ་ནི། རབ་འབྱོར་ཁྱོད་ཀྱིས་དོན་འདི་ལ་ཇི་ལྟར་ཡིན་སྙམ་དུ་སེམས་པ་སྟེ་བསམ། དེ་བཞིན་གཤེགས་པའི་གཟུགས་ཀྱི་སྐུ་རྣམ་པ་གཉིས་ནི་མཚན་དཔེ་ཕུན་སུམ་ཚོགས་པ་དང་ལྡན་པ་ཡིན་མོད། འོན་ཀྱང་མཚན་དཔེ་ཕུན་སུམ་ཚོགས་པ་ཡོད་པ་དེ་ཙམ་གྱིས་དེ་བཞིན་གཤེགས་པར་ལྟ་བ་སྟེ་འདོད་པར་བྱ་བ་ཡིན་སྙམ་མམ་ཞེས་དྲིས་པ་ན། རབ་འབྱོར་གྱིས་བཅོམ་ལྡན་འདས་དེ་ནི་དེ་ལྟར་བལྟ་བ་མ་ལགས་སོ་ཞེས་གསོལ་ཏེ།",
            "type": "source",
            "mapping": []
        },
        {
            "content": "རབ་འབྱོར་འདི་ཅི་སྙམ་དུ་སེམས་ཞེས་པ་ནི། རབ་འབྱོར་ཁྱོད་ཀྱིས་དོན་འདི་ལ་ཇི་ལྟར་ཡིན་སྙམ་དུ་སེམས་པ་སྟེ་བསམ། དེ་བཞིན་གཤེགས་པའི་གཟུགས་ཀྱི་སྐུ་རྣམ་པ་གཉིས་ནི་མཚན་དཔེ་ཕུན་སུམ་ཚོགས་པ་དང་ལྡན་པ་ཡིན་མོད། འོན་ཀྱང་མཚན་དཔེ་ཕུན་སུམ་ཚོགས་པ་ཡོད་པ་དེ་ཙམ་གྱིས་དེ་བཞིན་གཤེགས་པར་ལྟ་བ་སྟེ་འདོད་པར་བྱ་བ་ཡིན་སྙམ་མམ་ཞེས་དྲིས་པ་ན། རབ་འབྱོར་གྱིས་བཅོམ་ལྡན་འདས་དེ་ནི་དེ་ལྟར་བལྟ་བ་མ་ལགས་སོ་ཞེས་གསོལ་ཏེ།",
            "type": "source",
            "mapping": []
        },
        {
            "content": "ཅུང་ཟད་དབྱེ་བ་ནི་མཚན་དཔེ་ཕུན་སུམ་ཚོགས་པ་ཡོད་པ་དེ་ཙམ་གྱིས་དེ་བཞིན་གཤེགས་པར་བལྟ་བར་མི་བགྱིད་དེ།  དེ་ཅིའི་སླད་དུ་ཞེ་ན། དེ་བཞིན་གཤེགས་པས་གཟུགས་ཀྱི་སྐུའི་མཚན་དཔེ་ཕུན་སུམ་ཚོགས་པ་གང་གསུངས་པ་དེ་ཉིད་ཀུན་རྫོབ་ཏུ་སྒྱུ་མ་ལྟར་ཡོད་པར་གསུངས་ཀྱི། དོན་དམ་པར་མཚན་དཔེ་ཕུན་སུམ་ཚོགས་པ་མ་མཆིས་པའི་ལན་དུའོ་ཞེས་གསོལ་ཏེ། །གཟུགས་སྐུའི་མཚན་དཔེ་རྣམས་ནི་རི་མོས་བྲིས་པའི་གཟུགས་བརྙན་ལྟར་རྐྱེན་ཚོགས་པ་ལས་བྱུང་བའི་ཀུན་རྫོབ་བརྫུན་པའི་གནས་ཚུལ་ཡིན་གྱི། བདེན་པའི་རང་བཞིན་མིན་ནོ་ཞེས་སྟོན་པ་ནི།",
            "type": "source",
            "mapping": []
        },
        {
            "content": "ཅུང་ཟད་དབྱེ་བ་ནི་མཚན་དཔེ་ཕུན་སུམ་ཚོགས་པ་ཡོད་པ་དེ་ཙམ་གྱིས་དེ་བཞིན་གཤེགས་པར་བལྟ་བར་མི་བགྱིད་དེ།  དེ་ཅིའི་སླད་དུ་ཞེ་ན། དེ་བཞིན་གཤེགས་པས་གཟུགས་ཀྱི་སྐུའི་མཚན་དཔེ་ཕུན་སུམ་ཚོགས་པ་གང་གསུངས་པ་དེ་ཉིད་ཀུན་རྫོབ་ཏུ་སྒྱུ་མ་ལྟར་ཡོད་པར་གསུངས་ཀྱི། དོན་དམ་པར་མཚན་དཔེ་ཕུན་སུམ་ཚོགས་པ་མ་མཆིས་པའི་ལན་དུའོ་ཞེས་གསོལ་ཏེ། །གཟུགས་སྐུའི་མཚན་དཔེ་རྣམས་ནི་རི་མོས་བྲིས་པའི་གཟུགས་བརྙན་ལྟར་རྐྱེན་ཚོགས་པ་ལས་བྱུང་བའི་ཀུན་རྫོབ་བརྫུན་པའི་གནས་ཚུལ་ཡིན་གྱི། བདེན་པའི་རང་བཞིན་མིན་ནོ་ཞེས་སྟོན་པ་ནི།  \n\nབཅོམ་ལྡན་འདས་ཀྱིས་རབ་འབྱོར་ལ་ཅི་ཙམ་དུ་མཚན་ཕུན་སུམ་ཚོགས་པ་དེ་ཙམ་དུ་བརྫུན་ནོ་ཞེས་གསུངས། །",
            "type": "source",
            "mapping": []
        },
        {
            "content": "བཅོམ་ལྡན་འདས་ཀྱིས་རབ་འབྱོར་ལ་ཅི་ཙམ་དུ་མཚན་ཕུན་སུམ་ཚོགས་པ་དེ་ཙམ་དུ་བརྫུན་ནོ་ཞེས་གསུངས། །",
            "type": "source",
            "mapping": []
        },
        {
            "content": "འོ་ན་མི་བརྫུན་པ་གང་ཞེ་ན། ཇི་ཙམ་དུ་མཚན་དཔེ་ཕུན་སུམ་ཚོགས་པ་རྣམས་བདེན་པར་མེད་པ་དེ་ཙམ་ནི་མི་བརྫུན་ཞིང་བདེན་ཏེ།",
            "type": "source",
            "mapping": []
        },
        {
            "content": "དེ་ལྟར་དེ་བཞིན་གཤེགས་པ་ལ་བདེན་པར་གྲུབ་པའི་མཚན་དང་མཚན་མ་མེད་པར་བལྟ་བར་བྱའོ། །འདིས་གཟུགས་སྐུ་ལ་མཐའ་གཉིས་སེལ་ཏེ། །གཟུགས་སྐུ་དང་དེའི་མཚན་དཔེ་རྣམས་ཀུན་རྫོབ་བརྫུན་པའི་སྟོང་ཚུལ་དུ་ཡོད་པས་སྐུར་འདེབས་སེལ་ཞིང༌།བདེན་གྲུབ་ཀྱི་མཚན་དང་མཚན་མ་མེད་པར་བསྟན་པས་སྒྲོ་འདོགས་ཀྱི་མཐའ་སེལ་བའི་ཕྱིར་རོ། །དེའི་སྔ་མས་གཟུགས་སྐུ་དང་ཕྱི་མས་ཆོས་ཀྱི་སྐུ་བསྟན་ཏེ་ངོ་བོ་ཉིད་སྐུ་གཙོ་ཆེའོ། །དེ་ལྟ་བུའི་ཆོས་གཟུགས་ཀྱི་སྐུ་བཤད་པའི་མདོ་འདི་ལ་ཡིད་ཆེས་ཤིང་མོས་པའི་སེམས་ཅན་མ་འོངས་པ་འབྱུང་ངམ་ཞེས་པ་ནི།",
            "type": "source",
            "mapping": []
        },
        {
            "content": "དེ་ལྟར་དེ་བཞིན་གཤེགས་པ་ལ་བདེན་པར་གྲུབ་པའི་མཚན་དང་མཚན་མ་མེད་པར་བལྟ་བར་བྱའོ། །འདིས་གཟུགས་སྐུ་ལ་མཐའ་གཉིས་སེལ་ཏེ། །གཟུགས་སྐུ་དང་དེའི་མཚན་དཔེ་རྣམས་ཀུན་རྫོབ་བརྫུན་པའི་སྟོང་ཚུལ་དུ་ཡོད་པས་སྐུར་འདེབས་སེལ་ཞིང༌།བདེན་གྲུབ་ཀྱི་མཚན་དང་མཚན་མ་མེད་པར་བསྟན་པས་སྒྲོ་འདོགས་ཀྱི་མཐའ་སེལ་བའི་ཕྱིར་རོ། །དེའི་སྔ་མས་གཟུགས་སྐུ་དང་ཕྱི་མས་ཆོས་ཀྱི་སྐུ་བསྟན་ཏེ་ངོ་བོ་ཉིད་སྐུ་གཙོ་ཆེའོ། །དེ་ལྟ་བུའི་ཆོས་གཟུགས་ཀྱི་སྐུ་བཤད་པའི་མདོ་འདི་ལ་ཡིད་ཆེས་ཤིང་མོས་པའི་སེམས་ཅན་མ་འོངས་པ་འབྱུང་ངམ་ཞེས་པ་ནི།  \n\nརབ་འབྱོར་གྱིས་བཅོམ་ལྡན་འདས་མ་འོངས་པའི་དུས་ལྔ་བརྒྱའི་མཐའ་མ་ལ་དམ་པའི་ཆོས་རབ་ཏུ་རྣམ་པར་འཇིག་པར་འགྱུར་བ་ན་སོགས་ཏེ།",
            "type": "source",
            "mapping": []
        },
        {
            "content": "རབ་འབྱོར་གྱིས་བཅོམ་ལྡན་འདས་མ་འོངས་པའི་དུས་ལྔ་བརྒྱའི་མཐའ་མ་ལ་དམ་པའི་ཆོས་རབ་ཏུ་རྣམ་པར་འཇིག་པར་འགྱུར་བ་ན་སོགས་ཏེ།",
            "type": "source",
            "mapping": []
        },
        {
            "content": "ལན་དུ་བཅོམ་ལྡན་འདས་ཀྱིས་རབ་འབྱོར་ཁྱོད་དེ་སྐད་མ་ཟེར་ཅིག་ཅེས་པ་ནི་ཁྱོད་མ་འོངས་པ་ན་དེ་ལྟ་བུའི་གང་ཟག་འབྱུང་མི་འབྱུང་ལ་དོགས་པ་མ་ཟ་ནས་མ་འདྲི་ཤིག་ཅེས་པའི་དོན་ནོ། །",
            "type": "source",
            "mapping": []
        },
        {
            "content": "རབ་འབྱོར་མ་འོངས་པའི་དུས་སུ་དམ་པའི་ཆོས་འཇིག་པར་འགྱུར་བའི་ཚེ་ན་ཡང༌།བྱང་ཆུབ་སེམས་དཔའ་ཆེན་པོ་ལྷག་པ་ཚུལ་ཁྲིམས་ཀྱི་བསླབ་པ་དང་ལྡན་པ་དང༌། ལྷག་པ་ཏིང་ངེ་འཛིན་གྱི་བསླབ་པའི་ཡོན་ཏན་དང་ལྡན་པ་དང༌། ལྷག་པ་ཤེས་རབ་ཀྱི་བསླབ་པ་སྟེ་བསླབ་པ་གསུམ་དང་ལྡན་པ་དག་ངེས་པར་འབྱུང་སྟེ།",
            "type": "source",
            "mapping": []
        },
        {
            "content": "བྱང་ཆུབ་སེམས་དཔའ་ཆེན་པོ་དེ་དག་ཀྱང་སྔོན་སངས་རྒྱས་གཅིག་ཙམ་ལ་བསྙེན་བཀུར་ཞིང་དགེ་བའི་རྩ་བ་བསྐྱེད་པ་མ་ཡིན་གྱི། སངས་རྒྱས་འབུམ་ཕྲག་དུ་མ་ལ་བསྙེན་བཀུར་ཞིང་དགེ་རྩ་བསྐྱེད་པ་ཡིན་པར་ངས་མཁྱེན་ཏོ་ཞེས་པའོ། །ཀཱ་ཤཱིས་ལྔ་བརྒྱ་མཐའ་མ་ཞེས་བྱ་བ་ལ་བརྒྱ་ཕྲག་ལྔའི་ཚོགས་ནི་ལྔ་བརྒྱ་སྟེ། བཅོམ་ལྡན་འདས་ཀྱི་བསྟན་པ་ལྔ་བརྒྱ་ཕྲག་ལྔའི་བར་དུ་གནས་ཞེས་གྲགས་པས་ཞེས་བཤད་པའི་ལྔ་བརྒྱ་ཕྲག་ལྔ་ནི་ལོ་ཉིས་སྟོང་ལྔ་བརྒྱའི་བར་དུ་བསྟན་པ་གནས་ཞེས་པའོ། །",
            "type": "source",
            "mapping": []
        },
        {
            "content": "བྱང་ཆུབ་སེམས་དཔའ་ཆེན་པོ་དེ་དག་ཀྱང་སྔོན་སངས་རྒྱས་གཅིག་ཙམ་ལ་བསྙེན་བཀུར་ཞིང་དགེ་བའི་རྩ་བ་བསྐྱེད་པ་མ་ཡིན་གྱི། སངས་རྒྱས་འབུམ་ཕྲག་དུ་མ་ལ་བསྙེན་བཀུར་ཞིང་དགེ་རྩ་བསྐྱེད་པ་ཡིན་པར་ངས་མཁྱེན་ཏོ་ཞེས་པའོ། །ཀཱ་ཤཱིས་ལྔ་བརྒྱ་མཐའ་མ་ཞེས་བྱ་བ་ལ་བརྒྱ་ཕྲག་ལྔའི་ཚོགས་ནི་ལྔ་བརྒྱ་སྟེ། བཅོམ་ལྡན་འདས་ཀྱི་བསྟན་པ་ལྔ་བརྒྱ་ཕྲག་ལྔའི་བར་དུ་གནས་ཞེས་གྲགས་པས་ཞེས་བཤད་པའི་ལྔ་བརྒྱ་ཕྲག་ལྔ་ནི་ལོ་ཉིས་སྟོང་ལྔ་བརྒྱའི་བར་དུ་བསྟན་པ་གནས་ཞེས་པའོ། །",
            "type": "source",
            "mapping": []
        },
        {
            "content": "བྱང་ཆུབ་སེམས་དཔའ་ཆེན་པོ་དེ་དག་ཀྱང་སྔོན་སངས་རྒྱས་གཅིག་ཙམ་ལ་བསྙེན་བཀུར་ཞིང་དགེ་བའི་རྩ་བ་བསྐྱེད་པ་མ་ཡིན་གྱི། སངས་རྒྱས་འབུམ་ཕྲག་དུ་མ་ལ་བསྙེན་བཀུར་ཞིང་དགེ་རྩ་བསྐྱེད་པ་ཡིན་པར་ངས་མཁྱེན་ཏོ་ཞེས་པའོ། །ཀཱ་ཤཱིས་ལྔ་བརྒྱ་མཐའ་མ་ཞེས་བྱ་བ་ལ་བརྒྱ་ཕྲག་ལྔའི་ཚོགས་ནི་ལྔ་བརྒྱ་སྟེ། བཅོམ་ལྡན་འདས་ཀྱི་བསྟན་པ་ལྔ་བརྒྱ་ཕྲག་ལྔའི་བར་དུ་གནས་ཞེས་གྲགས་པས་ཞེས་བཤད་པའི་ལྔ་བརྒྱ་ཕྲག་ལྔ་ནི་ལོ་ཉིས་སྟོང་ལྔ་བརྒྱའི་བར་དུ་བསྟན་པ་གནས་ཞེས་པའོ། །",
            "type": "source",
            "mapping": []
        },
        {
            "content": "དེའི་ཚེ་སེམས་ཅན་གང་དག་འདི་ལྟ་བུའི་མདོ་སྡེ་ཤེར་ཕྱིན་སྟོན་པའི་གཞུང་རྣམས་ལ་ཐོས་བསམ་གྱི་དད་པ་མང་པོ་ལྟ་ཅི་སེམས་དང་བ་གཅིག་ཙམ་ཞིག་རྙེད་ཅིང་བསྐྱེད་པར་འགྱུར་བའི་སེམས་ཅན་དེ་རྣམས་ནི།  \n\nད་ལྟ་ནས་དེ་བཞིན་གཤེགས་པས་མཁྱེན་ཅིང་གཟིགས་ཏེ་སེམས་ཅན་དེ་དག་གིས་བསོད་ནམས་ཀྱི་ཕུང་པོ་དཔག་ཏུ་མེད་པ་བསྐྱེད་ཅིང་སྡུད་པར་འགྱུར་རོ། །མཁྱེན་པ་ནི་བསམ་པ་དང་གཟིགས་པ་ནི་གཟུགས་ལ་སོགས་པའོ། །",
            "type": "source",
            "mapping": []
        },
        {
            "content": "ད་ལྟ་ནས་དེ་བཞིན་གཤེགས་པས་མཁྱེན་ཅིང་གཟིགས་ཏེ་སེམས་ཅན་དེ་དག་གིས་བསོད་ནམས་ཀྱི་ཕུང་པོ་དཔག་ཏུ་མེད་པ་བསྐྱེད་ཅིང་སྡུད་པར་འགྱུར་རོ། །མཁྱེན་པ་ནི་བསམ་པ་དང་གཟིགས་པ་ནི་གཟུགས་ལ་སོགས་པའོ། །",
            "type": "source",
            "mapping": []
        },
        {
            "content": "ད་ལྟ་ནས་དེ་བཞིན་གཤེགས་པས་མཁྱེན་ཅིང་གཟིགས་ཏེ་སེམས་ཅན་དེ་དག་གིས་བསོད་ནམས་ཀྱི་ཕུང་པོ་དཔག་ཏུ་མེད་པ་བསྐྱེད་ཅིང་སྡུད་པར་འགྱུར་རོ། །མཁྱེན་པ་ནི་བསམ་པ་དང་གཟིགས་པ་ནི་གཟུགས་ལ་སོགས་པའོ། །",
            "type": "source",
            "mapping": []
        },
        {
            "content": "རྒྱུ་མཚན་དེ་ཅིའི་ཕྱིར་ཞེ་ན། བྱང་ཆུབ་སེམས་དཔའ་དེ་དག་ནི་བདག་དང་སེམས་ཅན་དང་སྲོག་དང་གང་ཟག་ཏུ་བདེན་པར་འཛིན་པའི་འདུ་ཤེས་མངོན་འགྱུར་བ་འཇུག་པར་མི་འགྱུར་བའི་ཕྱིར་རོ། །བདག་དང་གང་ཟག་སོགས་ཀྱི་སྒྲ་དོན་ནི་གོང་དུ་བཤད་པ་ལྟར་ཏེ། ཀཱ་ཤཱིས་ནི་ངའོ་སྙམ་དུ་བདག་ཡོད་པར་འཛིན་པ་ནི་བདག་ཏུ་འདུ་ཤེས་པའོ། ། བདག་གིར་ཡོད་པར་འཛིན་པ་ནི་སེམས་ཅན་དུ་འདུ་ཤེས་པའོ། ། བདག་དེ་ཉིད་ཀྱི་ཚེ་ཇི་སྲིད་གནས་ཀྱི་བར་ཡོངས་སུ་འཛིན་པ་ནི་སྲོག་ཏུ་འདུ་ཤེས་པའོ། །ཡང་དང་ཡང་དུ་འགྲོ་བ་དག་ཏུ་འགྲོ་བར་འཛིན་པ་ནི་གང་ཟག་ཏུ་འཛིན་པའོ་ཞེས་བཤད་དོ། །བདག་གིར་འཛིན་པའི་དོན་སྔ་མ་དང་ཅུང་མི་འདྲའོ། །དེ་ལྟ་བུའི་འདུ་ཤེས་རགས་པ་མི་འཇུག་པ་ནི་བདག་མེད་རྟོགས་པའི་སྐབས་ལ་དགོངས་སོ། །",
            "type": "source",
            "mapping": []
        },
        {
            "content": "རྒྱུ་མཚན་དེ་ཅིའི་ཕྱིར་ཞེ་ན། བྱང་ཆུབ་སེམས་དཔའ་དེ་དག་ནི་བདག་དང་སེམས་ཅན་དང་སྲོག་དང་གང་ཟག་ཏུ་བདེན་པར་འཛིན་པའི་འདུ་ཤེས་མངོན་འགྱུར་བ་འཇུག་པར་མི་འགྱུར་བའི་ཕྱིར་རོ། །བདག་དང་གང་ཟག་སོགས་ཀྱི་སྒྲ་དོན་ནི་གོང་དུ་བཤད་པ་ལྟར་ཏེ། ཀཱ་ཤཱིས་ནི་ངའོ་སྙམ་དུ་བདག་ཡོད་པར་འཛིན་པ་ནི་བདག་ཏུ་འདུ་ཤེས་པའོ། ། བདག་གིར་ཡོད་པར་འཛིན་པ་ནི་སེམས་ཅན་དུ་འདུ་ཤེས་པའོ། ། བདག་དེ་ཉིད་ཀྱི་ཚེ་ཇི་སྲིད་གནས་ཀྱི་བར་ཡོངས་སུ་འཛིན་པ་ནི་སྲོག་ཏུ་འདུ་ཤེས་པའོ། །ཡང་དང་ཡང་དུ་འགྲོ་བ་དག་ཏུ་འགྲོ་བར་འཛིན་པ་ནི་གང་ཟག་ཏུ་འཛིན་པའོ་ཞེས་བཤད་དོ། །བདག་གིར་འཛིན་པའི་དོན་སྔ་མ་དང་ཅུང་མི་འདྲའོ། །དེ་ལྟ་བུའི་འདུ་ཤེས་རགས་པ་མི་འཇུག་པ་ནི་བདག་མེད་རྟོགས་པའི་སྐབས་ལ་དགོངས་སོ། །",
            "type": "source",
            "mapping": []
        },
        {
            "content": "དེ་རྣམས་བདག་ཏུ་སོགས་བདེན་ཞེན་གྱིས་མི་འཇུག་པར་མ་ཟད། གཟུགས་སོགས་ལ་ཐ་སྙད་དུ་ཆོས་སུ་བདེན་པར་འདུ་ཤེས་པ་དང༌།ཆོས་སུ་མེད་པར་ཡང་བདེན་ཞེན་གྱི་འདུ་ཤེས་མི་འཇུག་སྟེ།",
            "type": "source",
            "mapping": []
        },
        {
            "content": "དེ་དག་ནི་དེ་ལྟ་བུའི་འདུ་ཤེས་ཡོད་པ་དང་འདུ་ཤེས་མེད་པར་ཡང་འཇུག་པར་མི་འགྱུར་རོ། །རྣམ་པ་གཅིག་ཏུ་ནི་གཟུགས་ལ་སོགས་པ་ཀུན་རྫོབ་པའི་ཆོས་དང༌། ཀུན་རྫོབ་པའི་ཆོས་རྣམས་བདེན་པར་མེད་པ་ལའང་བདེན་ཞེན་གྱི་འདུ་ཤེས་མི་འཇུག་པའི་དོན་དུ་བཤད་ཀྱང་རུང་སྟེ། འདུ་ཤེས་དེ་ལྟར་འཇུག་ན་སྐྱོན་དུ་འགྱུར་བ་ནི། ཆོས་སུ་འདུ་ཤེས་འཇུག་ན་ཡང་སོགས་དང༌། ཆོས་བདག་མེད་པར་འདུ་ཤེས་འཇུག་ན་ཡང་ཞེས་སོགས་དང་འབྲེལ་ལོ། །",
            "type": "source",
            "mapping": []
        },
        {
            "content": "དེ་དག་ནི་དེ་ལྟ་བུའི་འདུ་ཤེས་ཡོད་པ་དང་འདུ་ཤེས་མེད་པར་ཡང་འཇུག་པར་མི་འགྱུར་རོ། །རྣམ་པ་གཅིག་ཏུ་ནི་གཟུགས་ལ་སོགས་པ་ཀུན་རྫོབ་པའི་ཆོས་དང༌། ཀུན་རྫོབ་པའི་ཆོས་རྣམས་བདེན་པར་མེད་པ་ལའང་བདེན་ཞེན་གྱི་འདུ་ཤེས་མི་འཇུག་པའི་དོན་དུ་བཤད་ཀྱང་རུང་སྟེ། འདུ་ཤེས་དེ་ལྟར་འཇུག་ན་སྐྱོན་དུ་འགྱུར་བ་ནི། ཆོས་སུ་འདུ་ཤེས་འཇུག་ན་ཡང་སོགས་དང༌། ཆོས་བདག་མེད་པར་འདུ་ཤེས་འཇུག་ན་ཡང་ཞེས་སོགས་དང་འབྲེལ་ལོ། །",
            "type": "source",
            "mapping": []
        },
        {
            "content": "དེ་དག་ནི་དེ་ལྟ་བུའི་འདུ་ཤེས་ཡོད་པ་དང་འདུ་ཤེས་མེད་པར་ཡང་འཇུག་པར་མི་འགྱུར་རོ། །རྣམ་པ་གཅིག་ཏུ་ནི་གཟུགས་ལ་སོགས་པ་ཀུན་རྫོབ་པའི་ཆོས་དང༌། ཀུན་རྫོབ་པའི་ཆོས་རྣམས་བདེན་པར་མེད་པ་ལའང་བདེན་ཞེན་གྱི་འདུ་ཤེས་མི་འཇུག་པའི་དོན་དུ་བཤད་ཀྱང་རུང་སྟེ། འདུ་ཤེས་དེ་ལྟར་འཇུག་ན་སྐྱོན་དུ་འགྱུར་བ་ནི། ཆོས་སུ་འདུ་ཤེས་འཇུག་ན་ཡང་སོགས་དང༌། ཆོས་བདག་མེད་པར་འདུ་ཤེས་འཇུག་ན་ཡང་ཞེས་སོགས་དང་འབྲེལ་ལོ། །",
            "type": "source",
            "mapping": []
        },
        {
            "content": "དེ་དག་ནི་དེ་ལྟ་བུའི་འདུ་ཤེས་ཡོད་པ་དང་འདུ་ཤེས་མེད་པར་ཡང་འཇུག་པར་མི་འགྱུར་རོ། །རྣམ་པ་གཅིག་ཏུ་ནི་གཟུགས་ལ་སོགས་པ་ཀུན་རྫོབ་པའི་ཆོས་དང༌། ཀུན་རྫོབ་པའི་ཆོས་རྣམས་བདེན་པར་མེད་པ་ལའང་བདེན་ཞེན་གྱི་འདུ་ཤེས་མི་འཇུག་པའི་དོན་དུ་བཤད་ཀྱང་རུང་སྟེ། འདུ་ཤེས་དེ་ལྟར་འཇུག་ན་སྐྱོན་དུ་འགྱུར་བ་ནི། ཆོས་སུ་འདུ་ཤེས་འཇུག་ན་ཡང་སོགས་དང༌། ཆོས་བདག་མེད་པར་འདུ་ཤེས་འཇུག་ན་ཡང་ཞེས་སོགས་དང་འབྲེལ་ལོ། །",
            "type": "source",
            "mapping": []
        },
        {
            "content": "དེ་དག་ནི་དེ་ལྟ་བུའི་འདུ་ཤེས་ཡོད་པ་དང་འདུ་ཤེས་མེད་པར་ཡང་འཇུག་པར་མི་འགྱུར་རོ། །རྣམ་པ་གཅིག་ཏུ་ནི་གཟུགས་ལ་སོགས་པ་ཀུན་རྫོབ་པའི་ཆོས་དང༌། ཀུན་རྫོབ་པའི་ཆོས་རྣམས་བདེན་པར་མེད་པ་ལའང་བདེན་ཞེན་གྱི་འདུ་ཤེས་མི་འཇུག་པའི་དོན་དུ་བཤད་ཀྱང་རུང་སྟེ། འདུ་ཤེས་དེ་ལྟར་འཇུག་ན་སྐྱོན་དུ་འགྱུར་བ་ནི། ཆོས་སུ་འདུ་ཤེས་འཇུག་ན་ཡང་སོགས་དང༌། ཆོས་བདག་མེད་པར་འདུ་ཤེས་འཇུག་ན་ཡང་ཞེས་སོགས་དང་འབྲེལ་ལོ། །",
            "type": "source",
            "mapping": []
        },
        {
            "content": "ཡང་ཆོས་ཀྱང་ལོག་པར་གཟུང་བར་མི་བྱ་སྟེ། ཆོས་མ་ཡིན་པ་ཡང་མི་བཟུང་བའི་ཕྱིར་རོ་ཞེས་པའི་ཆོས་ནི་ལུང་གི་དམ་པའི་ཆོས་བདེན་ཞེན་གྱིས་ལོག་པར་མི་བཟུང་བ་དང༌། ཆོས་མ་ཡིན་པ་ནི་དམ་པའི་ཆོས་མ་ཡིན་པ་མུ་སྟེགས་ཀྱི་གཞུང་སོགས་མི་བཟུང་བར་བཤད་པ་ལྟར་ན་དཔྱད་དགོས་པར་སྣང་ངོ༌། །",
            "type": "source",
            "mapping": []
        },
        {
            "content": "རྒྱུ་མཚན་དེ་བས་ན་དེ་བཞིན་གཤེགས་པས་ཚུལ་དེ་ལ་དགོངས་ནས་ལུང་གི་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་གྲུ་གཟིངས་ལྟ་བུ་སྟེ་གྲུ་གཟིངས་ནི་ཆུའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ན་མི་དགོས་པར་ཤེས་པ་ལྟ་བུ་མཐར་ཕྱིན་པའི་འཕགས་པ་རྣམས་ཀྱིས་ནི།འབྲས་བུ་ཐོབ་བྱེད་ཀྱི་ཐབས་ལུང་གི་ཚོགས་ལྟ་བུའི་ཆོས་རྣམས་ཀྱང་འབྲས་བུ་ཐོབ་པའི་ཚེ་འདོར་ཞིང་སྤང་བར་བྱ་ན། དམ་པའི་ཆོས་མ་ཡིན་པ་རྣམས་འདོར་བ་གཞིར་བཅས་ཏེ་ལྟ་ཅི་སྨོས་སོ་ཞེས་གསུངས་སོ། །དེ་ནི་འབྲས་བུ་ཐོབ་པའི་ཚེ་དགོས་པ་གྲུབ་ཟིན་པས་ལུང་དེ་ལྟ་བུ་རང་དོན་དུ་དགོས་པ་མེད་པ་དང༌། དེ་ལ་རག་མ་ལས་པའི་དོན་ནོ། །",
            "type": "source",
            "mapping": []
        },
        {
            "content": "ཡང་བཅོམ་ལྡན་འདས་ཀྱིས་རབ་འབྱོར་ལ་དེ་བཞིན་གཤེགས་པས་ཆོས་གང་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་རྫོགས་པའི་སངས་རྒྱས་པའི་ཆོས་དང་གསུངས་པའི་ཆོས་དེ་གང་ཡང་ཡོད་ཅིང་བསྟན་ནམ་སྙམ་དུ་སེམས་སམ་ཞེས་གསུངས་པ་ན།",
            "type": "source",
            "mapping": []
        },
        {
            "content": "ཡང་བཅོམ་ལྡན་འདས་ཀྱིས་རབ་འབྱོར་ལ་དེ་བཞིན་གཤེགས་པས་ཆོས་གང་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་རྫོགས་པའི་སངས་རྒྱས་པའི་ཆོས་དང་གསུངས་པའི་ཆོས་དེ་གང་ཡང་ཡོད་ཅིང་བསྟན་ནམ་སྙམ་དུ་སེམས་སམ་ཞེས་གསུངས་པ་ན།",
            "type": "source",
            "mapping": []
        },
        {
            "content": "ཡང་བཅོམ་ལྡན་འདས་ཀྱིས་རབ་འབྱོར་ལ་དེ་བཞིན་གཤེགས་པས་ཆོས་གང་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་རྫོགས་པའི་སངས་རྒྱས་པའི་ཆོས་དང་གསུངས་པའི་ཆོས་དེ་གང་ཡང་ཡོད་ཅིང་བསྟན་ནམ་སྙམ་དུ་སེམས་སམ་ཞེས་གསུངས་པ་ན།",
            "type": "source",
            "mapping": []
        },
        {
            "content": "ཡང་བཅོམ་ལྡན་འདས་ཀྱིས་རབ་འབྱོར་ལ་དེ་བཞིན་གཤེགས་པས་ཆོས་གང་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་རྫོགས་པའི་སངས་རྒྱས་པའི་ཆོས་དང་གསུངས་པའི་ཆོས་དེ་གང་ཡང་ཡོད་ཅིང་བསྟན་ནམ་སྙམ་དུ་སེམས་སམ་ཞེས་གསུངས་པ་ན།",
            "type": "source",
            "mapping": []
        },
        {
            "content": "ཡང་བཅོམ་ལྡན་འདས་ཀྱིས་རབ་འབྱོར་ལ་དེ་བཞིན་གཤེགས་པས་ཆོས་གང་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་རྫོགས་པའི་སངས་རྒྱས་པའི་ཆོས་དང་གསུངས་པའི་ཆོས་དེ་གང་ཡང་ཡོད་ཅིང་བསྟན་ནམ་སྙམ་དུ་སེམས་སམ་ཞེས་གསུངས་པ་ན།",
            "type": "source",
            "mapping": []
        },
        {
            "content": "རབ་འབྱོར་གྱིས་ལན་དུ་བདག་གིས་བཅོམ་ལྡན་འདས་ཀྱིས་གསུངས་པའི་དོན་འཚལ་བ་སྟེ་གོ་ཞིང་ཤེས་པ་ལྟར་ན། དོན་དམ་པར་སངས་རྒྱས་པ་དང་བསྟན་པའི་ཆོས་གང་ཡང་མ་མཆིས་སོ། །",
            "type": "source",
            "mapping": []
        },
        {
            "content": "རབ་འབྱོར་གྱིས་ལན་དུ་བདག་གིས་བཅོམ་ལྡན་འདས་ཀྱིས་གསུངས་པའི་དོན་འཚལ་བ་སྟེ་གོ་ཞིང་ཤེས་པ་ལྟར་ན། དོན་དམ་པར་སངས་རྒྱས་པ་དང་བསྟན་པའི་ཆོས་གང་ཡང་མ་མཆིས་སོ། །",
            "type": "source",
            "mapping": []
        },
        {
            "content": "རྒྱུ་མཚན་ནི་དེ་ཅིའི་སླད་དུ་ཞེ་ན། དེ་བཞིན་གཤེགས་པས་ཐ་སྙད་དུ་རང་གིས་མངོན་དུ་བྱས་ཤིང༌། མངོན་པར་རྫོགས་པར་སངས་རྒྱས་པའམ། ཐ་སྙད་དུ་ཆོས་བསྟན་པའོ་ཞེས་བཤད་ཀྱང་དོན་དམ་པར་སངས་རྒྱས་པ་དང་དེས་བསྟན་པའི་ཆོས་དེ་གང་ཡང་མེད་ཅིང་དེ་དག་གི་བདེན་སྟོང་ཆོས་ཉིད་དེ་འཕགས་པའི་མཉམ་བཞག་གི་གཟིགས་ངོ་ན།ཡོད་པ་ལྟར་ཐ་སྙད་པའི་བློ་དོན་མཐུན་གྱིས་གཟུང་དུ་མ་མཆིས། ཚིག་གིས་སྤྲོས་མེད་ཀྱི་ཚུལ་དུ་བརྗོད་དུ་མ་མཆིས་ཏེ།",
            "type": "source",
            "mapping": []
        },
        {
            "content": "དེ་དག་ནི་དོན་དམ་པར་ཆོས་ཀྱང་མ་ལགས། ཐ་སྙད་དུ་ཆོས་མ་མཆིས་པ་སྟེ་མེད་པ་ཡང་མ་ལགས་པའི་སླད་དུ་སྟེ་དེའི་ཕྱིར་རོ། །",
            "type": "source",
            "mapping": []
        },
        {
            "content": "རྒྱུ་མཚན་དེ་ཅིའི་སླད་དུ་ཞེ་ན། འཕགས་པའི་གང་ཟག་རྣམས་ནི་ཆོས་ཐམས་ཅད་རང་བཞིན་གྱིས་སྟོང་པ་འདུས་མ་བྱས་ཀྱི་ཆོས་ཉིད་མངོན་སུམ་དུ་རྟོགས་མྱོང་བས་རབ་ཏུ་ཕྱེ་བ་སྟེ་བཞག་པའི་སླད་དུའོ་ཞེས་ཞུས་སོ། །འདི་དག་ནི་འཕགས་པའི་མཉམ་བཞག་ཡེ་ཤེས་ཀྱི་གཟིགས་ངོར་སྤྲོས་པ་དང་བྲལ་བ་ལ་དགོངས་སོ། །",
            "type": "source",
            "mapping": []
        },
        {
            "content": "བཅོམ་ལྡན་འདས་ཀྱིས་རབ་འབྱོར་ལ་ཁྱོད་འདི་སྙམ་དུ་སེམས།",
            "type": "source",
            "mapping": []
        },
        {
            "content": "རིགས་ཀྱི་བུ་དང་བུ་མོ་གང་ལ་ལ་ཞིག་གིས། ཇི་སྐད་དུ་མཛོད་ལས། གླིང་བཞི་པ་དང་ཉི་ཟླ་དང༌། །རི་རབ་དང་ནི་འདོད་ལྷ་དང༌། །ཚངས་པའི་འཇིག་རྟེན་སྟོང་ལ་ནི། །སྟོང་ནི་སྤྱི་ཕུད་ཡིན་པར་འདོད། །དེ་སྟོང་ལ་ནི་སྟོང་གཉིས་པ། །བར་མའི་འཇིག་རྟེན་ཁམས་ཡིན་ནོ། །དེ་སྟོང་ལ་ནི་སྟོང་གསུམ་མོ། །ཞེས་འབྱུང་བ་ལྟར།  \n\nསྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་འདི་གསེར་དང་དངུལ་དང་ཤེལ་དང་བཻཌཱུརྱ་དང་རྡོའི་སྙིང་པོ་དང་སྤུག་དང་མུ་ཏིག་དམར་པོ་སྟེ་རིན་པོ་ཆེ་སྣ་བདུན་གྱིས་གང་བར་བྱས་ཏེ། གཞན་ལ་སྦྱིན་པ་བྱིན་ན་བསོད་ནམས་ཀྱི་ཕུང་པོ་མང་དུ་བསྐྱེད་དམ་དྲིས་པས།",
            "type": "source",
            "mapping": []
        },
        {
            "content": "ལན་དུ་རབ་འབྱོར་གྱིས་བསོད་ནམས་ཀྱི་ཕུང་པོ་མང་བར་ཞུས་ཤིང་བསོད་ནམས་ཀྱི་ཕུང་པོ་དེ་ཡང་རྨི་ལམ་དང་སྒྱུ་མ་ལྟ་བུར་ཐ་སྙད་ཙམ་དུ་ཡོད་པར་འཇོག་ལགས་ཀྱི། བསོད་ནམས་ཀྱི་ཕུང་པོ་དེ་ཉིད་དོན་དམ་པར་ཕུང་པོར་གྲུབ་པ་མ་མཆིས་ཤིང༌། ཐ་སྙད་དུ་དེ་བཞིན་གཤེགས་པས་དེ་ལ་བསོད་ནམས་ཀྱི་ཕུང་པོ། །བསོད་ནམས་ཀྱི་ཕུང་པོ་ཞེས་ཐ་སྙད་མཛད་ཅིང་གསུངས་སོ་ཞེས་གསོལ། ། འདིས་ནི་ལས་དཀར་ནག་སྔར་བྱས་པ་དང་ཕྱིས་བྱེད་པར་འགྱུར་བའི་འདས་པ་འགག་ཤིང་མ་འོངས་པ་ད་ལྟ་མ་བྱུང་བས་མེད་ཀྱང༌། སྤྱིར་ཡོད་པར་འདོད་དགོས་ཤིང་དེ་ཉིད་བྱེད་པ་པོའི་སེམས་རྒྱུད་དང་འབྲེལ་བ་ལས་འབྲས་བུ་འབྱུང་བར་འདོད་དགོས་ཚུལ་ལ་སོགས་བསྟན་ཏེ་ཅུང་དཀའ་བའི་གནས་ཡིན་ནོ། །",
            "type": "source",
            "mapping": []
        },
        {
            "content": "ལན་དུ་རབ་འབྱོར་གྱིས་བསོད་ནམས་ཀྱི་ཕུང་པོ་མང་བར་ཞུས་ཤིང་བསོད་ནམས་ཀྱི་ཕུང་པོ་དེ་ཡང་རྨི་ལམ་དང་སྒྱུ་མ་ལྟ་བུར་ཐ་སྙད་ཙམ་དུ་ཡོད་པར་འཇོག་ལགས་ཀྱི། བསོད་ནམས་ཀྱི་ཕུང་པོ་དེ་ཉིད་དོན་དམ་པར་ཕུང་པོར་གྲུབ་པ་མ་མཆིས་ཤིང༌། ཐ་སྙད་དུ་དེ་བཞིན་གཤེགས་པས་དེ་ལ་བསོད་ནམས་ཀྱི་ཕུང་པོ། །བསོད་ནམས་ཀྱི་ཕུང་པོ་ཞེས་ཐ་སྙད་མཛད་ཅིང་གསུངས་སོ་ཞེས་གསོལ། ། འདིས་ནི་ལས་དཀར་ནག་སྔར་བྱས་པ་དང་ཕྱིས་བྱེད་པར་འགྱུར་བའི་འདས་པ་འགག་ཤིང་མ་འོངས་པ་ད་ལྟ་མ་བྱུང་བས་མེད་ཀྱང༌། སྤྱིར་ཡོད་པར་འདོད་དགོས་ཤིང་དེ་ཉིད་བྱེད་པ་པོའི་སེམས་རྒྱུད་དང་འབྲེལ་བ་ལས་འབྲས་བུ་འབྱུང་བར་འདོད་དགོས་ཚུལ་ལ་སོགས་བསྟན་ཏེ་ཅུང་དཀའ་བའི་གནས་ཡིན་ནོ། །",
            "type": "source",
            "mapping": []
        },
        {
            "content": "ལན་དུ་རབ་འབྱོར་གྱིས་བསོད་ནམས་ཀྱི་ཕུང་པོ་མང་བར་ཞུས་ཤིང་བསོད་ནམས་ཀྱི་ཕུང་པོ་དེ་ཡང་རྨི་ལམ་དང་སྒྱུ་མ་ལྟ་བུར་ཐ་སྙད་ཙམ་དུ་ཡོད་པར་འཇོག་ལགས་ཀྱི། བསོད་ནམས་ཀྱི་ཕུང་པོ་དེ་ཉིད་དོན་དམ་པར་ཕུང་པོར་གྲུབ་པ་མ་མཆིས་ཤིང༌། ཐ་སྙད་དུ་དེ་བཞིན་གཤེགས་པས་དེ་ལ་བསོད་ནམས་ཀྱི་ཕུང་པོ། །བསོད་ནམས་ཀྱི་ཕུང་པོ་ཞེས་ཐ་སྙད་མཛད་ཅིང་གསུངས་སོ་ཞེས་གསོལ། ། འདིས་ནི་ལས་དཀར་ནག་སྔར་བྱས་པ་དང་ཕྱིས་བྱེད་པར་འགྱུར་བའི་འདས་པ་འགག་ཤིང་མ་འོངས་པ་ད་ལྟ་མ་བྱུང་བས་མེད་ཀྱང༌། སྤྱིར་ཡོད་པར་འདོད་དགོས་ཤིང་དེ་ཉིད་བྱེད་པ་པོའི་སེམས་རྒྱུད་དང་འབྲེལ་བ་ལས་འབྲས་བུ་འབྱུང་བར་འདོད་དགོས་ཚུལ་ལ་སོགས་བསྟན་ཏེ་ཅུང་དཀའ་བའི་གནས་ཡིན་ནོ། །",
            "type": "source",
            "mapping": []
        },
        {
            "content": "ལན་དུ་རབ་འབྱོར་གྱིས་བསོད་ནམས་ཀྱི་ཕུང་པོ་མང་བར་ཞུས་ཤིང་བསོད་ནམས་ཀྱི་ཕུང་པོ་དེ་ཡང་རྨི་ལམ་དང་སྒྱུ་མ་ལྟ་བུར་ཐ་སྙད་ཙམ་དུ་ཡོད་པར་འཇོག་ལགས་ཀྱི། བསོད་ནམས་ཀྱི་ཕུང་པོ་དེ་ཉིད་དོན་དམ་པར་ཕུང་པོར་གྲུབ་པ་མ་མཆིས་ཤིང༌། ཐ་སྙད་དུ་དེ་བཞིན་གཤེགས་པས་དེ་ལ་བསོད་ནམས་ཀྱི་ཕུང་པོ། །བསོད་ནམས་ཀྱི་ཕུང་པོ་ཞེས་ཐ་སྙད་མཛད་ཅིང་གསུངས་སོ་ཞེས་གསོལ། ། འདིས་ནི་ལས་དཀར་ནག་སྔར་བྱས་པ་དང་ཕྱིས་བྱེད་པར་འགྱུར་བའི་འདས་པ་འགག་ཤིང་མ་འོངས་པ་ད་ལྟ་མ་བྱུང་བས་མེད་ཀྱང༌། སྤྱིར་ཡོད་པར་འདོད་དགོས་ཤིང་དེ་ཉིད་བྱེད་པ་པོའི་སེམས་རྒྱུད་དང་འབྲེལ་བ་ལས་འབྲས་བུ་འབྱུང་བར་འདོད་དགོས་ཚུལ་ལ་སོགས་བསྟན་ཏེ་ཅུང་དཀའ་བའི་གནས་ཡིན་ནོ། །",
            "type": "source",
            "mapping": []
        },
        {
            "content": "ལན་དུ་རབ་འབྱོར་གྱིས་བསོད་ནམས་ཀྱི་ཕུང་པོ་མང་བར་ཞུས་ཤིང་བསོད་ནམས་ཀྱི་ཕུང་པོ་དེ་ཡང་རྨི་ལམ་དང་སྒྱུ་མ་ལྟ་བུར་ཐ་སྙད་ཙམ་དུ་ཡོད་པར་འཇོག་ལགས་ཀྱི། བསོད་ནམས་ཀྱི་ཕུང་པོ་དེ་ཉིད་དོན་དམ་པར་ཕུང་པོར་གྲུབ་པ་མ་མཆིས་ཤིང༌། ཐ་སྙད་དུ་དེ་བཞིན་གཤེགས་པས་དེ་ལ་བསོད་ནམས་ཀྱི་ཕུང་པོ། །བསོད་ནམས་ཀྱི་ཕུང་པོ་ཞེས་ཐ་སྙད་མཛད་ཅིང་གསུངས་སོ་ཞེས་གསོལ། ། འདིས་ནི་ལས་དཀར་ནག་སྔར་བྱས་པ་དང་ཕྱིས་བྱེད་པར་འགྱུར་བའི་འདས་པ་འགག་ཤིང་མ་འོངས་པ་ད་ལྟ་མ་བྱུང་བས་མེད་ཀྱང༌། སྤྱིར་ཡོད་པར་འདོད་དགོས་ཤིང་དེ་ཉིད་བྱེད་པ་པོའི་སེམས་རྒྱུད་དང་འབྲེལ་བ་ལས་འབྲས་བུ་འབྱུང་བར་འདོད་དགོས་ཚུལ་ལ་སོགས་བསྟན་ཏེ་ཅུང་དཀའ་བའི་གནས་ཡིན་ནོ། །",
            "type": "source",
            "mapping": []
        },
        {
            "content": "ལན་དུ་རབ་འབྱོར་གྱིས་བསོད་ནམས་ཀྱི་ཕུང་པོ་མང་བར་ཞུས་ཤིང་བསོད་ནམས་ཀྱི་ཕུང་པོ་དེ་ཡང་རྨི་ལམ་དང་སྒྱུ་མ་ལྟ་བུར་ཐ་སྙད་ཙམ་དུ་ཡོད་པར་འཇོག་ལགས་ཀྱི། བསོད་ནམས་ཀྱི་ཕུང་པོ་དེ་ཉིད་དོན་དམ་པར་ཕུང་པོར་གྲུབ་པ་མ་མཆིས་ཤིང༌། ཐ་སྙད་དུ་དེ་བཞིན་གཤེགས་པས་དེ་ལ་བསོད་ནམས་ཀྱི་ཕུང་པོ། །བསོད་ནམས་ཀྱི་ཕུང་པོ་ཞེས་ཐ་སྙད་མཛད་ཅིང་གསུངས་སོ་ཞེས་གསོལ། ། འདིས་ནི་ལས་དཀར་ནག་སྔར་བྱས་པ་དང་ཕྱིས་བྱེད་པར་འགྱུར་བའི་འདས་པ་འགག་ཤིང་མ་འོངས་པ་ད་ལྟ་མ་བྱུང་བས་མེད་ཀྱང༌། སྤྱིར་ཡོད་པར་འདོད་དགོས་ཤིང་དེ་ཉིད་བྱེད་པ་པོའི་སེམས་རྒྱུད་དང་འབྲེལ་བ་ལས་འབྲས་བུ་འབྱུང་བར་འདོད་དགོས་ཚུལ་ལ་སོགས་བསྟན་ཏེ་ཅུང་དཀའ་བའི་གནས་ཡིན་ནོ། ། \n\nཚིགས་སུ་བཅད་པ་ཞེས་འབྱུང་བ་ནི་འདི་བོད་སྐད་དུ་ཚིགས་བཅད་མ་ཡིན་ཀྱང་ལེགས་སྦྱར་གྱི་སྐད་ལ་ཚིགས་བཅད་དུ་བསྒྲིག་རྒྱུ་ཡོད་པ་ལ་དགོངས་པའོ། །བཟུང་བ་ནི་ཚིག་བློ་ལ་བཟུང་བ་དང༌། གླེགས་བམ་ལག་ཏུ་ཡོད་པ་ལའང་བྱར་རུང་ཞིང་ཁ་ཏོན་བྱེད་པ་དང༌། ཡང་དག་པར་འཆད་པ་ནི་ཚིག་བརྗོད་ཅིང་ལེགས་པར་འཆད་པ་དང༌། སྟོན་པ་ནི་དོན་ལེགས་པར་སྟོན་པ་ལ་བཤད་ཅིང་དེ་ནི་གཙོ་ཆེ་བའི་དབང་དུ་མཛད་པའོ། །དེ་ལྟར་བཟུང་བ་སོགས་བྱས་ན་དེ་ལས་བསོད་ནམས་ཀྱི་ཕུང་པོ་ཆེས་གྲངས་མེད་ཅིང་དཔག་ཏུ་མེད་པ་ཞིག་བསྐྱེད་དོ། ། རྒྱུ་མཚན་ནི། ཟང་ཟིང་གི་སྦྱིན་པ་བྱིན་པ་ལས་ཆོས་ཀྱི་སྦྱིན་པ་བྱིན་པ་ཕན་ཡོན་ལྷག་པར་ཆེ་ཞིང༌། དེར་མ་ཟད། ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཀྱི་བྱང་ཆུབ་ནི་གཞུང་འདིའི་བརྗོད་བྱའི་དོན་སྟོང་ཉིད་རྟོགས་པའི་ཤེར་ཕྱིན་འདི་ལས་ཐོབ་ཅིང་བྱུང་སྟེ། སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ཀྱང་འདི་ཉམས་སུ་བླངས་པ་ལས་སྐྱེས་པའི་ཕྱིར་རོ། །",
            "type": "source",
            "mapping": []
        },
        {
            "content": "ཚིགས་སུ་བཅད་པ་ཞེས་འབྱུང་བ་ནི་འདི་བོད་སྐད་དུ་ཚིགས་བཅད་མ་ཡིན་ཀྱང་ལེགས་སྦྱར་གྱི་སྐད་ལ་ཚིགས་བཅད་དུ་བསྒྲིག་རྒྱུ་ཡོད་པ་ལ་དགོངས་པའོ། །བཟུང་བ་ནི་ཚིག་བློ་ལ་བཟུང་བ་དང༌། གླེགས་བམ་ལག་ཏུ་ཡོད་པ་ལའང་བྱར་རུང་ཞིང་ཁ་ཏོན་བྱེད་པ་དང༌། ཡང་དག་པར་འཆད་པ་ནི་ཚིག་བརྗོད་ཅིང་ལེགས་པར་འཆད་པ་དང༌། སྟོན་པ་ནི་དོན་ལེགས་པར་སྟོན་པ་ལ་བཤད་ཅིང་དེ་ནི་གཙོ་ཆེ་བའི་དབང་དུ་མཛད་པའོ། །དེ་ལྟར་བཟུང་བ་སོགས་བྱས་ན་དེ་ལས་བསོད་ནམས་ཀྱི་ཕུང་པོ་ཆེས་གྲངས་མེད་ཅིང་དཔག་ཏུ་མེད་པ་ཞིག་བསྐྱེད་དོ། ། རྒྱུ་མཚན་ནི། ཟང་ཟིང་གི་སྦྱིན་པ་བྱིན་པ་ལས་ཆོས་ཀྱི་སྦྱིན་པ་བྱིན་པ་ཕན་ཡོན་ལྷག་པར་ཆེ་ཞིང༌། དེར་མ་ཟད། ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཀྱི་བྱང་ཆུབ་ནི་གཞུང་འདིའི་བརྗོད་བྱའི་དོན་སྟོང་ཉིད་རྟོགས་པའི་ཤེར་ཕྱིན་འདི་ལས་ཐོབ་ཅིང་བྱུང་སྟེ། སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ཀྱང་འདི་ཉམས་སུ་བླངས་པ་ལས་སྐྱེས་པའི་ཕྱིར་རོ། །",
            "type": "source",
            "mapping": []
        },
        {
            "content": "ཚིགས་སུ་བཅད་པ་ཞེས་འབྱུང་བ་ནི་འདི་བོད་སྐད་དུ་ཚིགས་བཅད་མ་ཡིན་ཀྱང་ལེགས་སྦྱར་གྱི་སྐད་ལ་ཚིགས་བཅད་དུ་བསྒྲིག་རྒྱུ་ཡོད་པ་ལ་དགོངས་པའོ། །བཟུང་བ་ནི་ཚིག་བློ་ལ་བཟུང་བ་དང༌། གླེགས་བམ་ལག་ཏུ་ཡོད་པ་ལའང་བྱར་རུང་ཞིང་ཁ་ཏོན་བྱེད་པ་དང༌། ཡང་དག་པར་འཆད་པ་ནི་ཚིག་བརྗོད་ཅིང་ལེགས་པར་འཆད་པ་དང༌། སྟོན་པ་ནི་དོན་ལེགས་པར་སྟོན་པ་ལ་བཤད་ཅིང་དེ་ནི་གཙོ་ཆེ་བའི་དབང་དུ་མཛད་པའོ། །དེ་ལྟར་བཟུང་བ་སོགས་བྱས་ན་དེ་ལས་བསོད་ནམས་ཀྱི་ཕུང་པོ་ཆེས་གྲངས་མེད་ཅིང་དཔག་ཏུ་མེད་པ་ཞིག་བསྐྱེད་དོ། ། རྒྱུ་མཚན་ནི། ཟང་ཟིང་གི་སྦྱིན་པ་བྱིན་པ་ལས་ཆོས་ཀྱི་སྦྱིན་པ་བྱིན་པ་ཕན་ཡོན་ལྷག་པར་ཆེ་ཞིང༌། དེར་མ་ཟད། ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཀྱི་བྱང་ཆུབ་ནི་གཞུང་འདིའི་བརྗོད་བྱའི་དོན་སྟོང་ཉིད་རྟོགས་པའི་ཤེར་ཕྱིན་འདི་ལས་ཐོབ་ཅིང་བྱུང་སྟེ། སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ཀྱང་འདི་ཉམས་སུ་བླངས་པ་ལས་སྐྱེས་པའི་ཕྱིར་རོ། །",
            "type": "source",
            "mapping": []
        },
        {
            "content": "ཐ་སྙད་དུ་དེ་ལྟར་ཡིན་ཀྱང་དོན་དམ་པར་ཐོབ་པར་བྱར་མེད་དེ། སངས་རྒྱས་ཀྱི་ཆོས་རྣམས་ཞེས་བྱ་བ་ནི་སངས་རྒྱས་ཀྱི་སྟོབས་བཅུ་ལ་སོགས་པ་དེ་དག་ཐ་སྙད་དུ་བཏགས་པ་ཙམ་མ་གཏོགས། དོན་དམ་པར་དེ་དག་མེད་པར་དེ་བཞིན་གཤེགས་པས་གསུངས་པ་དེའི་ཕྱིར་ཏེ།  འོན་ཀྱང་ཀུན་རྫོབ་ཙམ་དུ་སངས་རྒྱས་ཀྱི་ཆོས་རྣམས་ལ་དེ་དང་དེར་ཐ་སྙད་གདགས་སོ་ཞེས་པའོ། ། ཉན་ཐོས་འཕགས་པ་རྣམས་ཀྱིས་ཀྱང་འབྲས་བུ་གང་ཐོབ་པ་དེ་ཡང་བདག་མེད་རྟོགས་ནས་ཐོབ་པ་ཡིན་གྱི། དེ་མ་རྟོགས་པར་ཐོབ་པར་མི་ནུས་སོ་ཞེས་སྟོན་པ་ནི་རབ་འབྱོར་རྒྱུན་ཏུ་ཞུགས་པས་འདི་སྙམ་དུ་བདག་གི་རྒྱུན་ཏུ་ཞུགས་པའི་འབྲས་བུ་ཐོབ་བོ་སྙམ་དུ་བདེན་པར་ཞེན་ཅིང་སེམས་སྙམ་མམ་ཞེས་གསུངས་པ་ན།",
            "type": "source",
            "mapping": []
        },
        {
            "content": "ཐ་སྙད་དུ་དེ་ལྟར་ཡིན་ཀྱང་དོན་དམ་པར་ཐོབ་པར་བྱར་མེད་དེ། སངས་རྒྱས་ཀྱི་ཆོས་རྣམས་ཞེས་བྱ་བ་ནི་སངས་རྒྱས་ཀྱི་སྟོབས་བཅུ་ལ་སོགས་པ་དེ་དག་ཐ་སྙད་དུ་བཏགས་པ་ཙམ་མ་གཏོགས། དོན་དམ་པར་དེ་དག་མེད་པར་དེ་བཞིན་གཤེགས་པས་གསུངས་པ་དེའི་ཕྱིར་ཏེ།  འོན་ཀྱང་ཀུན་རྫོབ་ཙམ་དུ་སངས་རྒྱས་ཀྱི་ཆོས་རྣམས་ལ་དེ་དང་དེར་ཐ་སྙད་གདགས་སོ་ཞེས་པའོ། ། ཉན་ཐོས་འཕགས་པ་རྣམས་ཀྱིས་ཀྱང་འབྲས་བུ་གང་ཐོབ་པ་དེ་ཡང་བདག་མེད་རྟོགས་ནས་ཐོབ་པ་ཡིན་གྱི། དེ་མ་རྟོགས་པར་ཐོབ་པར་མི་ནུས་སོ་ཞེས་སྟོན་པ་ནི་རབ་འབྱོར་རྒྱུན་ཏུ་ཞུགས་པས་འདི་སྙམ་དུ་བདག་གི་རྒྱུན་ཏུ་ཞུགས་པའི་འབྲས་བུ་ཐོབ་བོ་སྙམ་དུ་བདེན་པར་ཞེན་ཅིང་སེམས་སྙམ་མམ་ཞེས་གསུངས་པ་ན།",
            "type": "source",
            "mapping": []
        },
        {
            "content": "ཐ་སྙད་དུ་དེ་ལྟར་ཡིན་ཀྱང་དོན་དམ་པར་ཐོབ་པར་བྱར་མེད་དེ། སངས་རྒྱས་ཀྱི་ཆོས་རྣམས་ཞེས་བྱ་བ་ནི་སངས་རྒྱས་ཀྱི་སྟོབས་བཅུ་ལ་སོགས་པ་དེ་དག་ཐ་སྙད་དུ་བཏགས་པ་ཙམ་མ་གཏོགས། དོན་དམ་པར་དེ་དག་མེད་པར་དེ་བཞིན་གཤེགས་པས་གསུངས་པ་དེའི་ཕྱིར་ཏེ།  འོན་ཀྱང་ཀུན་རྫོབ་ཙམ་དུ་སངས་རྒྱས་ཀྱི་ཆོས་རྣམས་ལ་དེ་དང་དེར་ཐ་སྙད་གདགས་སོ་ཞེས་པའོ། ། ཉན་ཐོས་འཕགས་པ་རྣམས་ཀྱིས་ཀྱང་འབྲས་བུ་གང་ཐོབ་པ་དེ་ཡང་བདག་མེད་རྟོགས་ནས་ཐོབ་པ་ཡིན་གྱི། དེ་མ་རྟོགས་པར་ཐོབ་པར་མི་ནུས་སོ་ཞེས་སྟོན་པ་ནི་རབ་འབྱོར་རྒྱུན་ཏུ་ཞུགས་པས་འདི་སྙམ་དུ་བདག་གི་རྒྱུན་ཏུ་ཞུགས་པའི་འབྲས་བུ་ཐོབ་བོ་སྙམ་དུ་བདེན་པར་ཞེན་ཅིང་སེམས་སྙམ་མམ་ཞེས་གསུངས་པ་ན།",
            "type": "source",
            "mapping": []
        },
        {
            "content": "ཐ་སྙད་དུ་དེ་ལྟར་ཡིན་ཀྱང་དོན་དམ་པར་ཐོབ་པར་བྱར་མེད་དེ། སངས་རྒྱས་ཀྱི་ཆོས་རྣམས་ཞེས་བྱ་བ་ནི་སངས་རྒྱས་ཀྱི་སྟོབས་བཅུ་ལ་སོགས་པ་དེ་དག་ཐ་སྙད་དུ་བཏགས་པ་ཙམ་མ་གཏོགས། དོན་དམ་པར་དེ་དག་མེད་པར་དེ་བཞིན་གཤེགས་པས་གསུངས་པ་དེའི་ཕྱིར་ཏེ།  འོན་ཀྱང་ཀུན་རྫོབ་ཙམ་དུ་སངས་རྒྱས་ཀྱི་ཆོས་རྣམས་ལ་དེ་དང་དེར་ཐ་སྙད་གདགས་སོ་ཞེས་པའོ། ། ཉན་ཐོས་འཕགས་པ་རྣམས་ཀྱིས་ཀྱང་འབྲས་བུ་གང་ཐོབ་པ་དེ་ཡང་བདག་མེད་རྟོགས་ནས་ཐོབ་པ་ཡིན་གྱི། དེ་མ་རྟོགས་པར་ཐོབ་པར་མི་ནུས་སོ་ཞེས་སྟོན་པ་ནི་རབ་འབྱོར་རྒྱུན་ཏུ་ཞུགས་པས་འདི་སྙམ་དུ་བདག་གི་རྒྱུན་ཏུ་ཞུགས་པའི་འབྲས་བུ་ཐོབ་བོ་སྙམ་དུ་བདེན་པར་ཞེན་ཅིང་སེམས་སྙམ་མམ་ཞེས་གསུངས་པ་ན།",
            "type": "source",
            "mapping": []
        },
        {
            "content": "རབ་འབྱོར་གྱིས་དེ་ནི་མ་ལགས་སོ། །རྒྱུ་མཚན་ལ་རྒྱུན་ཏུ་ཞུགས་པ་དེ་ནི་དོན་དམ་པར་འཇུག་བྱ་གང་ལ་ཡང་ཞུགས་པ་མ་མཆིས་ཀྱང༌། ཐ་སྙད་དུ་ཐར་པའི་ལམ་རྒྱུན་ལ་ཞུགས་པས་ན་རྒྱུན་ཏུ་ཞུགས་པ་ཞེས་བགྱིའོ། ། དོན་དམ་པར་གང་ལ་ཡང་མ་ཞུགས་ཤིང་གཟུགས་དང་སྒྲ་དང་དྲི་དང་རོ་དང་རེག་བྱ་དང་ཆོས་རྣམས་ལ་ཡང་དོན་དམ་པར་བཟུང་ནས་ཞུགས་པ་མ་ལགས་སོ། །  རྗེས་འཇུག་པའི་ཊཱིཀ་ཆེན་དུ་སྐབས་འདི་དྲངས་ཏེ། རྒྱུན་ཞུགས་ཀྱིས་ཐོབ་མཁན་དང་ཐོབ་བྱའི་འབྲས་བུ་བདེན་བར་བཟུང་ནས། བདག་གིས་རྒྱུན་ཞུགས་ཐོབ་བོ་སྙམ་དུ་སེམས་ན། དེ་ཉིད་དེ་ཡི་བདག་ཏུ་འཛིན་པར་འགྱུར་རོ་ཞེས་པས་གང་ཟག་དང་འབྲས་བུ་བདེན་འཛིན་བདག་འཛིན་དུ་གསུངས་པའི་དང་པོ་ནི།",
            "type": "source",
            "mapping": []
        },
        {
            "content": "རབ་འབྱོར་གྱིས་དེ་ནི་མ་ལགས་སོ། །རྒྱུ་མཚན་ལ་རྒྱུན་ཏུ་ཞུགས་པ་དེ་ནི་དོན་དམ་པར་འཇུག་བྱ་གང་ལ་ཡང་ཞུགས་པ་མ་མཆིས་ཀྱང༌། ཐ་སྙད་དུ་ཐར་པའི་ལམ་རྒྱུན་ལ་ཞུགས་པས་ན་རྒྱུན་ཏུ་ཞུགས་པ་ཞེས་བགྱིའོ། ། དོན་དམ་པར་གང་ལ་ཡང་མ་ཞུགས་ཤིང་གཟུགས་དང་སྒྲ་དང་དྲི་དང་རོ་དང་རེག་བྱ་དང་ཆོས་རྣམས་ལ་ཡང་དོན་དམ་པར་བཟུང་ནས་ཞུགས་པ་མ་ལགས་སོ། །  རྗེས་འཇུག་པའི་ཊཱིཀ་ཆེན་དུ་སྐབས་འདི་དྲངས་ཏེ། རྒྱུན་ཞུགས་ཀྱིས་ཐོབ་མཁན་དང་ཐོབ་བྱའི་འབྲས་བུ་བདེན་བར་བཟུང་ནས། བདག་གིས་རྒྱུན་ཞུགས་ཐོབ་བོ་སྙམ་དུ་སེམས་ན། དེ་ཉིད་དེ་ཡི་བདག་ཏུ་འཛིན་པར་འགྱུར་རོ་ཞེས་པས་གང་ཟག་དང་འབྲས་བུ་བདེན་འཛིན་བདག་འཛིན་དུ་གསུངས་པའི་དང་པོ་ནི།",
            "type": "source",
            "mapping": []
        },
        {
            "content": "རབ་འབྱོར་གྱིས་དེ་ནི་མ་ལགས་སོ། །རྒྱུ་མཚན་ལ་རྒྱུན་ཏུ་ཞུགས་པ་དེ་ནི་དོན་དམ་པར་འཇུག་བྱ་གང་ལ་ཡང་ཞུགས་པ་མ་མཆིས་ཀྱང༌། ཐ་སྙད་དུ་ཐར་པའི་ལམ་རྒྱུན་ལ་ཞུགས་པས་ན་རྒྱུན་ཏུ་ཞུགས་པ་ཞེས་བགྱིའོ། ། དོན་དམ་པར་གང་ལ་ཡང་མ་ཞུགས་ཤིང་གཟུགས་དང་སྒྲ་དང་དྲི་དང་རོ་དང་རེག་བྱ་དང་ཆོས་རྣམས་ལ་ཡང་དོན་དམ་པར་བཟུང་ནས་ཞུགས་པ་མ་ལགས་སོ། །  རྗེས་འཇུག་པའི་ཊཱིཀ་ཆེན་དུ་སྐབས་འདི་དྲངས་ཏེ། རྒྱུན་ཞུགས་ཀྱིས་ཐོབ་མཁན་དང་ཐོབ་བྱའི་འབྲས་བུ་བདེན་བར་བཟུང་ནས། བདག་གིས་རྒྱུན་ཞུགས་ཐོབ་བོ་སྙམ་དུ་སེམས་ན། དེ་ཉིད་དེ་ཡི་བདག་ཏུ་འཛིན་པར་འགྱུར་རོ་ཞེས་པས་གང་ཟག་དང་འབྲས་བུ་བདེན་འཛིན་བདག་འཛིན་དུ་གསུངས་པའི་དང་པོ་ནི།",
            "type": "source",
            "mapping": []
        },
        {
            "content": "རབ་འབྱོར་གྱིས་དེ་ནི་མ་ལགས་སོ། །རྒྱུ་མཚན་ལ་རྒྱུན་ཏུ་ཞུགས་པ་དེ་ནི་དོན་དམ་པར་འཇུག་བྱ་གང་ལ་ཡང་ཞུགས་པ་མ་མཆིས་ཀྱང༌། ཐ་སྙད་དུ་ཐར་པའི་ལམ་རྒྱུན་ལ་ཞུགས་པས་ན་རྒྱུན་ཏུ་ཞུགས་པ་ཞེས་བགྱིའོ། ། དོན་དམ་པར་གང་ལ་ཡང་མ་ཞུགས་ཤིང་གཟུགས་དང་སྒྲ་དང་དྲི་དང་རོ་དང་རེག་བྱ་དང་ཆོས་རྣམས་ལ་ཡང་དོན་དམ་པར་བཟུང་ནས་ཞུགས་པ་མ་ལགས་སོ། །  རྗེས་འཇུག་པའི་ཊཱིཀ་ཆེན་དུ་སྐབས་འདི་དྲངས་ཏེ། རྒྱུན་ཞུགས་ཀྱིས་ཐོབ་མཁན་དང་ཐོབ་བྱའི་འབྲས་བུ་བདེན་བར་བཟུང་ནས། བདག་གིས་རྒྱུན་ཞུགས་ཐོབ་བོ་སྙམ་དུ་སེམས་ན། དེ་ཉིད་དེ་ཡི་བདག་ཏུ་འཛིན་པར་འགྱུར་རོ་ཞེས་པས་གང་ཟག་དང་འབྲས་བུ་བདེན་འཛིན་བདག་འཛིན་དུ་གསུངས་པའི་དང་པོ་ནི།",
            "type": "source",
            "mapping": []
        },
        {
            "content": "རབ་འབྱོར་གྱིས་དེ་ནི་མ་ལགས་སོ། །རྒྱུ་མཚན་ལ་རྒྱུན་ཏུ་ཞུགས་པ་དེ་ནི་དོན་དམ་པར་འཇུག་བྱ་གང་ལ་ཡང་ཞུགས་པ་མ་མཆིས་ཀྱང༌། ཐ་སྙད་དུ་ཐར་པའི་ལམ་རྒྱུན་ལ་ཞུགས་པས་ན་རྒྱུན་ཏུ་ཞུགས་པ་ཞེས་བགྱིའོ། ། དོན་དམ་པར་གང་ལ་ཡང་མ་ཞུགས་ཤིང་གཟུགས་དང་སྒྲ་དང་དྲི་དང་རོ་དང་རེག་བྱ་དང་ཆོས་རྣམས་ལ་ཡང་དོན་དམ་པར་བཟུང་ནས་ཞུགས་པ་མ་ལགས་སོ། །  རྗེས་འཇུག་པའི་ཊཱིཀ་ཆེན་དུ་སྐབས་འདི་དྲངས་ཏེ། རྒྱུན་ཞུགས་ཀྱིས་ཐོབ་མཁན་དང་ཐོབ་བྱའི་འབྲས་བུ་བདེན་བར་བཟུང་ནས། བདག་གིས་རྒྱུན་ཞུགས་ཐོབ་བོ་སྙམ་དུ་སེམས་ན། དེ་ཉིད་དེ་ཡི་བདག་ཏུ་འཛིན་པར་འགྱུར་རོ་ཞེས་པས་གང་ཟག་དང་འབྲས་བུ་བདེན་འཛིན་བདག་འཛིན་དུ་གསུངས་པའི་དང་པོ་ནི།",
            "type": "source",
            "mapping": []
        },
        {
            "content": "གང་ཟག་གི་བདག་འཛིན་དང༌། གཉིས་པ་ནི་ཆོས་ཀྱི་བདག་འཛིན་ནོ།། རྒྱུན་ཞུགས་ཀྱིས་བདེན་པར་བཟུང་ནས་བདག་གིས་འབྲས་བུ་ཐོབ་བོ་སྙམ་དུ་མི་འཛིན་པ་ནི། བདེན་འཛིན་གྱི་ཡུལ་སུན་ཕྱུང་བའི་དབང་དུ་མཛད་པ་ཡིན་གྱི། ལྷན་སྐྱེས་ཀྱི་འཛིན་པ་ཡང་མེད་པར་བསྟན་པ་ཡིན་ནོ། །དེས་ནི་ཕྱི་མ་རྣམས་ཀྱང་ཤེས་པར་བྱའོ་ཞེས་གསུངས་པ་ལྟར་རོ། ། དོན་ནི་རྒྱུན་ཞུགས་སོགས་བཞིའི་བྲལ་བའི་འབྲས་བུ་འགོག་བདེན་ཐོབ་པ་ལ་སྟོང་ཉིད་ངེས་པར་རྟོགས་དགོས་པར་བསྟན་ཅིང༌། དེ་ལ་བདེན་མེད་རྟོགས་ནས་བདེན་འཛིན་གྱི་ཞེན་ཡུལ་སུན་འབྱིན་དགོས་པར་བཤད་པའོ། ། དེས་ན་བདེན་འཛིན་གྱི་ཞེན་ཡུལ་སུན་འབྱིན་མྱོང་མ་མྱོང་ནི་བདེན་མེད་རྟོགས་མྱོང་མ་མྱོང་བའི་སྒོ་ནས་འཇོག་སྟེ། ཇི་སྲིད་གཞི་གང་ལ་བདེན་པར་གྲུབ་བམ་མ་གྲུབ་སྙམ་དུ་དཔྱོད་པ་ཞུགས་པ་ན་བདེན་ཞེན་ལས་འདའ་མི་ནུས་པའི་བར་དེ་སྲིད་དུ་བདེན་འཛིན་གྱི་ཞེན་ཡུལ་སུན་འབྱིན་མི་ནུས་པས་བདེན་འཛིན་གྱིས་བཅིངས་པར་འཇོག་གོ །",
            "type": "source",
            "mapping": []
        },
        {
            "content": "གང་ཟག་གི་བདག་འཛིན་དང༌། གཉིས་པ་ནི་ཆོས་ཀྱི་བདག་འཛིན་ནོ།། རྒྱུན་ཞུགས་ཀྱིས་བདེན་པར་བཟུང་ནས་བདག་གིས་འབྲས་བུ་ཐོབ་བོ་སྙམ་དུ་མི་འཛིན་པ་ནི། བདེན་འཛིན་གྱི་ཡུལ་སུན་ཕྱུང་བའི་དབང་དུ་མཛད་པ་ཡིན་གྱི། ལྷན་སྐྱེས་ཀྱི་འཛིན་པ་ཡང་མེད་པར་བསྟན་པ་ཡིན་ནོ། །དེས་ནི་ཕྱི་མ་རྣམས་ཀྱང་ཤེས་པར་བྱའོ་ཞེས་གསུངས་པ་ལྟར་རོ། ། དོན་ནི་རྒྱུན་ཞུགས་སོགས་བཞིའི་བྲལ་བའི་འབྲས་བུ་འགོག་བདེན་ཐོབ་པ་ལ་སྟོང་ཉིད་ངེས་པར་རྟོགས་དགོས་པར་བསྟན་ཅིང༌། དེ་ལ་བདེན་མེད་རྟོགས་ནས་བདེན་འཛིན་གྱི་ཞེན་ཡུལ་སུན་འབྱིན་དགོས་པར་བཤད་པའོ། ། དེས་ན་བདེན་འཛིན་གྱི་ཞེན་ཡུལ་སུན་འབྱིན་མྱོང་མ་མྱོང་ནི་བདེན་མེད་རྟོགས་མྱོང་མ་མྱོང་བའི་སྒོ་ནས་འཇོག་སྟེ། ཇི་སྲིད་གཞི་གང་ལ་བདེན་པར་གྲུབ་བམ་མ་གྲུབ་སྙམ་དུ་དཔྱོད་པ་ཞུགས་པ་ན་བདེན་ཞེན་ལས་འདའ་མི་ནུས་པའི་བར་དེ་སྲིད་དུ་བདེན་འཛིན་གྱི་ཞེན་ཡུལ་སུན་འབྱིན་མི་ནུས་པས་བདེན་འཛིན་གྱིས་བཅིངས་པར་འཇོག་གོ །",
            "type": "source",
            "mapping": []
        },
        {
            "content": "གང་ཟག་གི་བདག་འཛིན་དང༌། གཉིས་པ་ནི་ཆོས་ཀྱི་བདག་འཛིན་ནོ།། རྒྱུན་ཞུགས་ཀྱིས་བདེན་པར་བཟུང་ནས་བདག་གིས་འབྲས་བུ་ཐོབ་བོ་སྙམ་དུ་མི་འཛིན་པ་ནི། བདེན་འཛིན་གྱི་ཡུལ་སུན་ཕྱུང་བའི་དབང་དུ་མཛད་པ་ཡིན་གྱི། ལྷན་སྐྱེས་ཀྱི་འཛིན་པ་ཡང་མེད་པར་བསྟན་པ་ཡིན་ནོ། །དེས་ནི་ཕྱི་མ་རྣམས་ཀྱང་ཤེས་པར་བྱའོ་ཞེས་གསུངས་པ་ལྟར་རོ། ། དོན་ནི་རྒྱུན་ཞུགས་སོགས་བཞིའི་བྲལ་བའི་འབྲས་བུ་འགོག་བདེན་ཐོབ་པ་ལ་སྟོང་ཉིད་ངེས་པར་རྟོགས་དགོས་པར་བསྟན་ཅིང༌། དེ་ལ་བདེན་མེད་རྟོགས་ནས་བདེན་འཛིན་གྱི་ཞེན་ཡུལ་སུན་འབྱིན་དགོས་པར་བཤད་པའོ། ། དེས་ན་བདེན་འཛིན་གྱི་ཞེན་ཡུལ་སུན་འབྱིན་མྱོང་མ་མྱོང་ནི་བདེན་མེད་རྟོགས་མྱོང་མ་མྱོང་བའི་སྒོ་ནས་འཇོག་སྟེ། ཇི་སྲིད་གཞི་གང་ལ་བདེན་པར་གྲུབ་བམ་མ་གྲུབ་སྙམ་དུ་དཔྱོད་པ་ཞུགས་པ་ན་བདེན་ཞེན་ལས་འདའ་མི་ནུས་པའི་བར་དེ་སྲིད་དུ་བདེན་འཛིན་གྱི་ཞེན་ཡུལ་སུན་འབྱིན་མི་ནུས་པས་བདེན་འཛིན་གྱིས་བཅིངས་པར་འཇོག་གོ །",
            "type": "source",
            "mapping": []
        },
        {
            "content": "དེ་བཞིན་དུ་ལན་ཅིག་ཕྱིར་འོང་བ་དང་ཕྱིར་མི་འོངས་པ་དང་དགྲ་བཅོམ་པ་གསུམ་ལ་སྦྱར་ནས་གསུངས་པ་ལྟར་ཏེ་དོན་ནི་སྔར་ལྟར་རོ། །རྒྱུན་ཞུགས་སོགས་བཞི་ལ་ཞུགས་པ་དང་འབྲས་གནས་ཟུང་རེ་ཡོད་པས་སོ་སོར་ཕྱེ་ན་གང་ཟག་ཡ་བརྒྱད་དང༌། ཟུང་རེ་བསྡོམས་ན་སྐྱེས་བུ་ཟུང་བཞིར་འགྱུར་རོ། ། འདིའི་བཞི་ལ་བཤད་པ་མང་དུ་ཡོད་ཀྱང་མཚོན་ཙམ་ནི་རྒྱུན་ཞུགས་དགེ་སྦྱོང་ཚུལ་གྱི་འབྲས་བུ་འགོག་བདེན་ནི་མཐོང་སྤངས་ཀུན་སྦྱོར་གསུམ་སྤངས་པའི་སྒོ་ནས་བཞག་པས། དེ་ལྟ་བུའི་འབྲས་བུ་དེ་ཐོབ་ནས་དེ་ལ་གནས་པ་ལ་ནི་རྒྱུན་ཞུགས་འབྲས་གནས་དང༌། དེ་ཐོབ་ཕྱིར་དུ་འབད་ཅིང་ཞུགས་པ་ལ་དེའི་ཞུགས་པ་ཞེས་བྱ་ཞིང༌།ཀུན་སྦྱོར་གསུམ་ནི། འཇིག་ལྟ་དང་ཚུལ་ཞུགས་མཆོག་འཛིན་དང་ཐེ་ཚོམ་ཉོན་མོངས་ཅན་ནོ། ། འཇིག་ལྟ་ལ་ལྷན་སྐྱེས་ཡོད་ཀྱང་འདིར་ཀུན་བཏགས་སོ། །ཕྱིར་འོང་གི་འབྲས་བུ་ནི་འདོད་ཉོན་དྲུག་པ་སྤངས་པའི་ཆ་ནས་འཇོག་ཅིང༌། །དེ་ལ་གནས་པ་ནི་དེའི་འབྲས་གནས་དང༌། དེ་ཐོབ་ཕྱིར་དུ་བརྩོན་པས་འཇུག་པ་ནི་དེའི་ཞུགས་པའོ། །ཕྱི་མི་འོངས་ཀྱི་འབྲས་བུ་ནི་འདོད་ཉོན་དགུ་པ་སྤངས་པའི་ཆ་ནས་འཇོག་ཅིང༌། དེ་ལ་གནས་པ་དང་དེའི་ཆེད་དུ་ཞུགས་པ་ནི་འབྲས་གནས་དང་ཞུགས་པའོ། །",
            "type": "source",
            "mapping": []
        },
        {
            "content": "དེ་བཞིན་དུ་ལན་ཅིག་ཕྱིར་འོང་བ་དང་ཕྱིར་མི་འོངས་པ་དང་དགྲ་བཅོམ་པ་གསུམ་ལ་སྦྱར་ནས་གསུངས་པ་ལྟར་ཏེ་དོན་ནི་སྔར་ལྟར་རོ། །རྒྱུན་ཞུགས་སོགས་བཞི་ལ་ཞུགས་པ་དང་འབྲས་གནས་ཟུང་རེ་ཡོད་པས་སོ་སོར་ཕྱེ་ན་གང་ཟག་ཡ་བརྒྱད་དང༌། ཟུང་རེ་བསྡོམས་ན་སྐྱེས་བུ་ཟུང་བཞིར་འགྱུར་རོ། ། འདིའི་བཞི་ལ་བཤད་པ་མང་དུ་ཡོད་ཀྱང་མཚོན་ཙམ་ནི་རྒྱུན་ཞུགས་དགེ་སྦྱོང་ཚུལ་གྱི་འབྲས་བུ་འགོག་བདེན་ནི་མཐོང་སྤངས་ཀུན་སྦྱོར་གསུམ་སྤངས་པའི་སྒོ་ནས་བཞག་པས། དེ་ལྟ་བུའི་འབྲས་བུ་དེ་ཐོབ་ནས་དེ་ལ་གནས་པ་ལ་ནི་རྒྱུན་ཞུགས་འབྲས་གནས་དང༌། དེ་ཐོབ་ཕྱིར་དུ་འབད་ཅིང་ཞུགས་པ་ལ་དེའི་ཞུགས་པ་ཞེས་བྱ་ཞིང༌།ཀུན་སྦྱོར་གསུམ་ནི། འཇིག་ལྟ་དང་ཚུལ་ཞུགས་མཆོག་འཛིན་དང་ཐེ་ཚོམ་ཉོན་མོངས་ཅན་ནོ། ། འཇིག་ལྟ་ལ་ལྷན་སྐྱེས་ཡོད་ཀྱང་འདིར་ཀུན་བཏགས་སོ། །ཕྱིར་འོང་གི་འབྲས་བུ་ནི་འདོད་ཉོན་དྲུག་པ་སྤངས་པའི་ཆ་ནས་འཇོག་ཅིང༌། །དེ་ལ་གནས་པ་ནི་དེའི་འབྲས་གནས་དང༌། དེ་ཐོབ་ཕྱིར་དུ་བརྩོན་པས་འཇུག་པ་ནི་དེའི་ཞུགས་པའོ། །ཕྱི་མི་འོངས་ཀྱི་འབྲས་བུ་ནི་འདོད་ཉོན་དགུ་པ་སྤངས་པའི་ཆ་ནས་འཇོག་ཅིང༌། དེ་ལ་གནས་པ་དང་དེའི་ཆེད་དུ་ཞུགས་པ་ནི་འབྲས་གནས་དང་ཞུགས་པའོ། །",
            "type": "source",
            "mapping": []
        },
        {
            "content": "དེ་བཞིན་དུ་ལན་ཅིག་ཕྱིར་འོང་བ་དང་ཕྱིར་མི་འོངས་པ་དང་དགྲ་བཅོམ་པ་གསུམ་ལ་སྦྱར་ནས་གསུངས་པ་ལྟར་ཏེ་དོན་ནི་སྔར་ལྟར་རོ། །རྒྱུན་ཞུགས་སོགས་བཞི་ལ་ཞུགས་པ་དང་འབྲས་གནས་ཟུང་རེ་ཡོད་པས་སོ་སོར་ཕྱེ་ན་གང་ཟག་ཡ་བརྒྱད་དང༌། ཟུང་རེ་བསྡོམས་ན་སྐྱེས་བུ་ཟུང་བཞིར་འགྱུར་རོ། ། འདིའི་བཞི་ལ་བཤད་པ་མང་དུ་ཡོད་ཀྱང་མཚོན་ཙམ་ནི་རྒྱུན་ཞུགས་དགེ་སྦྱོང་ཚུལ་གྱི་འབྲས་བུ་འགོག་བདེན་ནི་མཐོང་སྤངས་ཀུན་སྦྱོར་གསུམ་སྤངས་པའི་སྒོ་ནས་བཞག་པས། དེ་ལྟ་བུའི་འབྲས་བུ་དེ་ཐོབ་ནས་དེ་ལ་གནས་པ་ལ་ནི་རྒྱུན་ཞུགས་འབྲས་གནས་དང༌། དེ་ཐོབ་ཕྱིར་དུ་འབད་ཅིང་ཞུགས་པ་ལ་དེའི་ཞུགས་པ་ཞེས་བྱ་ཞིང༌།ཀུན་སྦྱོར་གསུམ་ནི། འཇིག་ལྟ་དང་ཚུལ་ཞུགས་མཆོག་འཛིན་དང་ཐེ་ཚོམ་ཉོན་མོངས་ཅན་ནོ། ། འཇིག་ལྟ་ལ་ལྷན་སྐྱེས་ཡོད་ཀྱང་འདིར་ཀུན་བཏགས་སོ། །ཕྱིར་འོང་གི་འབྲས་བུ་ནི་འདོད་ཉོན་དྲུག་པ་སྤངས་པའི་ཆ་ནས་འཇོག་ཅིང༌། །དེ་ལ་གནས་པ་ནི་དེའི་འབྲས་གནས་དང༌། དེ་ཐོབ་ཕྱིར་དུ་བརྩོན་པས་འཇུག་པ་ནི་དེའི་ཞུགས་པའོ། །ཕྱི་མི་འོངས་ཀྱི་འབྲས་བུ་ནི་འདོད་ཉོན་དགུ་པ་སྤངས་པའི་ཆ་ནས་འཇོག་ཅིང༌། དེ་ལ་གནས་པ་དང་དེའི་ཆེད་དུ་ཞུགས་པ་ནི་འབྲས་གནས་དང་ཞུགས་པའོ། །",
            "type": "source",
            "mapping": []
        },
        {
            "content": "དེ་བཞིན་དུ་ལན་ཅིག་ཕྱིར་འོང་བ་དང་ཕྱིར་མི་འོངས་པ་དང་དགྲ་བཅོམ་པ་གསུམ་ལ་སྦྱར་ནས་གསུངས་པ་ལྟར་ཏེ་དོན་ནི་སྔར་ལྟར་རོ། །རྒྱུན་ཞུགས་སོགས་བཞི་ལ་ཞུགས་པ་དང་འབྲས་གནས་ཟུང་རེ་ཡོད་པས་སོ་སོར་ཕྱེ་ན་གང་ཟག་ཡ་བརྒྱད་དང༌། ཟུང་རེ་བསྡོམས་ན་སྐྱེས་བུ་ཟུང་བཞིར་འགྱུར་རོ། ། འདིའི་བཞི་ལ་བཤད་པ་མང་དུ་ཡོད་ཀྱང་མཚོན་ཙམ་ནི་རྒྱུན་ཞུགས་དགེ་སྦྱོང་ཚུལ་གྱི་འབྲས་བུ་འགོག་བདེན་ནི་མཐོང་སྤངས་ཀུན་སྦྱོར་གསུམ་སྤངས་པའི་སྒོ་ནས་བཞག་པས། དེ་ལྟ་བུའི་འབྲས་བུ་དེ་ཐོབ་ནས་དེ་ལ་གནས་པ་ལ་ནི་རྒྱུན་ཞུགས་འབྲས་གནས་དང༌། དེ་ཐོབ་ཕྱིར་དུ་འབད་ཅིང་ཞུགས་པ་ལ་དེའི་ཞུགས་པ་ཞེས་བྱ་ཞིང༌།ཀུན་སྦྱོར་གསུམ་ནི། འཇིག་ལྟ་དང་ཚུལ་ཞུགས་མཆོག་འཛིན་དང་ཐེ་ཚོམ་ཉོན་མོངས་ཅན་ནོ། ། འཇིག་ལྟ་ལ་ལྷན་སྐྱེས་ཡོད་ཀྱང་འདིར་ཀུན་བཏགས་སོ། །ཕྱིར་འོང་གི་འབྲས་བུ་ནི་འདོད་ཉོན་དྲུག་པ་སྤངས་པའི་ཆ་ནས་འཇོག་ཅིང༌། །དེ་ལ་གནས་པ་ནི་དེའི་འབྲས་གནས་དང༌། དེ་ཐོབ་ཕྱིར་དུ་བརྩོན་པས་འཇུག་པ་ནི་དེའི་ཞུགས་པའོ། །ཕྱི་མི་འོངས་ཀྱི་འབྲས་བུ་ནི་འདོད་ཉོན་དགུ་པ་སྤངས་པའི་ཆ་ནས་འཇོག་ཅིང༌། དེ་ལ་གནས་པ་དང་དེའི་ཆེད་དུ་ཞུགས་པ་ནི་འབྲས་གནས་དང་ཞུགས་པའོ། །",
            "type": "source",
            "mapping": []
        },
        {
            "content": "དེ་བཞིན་དུ་ལན་ཅིག་ཕྱིར་འོང་བ་དང་ཕྱིར་མི་འོངས་པ་དང་དགྲ་བཅོམ་པ་གསུམ་ལ་སྦྱར་ནས་གསུངས་པ་ལྟར་ཏེ་དོན་ནི་སྔར་ལྟར་རོ། །རྒྱུན་ཞུགས་སོགས་བཞི་ལ་ཞུགས་པ་དང་འབྲས་གནས་ཟུང་རེ་ཡོད་པས་སོ་སོར་ཕྱེ་ན་གང་ཟག་ཡ་བརྒྱད་དང༌། ཟུང་རེ་བསྡོམས་ན་སྐྱེས་བུ་ཟུང་བཞིར་འགྱུར་རོ། ། འདིའི་བཞི་ལ་བཤད་པ་མང་དུ་ཡོད་ཀྱང་མཚོན་ཙམ་ནི་རྒྱུན་ཞུགས་དགེ་སྦྱོང་ཚུལ་གྱི་འབྲས་བུ་འགོག་བདེན་ནི་མཐོང་སྤངས་ཀུན་སྦྱོར་གསུམ་སྤངས་པའི་སྒོ་ནས་བཞག་པས། དེ་ལྟ་བུའི་འབྲས་བུ་དེ་ཐོབ་ནས་དེ་ལ་གནས་པ་ལ་ནི་རྒྱུན་ཞུགས་འབྲས་གནས་དང༌། དེ་ཐོབ་ཕྱིར་དུ་འབད་ཅིང་ཞུགས་པ་ལ་དེའི་ཞུགས་པ་ཞེས་བྱ་ཞིང༌།ཀུན་སྦྱོར་གསུམ་ནི། འཇིག་ལྟ་དང་ཚུལ་ཞུགས་མཆོག་འཛིན་དང་ཐེ་ཚོམ་ཉོན་མོངས་ཅན་ནོ། ། འཇིག་ལྟ་ལ་ལྷན་སྐྱེས་ཡོད་ཀྱང་འདིར་ཀུན་བཏགས་སོ། །ཕྱིར་འོང་གི་འབྲས་བུ་ནི་འདོད་ཉོན་དྲུག་པ་སྤངས་པའི་ཆ་ནས་འཇོག་ཅིང༌། །དེ་ལ་གནས་པ་ནི་དེའི་འབྲས་གནས་དང༌། དེ་ཐོབ་ཕྱིར་དུ་བརྩོན་པས་འཇུག་པ་ནི་དེའི་ཞུགས་པའོ། །ཕྱི་མི་འོངས་ཀྱི་འབྲས་བུ་ནི་འདོད་ཉོན་དགུ་པ་སྤངས་པའི་ཆ་ནས་འཇོག་ཅིང༌། དེ་ལ་གནས་པ་དང་དེའི་ཆེད་དུ་ཞུགས་པ་ནི་འབྲས་གནས་དང་ཞུགས་པའོ། །",
            "type": "source",
            "mapping": []
        },
        {
            "content": "དེ་བཞིན་དུ་ལན་ཅིག་ཕྱིར་འོང་བ་དང་ཕྱིར་མི་འོངས་པ་དང་དགྲ་བཅོམ་པ་གསུམ་ལ་སྦྱར་ནས་གསུངས་པ་ལྟར་ཏེ་དོན་ནི་སྔར་ལྟར་རོ། །རྒྱུན་ཞུགས་སོགས་བཞི་ལ་ཞུགས་པ་དང་འབྲས་གནས་ཟུང་རེ་ཡོད་པས་སོ་སོར་ཕྱེ་ན་གང་ཟག་ཡ་བརྒྱད་དང༌། ཟུང་རེ་བསྡོམས་ན་སྐྱེས་བུ་ཟུང་བཞིར་འགྱུར་རོ། ། འདིའི་བཞི་ལ་བཤད་པ་མང་དུ་ཡོད་ཀྱང་མཚོན་ཙམ་ནི་རྒྱུན་ཞུགས་དགེ་སྦྱོང་ཚུལ་གྱི་འབྲས་བུ་འགོག་བདེན་ནི་མཐོང་སྤངས་ཀུན་སྦྱོར་གསུམ་སྤངས་པའི་སྒོ་ནས་བཞག་པས། དེ་ལྟ་བུའི་འབྲས་བུ་དེ་ཐོབ་ནས་དེ་ལ་གནས་པ་ལ་ནི་རྒྱུན་ཞུགས་འབྲས་གནས་དང༌། དེ་ཐོབ་ཕྱིར་དུ་འབད་ཅིང་ཞུགས་པ་ལ་དེའི་ཞུགས་པ་ཞེས་བྱ་ཞིང༌།ཀུན་སྦྱོར་གསུམ་ནི། འཇིག་ལྟ་དང་ཚུལ་ཞུགས་མཆོག་འཛིན་དང་ཐེ་ཚོམ་ཉོན་མོངས་ཅན་ནོ། ། འཇིག་ལྟ་ལ་ལྷན་སྐྱེས་ཡོད་ཀྱང་འདིར་ཀུན་བཏགས་སོ། །ཕྱིར་འོང་གི་འབྲས་བུ་ནི་འདོད་ཉོན་དྲུག་པ་སྤངས་པའི་ཆ་ནས་འཇོག་ཅིང༌། །དེ་ལ་གནས་པ་ནི་དེའི་འབྲས་གནས་དང༌། དེ་ཐོབ་ཕྱིར་དུ་བརྩོན་པས་འཇུག་པ་ནི་དེའི་ཞུགས་པའོ། །ཕྱི་མི་འོངས་ཀྱི་འབྲས་བུ་ནི་འདོད་ཉོན་དགུ་པ་སྤངས་པའི་ཆ་ནས་འཇོག་ཅིང༌། དེ་ལ་གནས་པ་དང་དེའི་ཆེད་དུ་ཞུགས་པ་ནི་འབྲས་གནས་དང་ཞུགས་པའོ། །",
            "type": "source",
            "mapping": []
        },
        {
            "content": "དེ་བཞིན་དུ་ལན་ཅིག་ཕྱིར་འོང་བ་དང་ཕྱིར་མི་འོངས་པ་དང་དགྲ་བཅོམ་པ་གསུམ་ལ་སྦྱར་ནས་གསུངས་པ་ལྟར་ཏེ་དོན་ནི་སྔར་ལྟར་རོ། །རྒྱུན་ཞུགས་སོགས་བཞི་ལ་ཞུགས་པ་དང་འབྲས་གནས་ཟུང་རེ་ཡོད་པས་སོ་སོར་ཕྱེ་ན་གང་ཟག་ཡ་བརྒྱད་དང༌། ཟུང་རེ་བསྡོམས་ན་སྐྱེས་བུ་ཟུང་བཞིར་འགྱུར་རོ། ། འདིའི་བཞི་ལ་བཤད་པ་མང་དུ་ཡོད་ཀྱང་མཚོན་ཙམ་ནི་རྒྱུན་ཞུགས་དགེ་སྦྱོང་ཚུལ་གྱི་འབྲས་བུ་འགོག་བདེན་ནི་མཐོང་སྤངས་ཀུན་སྦྱོར་གསུམ་སྤངས་པའི་སྒོ་ནས་བཞག་པས། དེ་ལྟ་བུའི་འབྲས་བུ་དེ་ཐོབ་ནས་དེ་ལ་གནས་པ་ལ་ནི་རྒྱུན་ཞུགས་འབྲས་གནས་དང༌། དེ་ཐོབ་ཕྱིར་དུ་འབད་ཅིང་ཞུགས་པ་ལ་དེའི་ཞུགས་པ་ཞེས་བྱ་ཞིང༌།ཀུན་སྦྱོར་གསུམ་ནི། འཇིག་ལྟ་དང་ཚུལ་ཞུགས་མཆོག་འཛིན་དང་ཐེ་ཚོམ་ཉོན་མོངས་ཅན་ནོ། ། འཇིག་ལྟ་ལ་ལྷན་སྐྱེས་ཡོད་ཀྱང་འདིར་ཀུན་བཏགས་སོ། །ཕྱིར་འོང་གི་འབྲས་བུ་ནི་འདོད་ཉོན་དྲུག་པ་སྤངས་པའི་ཆ་ནས་འཇོག་ཅིང༌། །དེ་ལ་གནས་པ་ནི་དེའི་འབྲས་གནས་དང༌། དེ་ཐོབ་ཕྱིར་དུ་བརྩོན་པས་འཇུག་པ་ནི་དེའི་ཞུགས་པའོ། །ཕྱི་མི་འོངས་ཀྱི་འབྲས་བུ་ནི་འདོད་ཉོན་དགུ་པ་སྤངས་པའི་ཆ་ནས་འཇོག་ཅིང༌། དེ་ལ་གནས་པ་དང་དེའི་ཆེད་དུ་ཞུགས་པ་ནི་འབྲས་གནས་དང་ཞུགས་པའོ། །",
            "type": "source",
            "mapping": []
        },
        {
            "content": "དེ་བཞིན་དུ་ལན་ཅིག་ཕྱིར་འོང་བ་དང་ཕྱིར་མི་འོངས་པ་དང་དགྲ་བཅོམ་པ་གསུམ་ལ་སྦྱར་ནས་གསུངས་པ་ལྟར་ཏེ་དོན་ནི་སྔར་ལྟར་རོ། །རྒྱུན་ཞུགས་སོགས་བཞི་ལ་ཞུགས་པ་དང་འབྲས་གནས་ཟུང་རེ་ཡོད་པས་སོ་སོར་ཕྱེ་ན་གང་ཟག་ཡ་བརྒྱད་དང༌། ཟུང་རེ་བསྡོམས་ན་སྐྱེས་བུ་ཟུང་བཞིར་འགྱུར་རོ། ། འདིའི་བཞི་ལ་བཤད་པ་མང་དུ་ཡོད་ཀྱང་མཚོན་ཙམ་ནི་རྒྱུན་ཞུགས་དགེ་སྦྱོང་ཚུལ་གྱི་འབྲས་བུ་འགོག་བདེན་ནི་མཐོང་སྤངས་ཀུན་སྦྱོར་གསུམ་སྤངས་པའི་སྒོ་ནས་བཞག་པས། དེ་ལྟ་བུའི་འབྲས་བུ་དེ་ཐོབ་ནས་དེ་ལ་གནས་པ་ལ་ནི་རྒྱུན་ཞུགས་འབྲས་གནས་དང༌། དེ་ཐོབ་ཕྱིར་དུ་འབད་ཅིང་ཞུགས་པ་ལ་དེའི་ཞུགས་པ་ཞེས་བྱ་ཞིང༌།ཀུན་སྦྱོར་གསུམ་ནི། འཇིག་ལྟ་དང་ཚུལ་ཞུགས་མཆོག་འཛིན་དང་ཐེ་ཚོམ་ཉོན་མོངས་ཅན་ནོ། ། འཇིག་ལྟ་ལ་ལྷན་སྐྱེས་ཡོད་ཀྱང་འདིར་ཀུན་བཏགས་སོ། །ཕྱིར་འོང་གི་འབྲས་བུ་ནི་འདོད་ཉོན་དྲུག་པ་སྤངས་པའི་ཆ་ནས་འཇོག་ཅིང༌། །དེ་ལ་གནས་པ་ནི་དེའི་འབྲས་གནས་དང༌། དེ་ཐོབ་ཕྱིར་དུ་བརྩོན་པས་འཇུག་པ་ནི་དེའི་ཞུགས་པའོ། །ཕྱི་མི་འོངས་ཀྱི་འབྲས་བུ་ནི་འདོད་ཉོན་དགུ་པ་སྤངས་པའི་ཆ་ནས་འཇོག་ཅིང༌། དེ་ལ་གནས་པ་དང་དེའི་ཆེད་དུ་ཞུགས་པ་ནི་འབྲས་གནས་དང་ཞུགས་པའོ། །",
            "type": "source",
            "mapping": []
        },
        {
            "content": "དེ་བཞིན་དུ་ལན་ཅིག་ཕྱིར་འོང་བ་དང་ཕྱིར་མི་འོངས་པ་དང་དགྲ་བཅོམ་པ་གསུམ་ལ་སྦྱར་ནས་གསུངས་པ་ལྟར་ཏེ་དོན་ནི་སྔར་ལྟར་རོ། །རྒྱུན་ཞུགས་སོགས་བཞི་ལ་ཞུགས་པ་དང་འབྲས་གནས་ཟུང་རེ་ཡོད་པས་སོ་སོར་ཕྱེ་ན་གང་ཟག་ཡ་བརྒྱད་དང༌། ཟུང་རེ་བསྡོམས་ན་སྐྱེས་བུ་ཟུང་བཞིར་འགྱུར་རོ། ། འདིའི་བཞི་ལ་བཤད་པ་མང་དུ་ཡོད་ཀྱང་མཚོན་ཙམ་ནི་རྒྱུན་ཞུགས་དགེ་སྦྱོང་ཚུལ་གྱི་འབྲས་བུ་འགོག་བདེན་ནི་མཐོང་སྤངས་ཀུན་སྦྱོར་གསུམ་སྤངས་པའི་སྒོ་ནས་བཞག་པས། དེ་ལྟ་བུའི་འབྲས་བུ་དེ་ཐོབ་ནས་དེ་ལ་གནས་པ་ལ་ནི་རྒྱུན་ཞུགས་འབྲས་གནས་དང༌། དེ་ཐོབ་ཕྱིར་དུ་འབད་ཅིང་ཞུགས་པ་ལ་དེའི་ཞུགས་པ་ཞེས་བྱ་ཞིང༌།ཀུན་སྦྱོར་གསུམ་ནི། འཇིག་ལྟ་དང་ཚུལ་ཞུགས་མཆོག་འཛིན་དང་ཐེ་ཚོམ་ཉོན་མོངས་ཅན་ནོ། ། འཇིག་ལྟ་ལ་ལྷན་སྐྱེས་ཡོད་ཀྱང་འདིར་ཀུན་བཏགས་སོ། །ཕྱིར་འོང་གི་འབྲས་བུ་ནི་འདོད་ཉོན་དྲུག་པ་སྤངས་པའི་ཆ་ནས་འཇོག་ཅིང༌། །དེ་ལ་གནས་པ་ནི་དེའི་འབྲས་གནས་དང༌། དེ་ཐོབ་ཕྱིར་དུ་བརྩོན་པས་འཇུག་པ་ནི་དེའི་ཞུགས་པའོ། །ཕྱི་མི་འོངས་ཀྱི་འབྲས་བུ་ནི་འདོད་ཉོན་དགུ་པ་སྤངས་པའི་ཆ་ནས་འཇོག་ཅིང༌། དེ་ལ་གནས་པ་དང་དེའི་ཆེད་དུ་ཞུགས་པ་ནི་འབྲས་གནས་དང་ཞུགས་པའོ། །",
            "type": "source",
            "mapping": []
        },
        {
            "content": "དེ་བཞིན་དུ་ལན་ཅིག་ཕྱིར་འོང་བ་དང་ཕྱིར་མི་འོངས་པ་དང་དགྲ་བཅོམ་པ་གསུམ་ལ་སྦྱར་ནས་གསུངས་པ་ལྟར་ཏེ་དོན་ནི་སྔར་ལྟར་རོ། །རྒྱུན་ཞུགས་སོགས་བཞི་ལ་ཞུགས་པ་དང་འབྲས་གནས་ཟུང་རེ་ཡོད་པས་སོ་སོར་ཕྱེ་ན་གང་ཟག་ཡ་བརྒྱད་དང༌། ཟུང་རེ་བསྡོམས་ན་སྐྱེས་བུ་ཟུང་བཞིར་འགྱུར་རོ། ། འདིའི་བཞི་ལ་བཤད་པ་མང་དུ་ཡོད་ཀྱང་མཚོན་ཙམ་ནི་རྒྱུན་ཞུགས་དགེ་སྦྱོང་ཚུལ་གྱི་འབྲས་བུ་འགོག་བདེན་ནི་མཐོང་སྤངས་ཀུན་སྦྱོར་གསུམ་སྤངས་པའི་སྒོ་ནས་བཞག་པས། དེ་ལྟ་བུའི་འབྲས་བུ་དེ་ཐོབ་ནས་དེ་ལ་གནས་པ་ལ་ནི་རྒྱུན་ཞུགས་འབྲས་གནས་དང༌། དེ་ཐོབ་ཕྱིར་དུ་འབད་ཅིང་ཞུགས་པ་ལ་དེའི་ཞུགས་པ་ཞེས་བྱ་ཞིང༌།ཀུན་སྦྱོར་གསུམ་ནི། འཇིག་ལྟ་དང་ཚུལ་ཞུགས་མཆོག་འཛིན་དང་ཐེ་ཚོམ་ཉོན་མོངས་ཅན་ནོ། ། འཇིག་ལྟ་ལ་ལྷན་སྐྱེས་ཡོད་ཀྱང་འདིར་ཀུན་བཏགས་སོ། །ཕྱིར་འོང་གི་འབྲས་བུ་ནི་འདོད་ཉོན་དྲུག་པ་སྤངས་པའི་ཆ་ནས་འཇོག་ཅིང༌། །དེ་ལ་གནས་པ་ནི་དེའི་འབྲས་གནས་དང༌། དེ་ཐོབ་ཕྱིར་དུ་བརྩོན་པས་འཇུག་པ་ནི་དེའི་ཞུགས་པའོ། །ཕྱི་མི་འོངས་ཀྱི་འབྲས་བུ་ནི་འདོད་ཉོན་དགུ་པ་སྤངས་པའི་ཆ་ནས་འཇོག་ཅིང༌། དེ་ལ་གནས་པ་དང་དེའི་ཆེད་དུ་ཞུགས་པ་ནི་འབྲས་གནས་དང་ཞུགས་པའོ། །",
            "type": "source",
            "mapping": []
        },
        {
            "content": "དེ་བཞིན་དུ་ལན་ཅིག་ཕྱིར་འོང་བ་དང་ཕྱིར་མི་འོངས་པ་དང་དགྲ་བཅོམ་པ་གསུམ་ལ་སྦྱར་ནས་གསུངས་པ་ལྟར་ཏེ་དོན་ནི་སྔར་ལྟར་རོ། །རྒྱུན་ཞུགས་སོགས་བཞི་ལ་ཞུགས་པ་དང་འབྲས་གནས་ཟུང་རེ་ཡོད་པས་སོ་སོར་ཕྱེ་ན་གང་ཟག་ཡ་བརྒྱད་དང༌། ཟུང་རེ་བསྡོམས་ན་སྐྱེས་བུ་ཟུང་བཞིར་འགྱུར་རོ། ། འདིའི་བཞི་ལ་བཤད་པ་མང་དུ་ཡོད་ཀྱང་མཚོན་ཙམ་ནི་རྒྱུན་ཞུགས་དགེ་སྦྱོང་ཚུལ་གྱི་འབྲས་བུ་འགོག་བདེན་ནི་མཐོང་སྤངས་ཀུན་སྦྱོར་གསུམ་སྤངས་པའི་སྒོ་ནས་བཞག་པས། དེ་ལྟ་བུའི་འབྲས་བུ་དེ་ཐོབ་ནས་དེ་ལ་གནས་པ་ལ་ནི་རྒྱུན་ཞུགས་འབྲས་གནས་དང༌། དེ་ཐོབ་ཕྱིར་དུ་འབད་ཅིང་ཞུགས་པ་ལ་དེའི་ཞུགས་པ་ཞེས་བྱ་ཞིང༌།ཀུན་སྦྱོར་གསུམ་ནི། འཇིག་ལྟ་དང་ཚུལ་ཞུགས་མཆོག་འཛིན་དང་ཐེ་ཚོམ་ཉོན་མོངས་ཅན་ནོ། ། འཇིག་ལྟ་ལ་ལྷན་སྐྱེས་ཡོད་ཀྱང་འདིར་ཀུན་བཏགས་སོ། །ཕྱིར་འོང་གི་འབྲས་བུ་ནི་འདོད་ཉོན་དྲུག་པ་སྤངས་པའི་ཆ་ནས་འཇོག་ཅིང༌། །དེ་ལ་གནས་པ་ནི་དེའི་འབྲས་གནས་དང༌། དེ་ཐོབ་ཕྱིར་དུ་བརྩོན་པས་འཇུག་པ་ནི་དེའི་ཞུགས་པའོ། །ཕྱི་མི་འོངས་ཀྱི་འབྲས་བུ་ནི་འདོད་ཉོན་དགུ་པ་སྤངས་པའི་ཆ་ནས་འཇོག་ཅིང༌། དེ་ལ་གནས་པ་དང་དེའི་ཆེད་དུ་ཞུགས་པ་ནི་འབྲས་གནས་དང་ཞུགས་པའོ། །",
            "type": "source",
            "mapping": []
        },
        {
            "content": "",
            "type": "source",
            "mapping": []
        },
        {
            "content": "",
            "type": "source",
            "mapping": []
        },
        {
            "content": "དེ་ནས་རབ་འབྱོར་གྱིས་བདག་ཐ་སྙད་དུ་ཉོན་མོངས་སྤངས་པའི་དགྲ་བཅོམ་པ་ལགས་ཀྱང༌། བདག་གིས་བདག་ནི་དགྲ་བཅོམ་པའོ་སྙམ་དུ་བདེན་པར་མི་འཛིན་ལགས་སོ་ཞེས་དང༌།",
            "type": "source",
            "mapping": []
        },
        {
            "content": "དེ་ནས་རབ་འབྱོར་གྱིས་བདག་ཐ་སྙད་དུ་ཉོན་མོངས་སྤངས་པའི་དགྲ་བཅོམ་པ་ལགས་ཀྱང༌། བདག་གིས་བདག་ནི་དགྲ་བཅོམ་པའོ་སྙམ་དུ་བདེན་པར་མི་འཛིན་ལགས་སོ་ཞེས་དང༌།",
            "type": "source",
            "mapping": []
        },
        {
            "content": "གལ་ཏེ་དེ་ལྟར་འཛིན་ན་ནི་བདག་ཀྱང་ཉོན་མོངས་ཅན་དུ་འགྱུར་བས་དགྲ་བཅོམ་པ་མ་ཡིན་པར་འགྱུར་རོ། །",
            "type": "source",
            "mapping": []
        },
        {
            "content": "གལ་ཏེ་དེ་ལྟར་འཛིན་ན་ནི་བདག་ཀྱང་ཉོན་མོངས་ཅན་དུ་འགྱུར་བས་དགྲ་བཅོམ་པ་མ་ཡིན་པར་འགྱུར་རོ། །",
            "type": "source",
            "mapping": []
        },
        {
            "content": "གལ་ཏེ་དེ་ལྟར་འཛིན་ན་ནི་བདག་ཀྱང་ཉོན་མོངས་ཅན་དུ་འགྱུར་བས་དགྲ་བཅོམ་པ་མ་ཡིན་པར་འགྱུར་རོ། །",
            "type": "source",
            "mapping": []
        },
        {
            "content": "གལ་ཏེ་དེ་ལྟར་འཛིན་ན་ནི་བདག་ཀྱང་ཉོན་མོངས་ཅན་དུ་འགྱུར་བས་དགྲ་བཅོམ་པ་མ་ཡིན་པར་འགྱུར་རོ། །",
            "type": "source",
            "mapping": []
        },
        {
            "content": "བདག་ནི་དགྲ་བཅོམ་པ་ཡིན་ཏེ། བཅོམ་ལྡན་འདས་ཀྱིས་བདག་ལ་ཐ་སྙད་དུ་རིགས་ཀྱི་བུ་རབ་འབྱོར་ནི་ཉོན་མོངས་པ་མེད་པ་རྣམས་ཀྱི་མཆོག་ཏུ་ལུང་བསྟན་ལ། དོན་དམ་པར་ཅི་ལ་ཡང་མི་གནས་པས་ན་ཉོན་མོངས་པ་མེད་པར་གནས་པར་ཞེས་ལུང་མི་སྟོན་ཏེ། དོན་དམ་པར་གནས་བྱ་དང་གནས་བྱེད་དང་གནས་པ་པོ་གང་ཡང་མ་གྲུབ་པའི་ཕྱིར་རོ་ཞེས་བཤད་དེ། ཐལ་འགྱུར་བས་བདེན་འཛིན་ཉོན་མོངས་སུ་བཞེད་པ་དང་མཐུན་ནོ། །",
            "type": "source",
            "mapping": []
        },
        {
            "content": "བདག་ནི་དགྲ་བཅོམ་པ་ཡིན་ཏེ། བཅོམ་ལྡན་འདས་ཀྱིས་བདག་ལ་ཐ་སྙད་དུ་རིགས་ཀྱི་བུ་རབ་འབྱོར་ནི་ཉོན་མོངས་པ་མེད་པ་རྣམས་ཀྱི་མཆོག་ཏུ་ལུང་བསྟན་ལ། དོན་དམ་པར་ཅི་ལ་ཡང་མི་གནས་པས་ན་ཉོན་མོངས་པ་མེད་པར་གནས་པར་ཞེས་ལུང་མི་སྟོན་ཏེ། དོན་དམ་པར་གནས་བྱ་དང་གནས་བྱེད་དང་གནས་པ་པོ་གང་ཡང་མ་གྲུབ་པའི་ཕྱིར་རོ་ཞེས་བཤད་དེ། ཐལ་འགྱུར་བས་བདེན་འཛིན་ཉོན་མོངས་སུ་བཞེད་པ་དང་མཐུན་ནོ། །",
            "type": "source",
            "mapping": []
        },
        {
            "content": "དོན་དམ་པར་ཐོབ་བྱ་དང་ཐོབ་བྱེད་དང་ཐོབ་མཁན་རྣམས་མེད་པར་མ་ཟད། དོན་དམ་པར་བླང་བར་བྱ་བའི་ཆོས་ཀྱང་མེད་ཅེས་སྟོན་པ་ནི། བཅོམ་ལྡན་འདས་ཀྱིས་རབ་འབྱོར་ལ་དེ་བཞིན་གཤེགས་པ་ངས་སྔོན་སངས་རྒྱས་མར་མེ་མཛད་ལས་དོན་དམ་པར་གང་བླངས་པའི་ཆོས་དེ་གང་ཡང་ཡོད་སྙམ་མམ་ཞེས་དྲིས་པ་ན།",
            "type": "source",
            "mapping": []
        },
        {
            "content": "དོན་དམ་པར་ཐོབ་བྱ་དང་ཐོབ་བྱེད་དང་ཐོབ་མཁན་རྣམས་མེད་པར་མ་ཟད། དོན་དམ་པར་བླང་བར་བྱ་བའི་ཆོས་ཀྱང་མེད་ཅེས་སྟོན་པ་ནི། བཅོམ་ལྡན་འདས་ཀྱིས་རབ་འབྱོར་ལ་དེ་བཞིན་གཤེགས་པ་ངས་སྔོན་སངས་རྒྱས་མར་མེ་མཛད་ལས་དོན་དམ་པར་གང་བླངས་པའི་ཆོས་དེ་གང་ཡང་ཡོད་སྙམ་མམ་ཞེས་དྲིས་པ་ན།",
            "type": "source",
            "mapping": []
        },
        {
            "content": "རབ་འབྱོར་གྱིས་དེ་མ་མཆིས་སོ་ཞེས་ལན་ཕུལ།འདིར་སྒོས་སུ་སངས་རྒྱས་མར་མེ་མཛད་ཀྱི་མཚན་ནས་སྨོས་པ་ནི། སྟོན་པས་སྔོན་གཞོན་ནུ་ཆོས་ཀྱི་སྤྲིན་དུ་གྱུར་པའི་ཚེ། སངས་རྒྱས་མར་མེ་མཛད་ཀྱིས་བྱིན་གྱིས་བརླབས་པ་ལ་བརྟེན་ནས་མི་སྐྱེ་བའི་ཆོས་ལ་བཟོད་པ་ཆེན་པོ་ཐོབ་ཅིང༌། ས་བརྒྱད་པ་མངོན་དུ་མཛད་པ་ན་མར་མེ་མཛད་ཀྱིས་ཁྱོད་ལ་མ་འོངས་པའི་དུས་སུ་སངས་རྒྱས་ཤཱཀྱ་ཐུབ་པ་ཞེས་བྱ་བར་འགྱུར་རོ། ཞེས་ལུང་བསྟན་པའི་བཀའ་དྲིན་དྲན་པའི་ཆེད་དེ་འོག་ཏུ་བཤད་པར་བྱའོ། །",
            "type": "source",
            "mapping": []
        },
        {
            "content": "རབ་འབྱོར་གྱིས་དེ་མ་མཆིས་སོ་ཞེས་ལན་ཕུལ།འདིར་སྒོས་སུ་སངས་རྒྱས་མར་མེ་མཛད་ཀྱི་མཚན་ནས་སྨོས་པ་ནི། སྟོན་པས་སྔོན་གཞོན་ནུ་ཆོས་ཀྱི་སྤྲིན་དུ་གྱུར་པའི་ཚེ། སངས་རྒྱས་མར་མེ་མཛད་ཀྱིས་བྱིན་གྱིས་བརླབས་པ་ལ་བརྟེན་ནས་མི་སྐྱེ་བའི་ཆོས་ལ་བཟོད་པ་ཆེན་པོ་ཐོབ་ཅིང༌། ས་བརྒྱད་པ་མངོན་དུ་མཛད་པ་ན་མར་མེ་མཛད་ཀྱིས་ཁྱོད་ལ་མ་འོངས་པའི་དུས་སུ་སངས་རྒྱས་ཤཱཀྱ་ཐུབ་པ་ཞེས་བྱ་བར་འགྱུར་རོ། ཞེས་ལུང་བསྟན་པའི་བཀའ་དྲིན་དྲན་པའི་ཆེད་དེ་འོག་ཏུ་བཤད་པར་བྱའོ། །",
            "type": "source",
            "mapping": []
        },
        {
            "content": "དེ་ལྟར་འཚང་རྒྱ་བ་ལ་གང་དུ་འཚང་རྒྱ་བའི་ཞིང་དག་པ་སྒྲུབ་དགོས་པར་སྟོན་པ་ནི། བཅོམ་ལྡན་འདས་ཀྱིས་རབ་འབྱོར་ལ་བྱང་ཆུབ་སེམས་དཔའ་གང་ལ་ལ་ཞིག་བདག་གིས་ཞིང་བཀོད་པ་རྣམས་བདེན་ཞེན་གྱིས་དོན་དམ་པར་བསྒྲུབ་པར་བྱའོ་སྙམ་ཞིང་ཟེར་ན། ཚིག་དེ་ནི་མི་བདེན་པར་སྨྲ་བའོ། །",
            "type": "source",
            "mapping": []
        },
        {
            "content": "དེའི་རྒྱུ་མཚན་ནི། འཚང་རྒྱ་བའི་གནས་ཀྱི་ཞིང་གི་བཀོད་པ་ཕུན་སུམ་ཚོགས་པ་རྣམས་ནི་རྒྱུ་རྐྱེན་དུ་མ་ཚོགས་ནས་བྱུང་བ་སྒྱུ་མ་ལྟ་བུའི་བཀོད་པ་ཡིན་གྱི། དོན་དམ་པར་བཀོད་པ་དེ་དག་མེད་པར་དེ་བཞིན་གཤེགས་པས་གསུངས་པའི་ཕྱིར་ཏེ། འོན་ཀྱང་མ་བརྟག་མ་དཔྱད་པའི་བློ་ངོ་ན་ཡོད་པས་ཐ་སྙད་དུ་ཞིང་གི་བཀོད་པ་རྣམས་ཞེས་བྱའོ། །",
            "type": "source",
            "mapping": []
        },
        {
            "content": "དེའི་རྒྱུ་མཚན་ནི། འཚང་རྒྱ་བའི་གནས་ཀྱི་ཞིང་གི་བཀོད་པ་ཕུན་སུམ་ཚོགས་པ་རྣམས་ནི་རྒྱུ་རྐྱེན་དུ་མ་ཚོགས་ནས་བྱུང་བ་སྒྱུ་མ་ལྟ་བུའི་བཀོད་པ་ཡིན་གྱི། དོན་དམ་པར་བཀོད་པ་དེ་དག་མེད་པར་དེ་བཞིན་གཤེགས་པས་གསུངས་པའི་ཕྱིར་ཏེ། འོན་ཀྱང་མ་བརྟག་མ་དཔྱད་པའི་བློ་ངོ་ན་ཡོད་པས་ཐ་སྙད་དུ་ཞིང་གི་བཀོད་པ་རྣམས་ཞེས་བྱའོ། །",
            "type": "source",
            "mapping": []
        },
        {
            "content": "དེ་ལྟ་བས་ན་བྱང་ཆུབ་སེམས་དཔའ་ཞིང་གི་བཀོད་པ་བསྒྲུབ་པར་བྱ་བ་ན་འདི་ལྟར་བདེན་ཞེན་གྱིས་མི་གནས་པར་སེམས་བསྐྱེད་པར་བྱའོ། ། དོན་དམ་པར་ཅི་ལ་ཡང་མི་གནས་ཤིང་གཟུགས་སྒྲ་སོགས་ཀྱི་ཆོས་གང་ལ་བདེན་ཞེན་གྱིས་མི་གནས་པར་སེམས་བསྐྱེད་པར་བྱའོ། །",
            "type": "source",
            "mapping": []
        },
        {
            "content": "དེ་ལྟ་བས་ན་བྱང་ཆུབ་སེམས་དཔའ་ཞིང་གི་བཀོད་པ་བསྒྲུབ་པར་བྱ་བ་ན་འདི་ལྟར་བདེན་ཞེན་གྱིས་མི་གནས་པར་སེམས་བསྐྱེད་པར་བྱའོ། ། དོན་དམ་པར་ཅི་ལ་ཡང་མི་གནས་ཤིང་གཟུགས་སྒྲ་སོགས་ཀྱི་ཆོས་གང་ལ་བདེན་ཞེན་གྱིས་མི་གནས་པར་སེམས་བསྐྱེད་པར་བྱའོ། །",
            "type": "source",
            "mapping": []
        },
        {
            "content": "དེ་ལྟ་བས་ན་བྱང་ཆུབ་སེམས་དཔའ་ཞིང་གི་བཀོད་པ་བསྒྲུབ་པར་བྱ་བ་ན་འདི་ལྟར་བདེན་ཞེན་གྱིས་མི་གནས་པར་སེམས་བསྐྱེད་པར་བྱའོ། ། དོན་དམ་པར་ཅི་ལ་ཡང་མི་གནས་ཤིང་གཟུགས་སྒྲ་སོགས་ཀྱི་ཆོས་གང་ལ་བདེན་ཞེན་གྱིས་མི་གནས་པར་སེམས་བསྐྱེད་པར་བྱའོ། །",
            "type": "source",
            "mapping": []
        },
        {
            "content": "དེ་ལྟ་བས་ན་བྱང་ཆུབ་སེམས་དཔའ་ཞིང་གི་བཀོད་པ་བསྒྲུབ་པར་བྱ་བ་ན་འདི་ལྟར་བདེན་ཞེན་གྱིས་མི་གནས་པར་སེམས་བསྐྱེད་པར་བྱའོ། ། དོན་དམ་པར་ཅི་ལ་ཡང་མི་གནས་ཤིང་གཟུགས་སྒྲ་སོགས་ཀྱི་ཆོས་གང་ལ་བདེན་ཞེན་གྱིས་མི་གནས་པར་སེམས་བསྐྱེད་པར་བྱའོ། །",
            "type": "source",
            "mapping": []
        },
        {
            "content": "ཕྱིའི་ཞིང་གི་བཀོད་པ་ལྟ་བུར་མ་ཟད། བཅུད་ཀྱི་གང་ཟག་གི་ལུས་ཀྱི་བཀོད་པ་ཡང་རྐྱེན་ཚོགས་པ་ཙམ་ལས་དོན་དམ་པར་གྲུབ་པ་མེད་དོ་ཞེས་སྟོན་པ་ནི།  རབ་འབྱོར་དཔེར་ན་སྐྱེས་བུ་ཞིག་ལུས་རིའི་རྒྱལ་པོ་རི་རབ་ཙམ་དུ་གྱུར་ན་ལུས་དེ་ཆེ་བ་ཡིན་སྙམ་མམ་ཞེས་དྲིས་པ་ན།",
            "type": "source",
            "mapping": []
        },
        {
            "content": "ལན་དུ་ལུས་དེ་ཆེ་བར་ཞུས་ཤིང༌། ལུས་དེ་ཉིད་ཆ་དུ་མ་ཚོགས་པའི་ཕུང་པོ་ཐ་སྙད་ཙམ་དུ་ཡོད་ཀྱི། ཆ་ལ་མ་ལྟོས་པའི་དངོས་པོ་སྟེ་ངོ་བོར་མེད་པར་དེ་བཞིན་གཤེགས་པས་གསུངས་ཏེ། འཇིག་རྟེན་གྱི་ཐ་སྙད་དུ་ལུས་དེ་ལ་ཆེའོ་ཞེས་བྱའོ། །",
            "type": "source",
            "mapping": []
        },
        {
            "content": "ལན་དུ་ལུས་དེ་ཆེ་བར་ཞུས་ཤིང༌། ལུས་དེ་ཉིད་ཆ་དུ་མ་ཚོགས་པའི་ཕུང་པོ་ཐ་སྙད་ཙམ་དུ་ཡོད་ཀྱི། ཆ་ལ་མ་ལྟོས་པའི་དངོས་པོ་སྟེ་ངོ་བོར་མེད་པར་དེ་བཞིན་གཤེགས་པས་གསུངས་ཏེ། འཇིག་རྟེན་གྱི་ཐ་སྙད་དུ་ལུས་དེ་ལ་ཆེའོ་ཞེས་བྱའོ། །",
            "type": "source",
            "mapping": []
        },
        {
            "content": "དེས་ན་དོན་དམ་པར་ལུས་སུ་གྲུབ་པ་མ་མཆིས་པའི་ཀུན་རྫོབ་པའི་ལུས་དེ་ལ་ལུས་ཞེས་བྱའོ། །ལུས་ཆེ་བས་མཚོན་ནས་གཟུགས་ཆེ་ཆུང་ཐམས་ཅད་ཀྱང་དེ་དང་འདྲ་བར་སྦྱར་རོ། །དེ་ལྟར་གསུངས་པ་ནི་སྣོད་བཅུད་ཐམས་ཅད་ཀྱང་རང་བཞིན་གྱིས་སྟོང་པར་སྒོམ་པའི་ཚུལ་བཤད་པའོ། །",
            "type": "source",
            "mapping": []
        },
        {
            "content": "དེས་ན་དོན་དམ་པར་ལུས་སུ་གྲུབ་པ་མ་མཆིས་པའི་ཀུན་རྫོབ་པའི་ལུས་དེ་ལ་ལུས་ཞེས་བྱའོ། །ལུས་ཆེ་བས་མཚོན་ནས་གཟུགས་ཆེ་ཆུང་ཐམས་ཅད་ཀྱང་དེ་དང་འདྲ་བར་སྦྱར་རོ། །དེ་ལྟར་གསུངས་པ་ནི་སྣོད་བཅུད་ཐམས་ཅད་ཀྱང་རང་བཞིན་གྱིས་སྟོང་པར་སྒོམ་པའི་ཚུལ་བཤད་པའོ། །",
            "type": "source",
            "mapping": []
        },
        {
            "content": "དེས་ན་དོན་དམ་པར་ལུས་སུ་གྲུབ་པ་མ་མཆིས་པའི་ཀུན་རྫོབ་པའི་ལུས་དེ་ལ་ལུས་ཞེས་བྱའོ། །ལུས་ཆེ་བས་མཚོན་ནས་གཟུགས་ཆེ་ཆུང་ཐམས་ཅད་ཀྱང་དེ་དང་འདྲ་བར་སྦྱར་རོ། །དེ་ལྟར་གསུངས་པ་ནི་སྣོད་བཅུད་ཐམས་ཅད་ཀྱང་རང་བཞིན་གྱིས་སྟོང་པར་སྒོམ་པའི་ཚུལ་བཤད་པའོ། །",
            "type": "source",
            "mapping": []
        },
        {
            "content": "དེ་ལྟར་བསྒོམས་པའི་ཕན་ཡོན་སྟོན་པ་ལ་དཔེ་ནི། བཅོམ་ལྡན་འདས་ཀྱིས་རབ་འབྱོར་ལ་གངྒཱའི་ཀླུང་གི་བྱེ་མ་ཇི་སྙེད་པ་གངྒཱའི་ཀླུང་ཡང་དེ་སྙེད་ཁོ་ནར་གྱུར་ན། དེ་དག་གི་བྱེ་མ་དེ་དག་གྲངས་མང་ངམ་ཞེས་དྲིས་པ་ན།",
            "type": "source",
            "mapping": []
        },
        {
            "content": "དེ་ལྟར་བསྒོམས་པའི་ཕན་ཡོན་སྟོན་པ་ལ་དཔེ་ནི། བཅོམ་ལྡན་འདས་ཀྱིས་རབ་འབྱོར་ལ་གངྒཱའི་ཀླུང་གི་བྱེ་མ་ཇི་སྙེད་པ་གངྒཱའི་ཀླུང་ཡང་དེ་སྙེད་ཁོ་ནར་གྱུར་ན། དེ་དག་གི་བྱེ་མ་དེ་དག་གྲངས་མང་ངམ་ཞེས་དྲིས་པ་ན།",
            "type": "source",
            "mapping": []
        },
        {
            "content": "ལན་ལ་གངྒཱའི་ཀླུང་དེ་དག་ཉིད་ཀྱང་མང་ན་དེ་དག་གི་བྱེ་མ་རྣམས་མང་བ་ལྟ་སྨོས་ཀྱང་ཅི་འཚལ་ཏེ་བརྗོད་མི་དགོས་སོ་ཞེས་གསོལ།",
            "type": "source",
            "mapping": []
        },
        {
            "content": "དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་རབ་འབྱོར་ལ་ཁྱོད་མོས་པ་སྟེ་འདོད་པ་བསྐྱེད་པ་དང་ཁྱོད་ཀྱིས་དོན་དེ་ཁོང་དུ་ཆུད་པར་བྱའོ། ། གངྒཱའི་ཀླུང་དེ་དག་གི་བྱེ་མ་ཇི་སྙེད་པའི་གྲངས་ཀྱི་འཇིག་རྟེན་གྱི་ཁམས་རྣམས་སྐྱེས་པའམ་བུད་མེད་གང་གིས་གསེར་དངུལ་སོགས་སྔར་བཤད་པ་ལྟར་རིན་པོ་ཆེ་སྣ་བདུན་གྱིས་གང་བར་བྱས་ཏེ་དེ་བཞིན་གཤེགས་པ་རྣམས་ལ་མཆོད་དེ་སྦྱིན་པ་བྱིན་ན་བསོད་ནམས་མང་ངམ་ཞེས་དྲིས་པའི་ལན་དུ་ཆེས་མང་བར་ཞུས་སོ། །",
            "type": "source",
            "mapping": []
        },
        {
            "content": "དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་རབ་འབྱོར་ལ་ཁྱོད་མོས་པ་སྟེ་འདོད་པ་བསྐྱེད་པ་དང་ཁྱོད་ཀྱིས་དོན་དེ་ཁོང་དུ་ཆུད་པར་བྱའོ། ། གངྒཱའི་ཀླུང་དེ་དག་གི་བྱེ་མ་ཇི་སྙེད་པའི་གྲངས་ཀྱི་འཇིག་རྟེན་གྱི་ཁམས་རྣམས་སྐྱེས་པའམ་བུད་མེད་གང་གིས་གསེར་དངུལ་སོགས་སྔར་བཤད་པ་ལྟར་རིན་པོ་ཆེ་སྣ་བདུན་གྱིས་གང་བར་བྱས་ཏེ་དེ་བཞིན་གཤེགས་པ་རྣམས་ལ་མཆོད་དེ་སྦྱིན་པ་བྱིན་ན་བསོད་ནམས་མང་ངམ་ཞེས་དྲིས་པའི་ལན་དུ་ཆེས་མང་བར་ཞུས་སོ། །",
            "type": "source",
            "mapping": []
        },
        {
            "content": "གངྒཱའི་ཀླུང་ཞེས་པ་ནི་མ་དྲོས་མཚོ་ནས་འབབ་པའི་ཆུ་བོ་གངྒཱ་ལ་བཞེད་པ་དང༌། རྒྱ་མཚོ་ཆེན་པོ་ལ་བཞེད་པའི་ཚུལ་གཉིས་དང༌། བྱེ་མ་ཡང་བྱེ་མ་ཡོངས་གྲགས་དང༌། ཆུའི་ཐིགས་པའི་རྡུལ་ལ་བྱེད་པའི་ཚུལ་གཉིས་སྣང་ངོ༌། །",
            "type": "source",
            "mapping": []
        },
        {
            "content": "གངྒཱའི་ཀླུང་ཞེས་པ་ནི་མ་དྲོས་མཚོ་ནས་འབབ་པའི་ཆུ་བོ་གངྒཱ་ལ་བཞེད་པ་དང༌། རྒྱ་མཚོ་ཆེན་པོ་ལ་བཞེད་པའི་ཚུལ་གཉིས་དང༌། བྱེ་མ་ཡང་བྱེ་མ་ཡོངས་གྲགས་དང༌། ཆུའི་ཐིགས་པའི་རྡུལ་ལ་བྱེད་པའི་ཚུལ་གཉིས་སྣང་ངོ༌། །",
            "type": "source",
            "mapping": []
        },
        {
            "content": "གངྒཱའི་ཀླུང་ཞེས་པ་ནི་མ་དྲོས་མཚོ་ནས་འབབ་པའི་ཆུ་བོ་གངྒཱ་ལ་བཞེད་པ་དང༌། རྒྱ་མཚོ་ཆེན་པོ་ལ་བཞེད་པའི་ཚུལ་གཉིས་དང༌། བྱེ་མ་ཡང་བྱེ་མ་ཡོངས་གྲགས་དང༌། ཆུའི་ཐིགས་པའི་རྡུལ་ལ་བྱེད་པའི་ཚུལ་གཉིས་སྣང་ངོ༌། །",
            "type": "source",
            "mapping": []
        },
        {
            "content": "གངྒཱའི་ཀླུང་ཞེས་པ་ནི་མ་དྲོས་མཚོ་ནས་འབབ་པའི་ཆུ་བོ་གངྒཱ་ལ་བཞེད་པ་དང༌། རྒྱ་མཚོ་ཆེན་པོ་ལ་བཞེད་པའི་ཚུལ་གཉིས་དང༌། བྱེ་མ་ཡང་བྱེ་མ་ཡོངས་གྲགས་དང༌། ཆུའི་ཐིགས་པའི་རྡུལ་ལ་བྱེད་པའི་ཚུལ་གཉིས་སྣང་ངོ༌། །",
            "type": "source",
            "mapping": []
        },
        {
            "content": "གངྒཱའི་ཀླུང་ཞེས་པ་ནི་མ་དྲོས་མཚོ་ནས་འབབ་པའི་ཆུ་བོ་གངྒཱ་ལ་བཞེད་པ་དང༌། རྒྱ་མཚོ་ཆེན་པོ་ལ་བཞེད་པའི་ཚུལ་གཉིས་དང༌། བྱེ་མ་ཡང་བྱེ་མ་ཡོངས་གྲགས་དང༌། ཆུའི་ཐིགས་པའི་རྡུལ་ལ་བྱེད་པའི་ཚུལ་གཉིས་སྣང་ངོ༌། །",
            "type": "source",
            "mapping": []
        },
        {
            "content": "གངྒཱའི་ཀླུང་ཞེས་པ་ནི་མ་དྲོས་མཚོ་ནས་འབབ་པའི་ཆུ་བོ་གངྒཱ་ལ་བཞེད་པ་དང༌། རྒྱ་མཚོ་ཆེན་པོ་ལ་བཞེད་པའི་ཚུལ་གཉིས་དང༌། བྱེ་མ་ཡང་བྱེ་མ་ཡོངས་གྲགས་དང༌། ཆུའི་ཐིགས་པའི་རྡུལ་ལ་བྱེད་པའི་ཚུལ་གཉིས་སྣང་ངོ༌། །",
            "type": "source",
            "mapping": []
        },
        {
            "content": "གངྒཱའི་ཀླུང་ཞེས་པ་ནི་མ་དྲོས་མཚོ་ནས་འབབ་པའི་ཆུ་བོ་གངྒཱ་ལ་བཞེད་པ་དང༌། རྒྱ་མཚོ་ཆེན་པོ་ལ་བཞེད་པའི་ཚུལ་གཉིས་དང༌། བྱེ་མ་ཡང་བྱེ་མ་ཡོངས་གྲགས་དང༌། ཆུའི་ཐིགས་པའི་རྡུལ་ལ་བྱེད་པའི་ཚུལ་གཉིས་སྣང་ངོ༌། །\n\nདཔེ་བཤད་པ་དེ་ལས་གཞུང་འདི་འདོན་ཅིང་ཉན་སེམས་བསྒོམས་པའི་ཕན་ཡོན་ལྷག་པར་ཆེའོ་ཞེས་པ་ནི། གང་གིས་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་ལས༌། ཐ་ན་ཞེས་པ་ནི་མ་མཐའོ། །གཞན་ནི་སྔར་ལྟར་རོ། །",
            "type": "source",
            "mapping": []
        },
        {
            "content": "ཡང་རབ་འབྱོར་ཞེས་སོགས་ཀྱིས་རྣམ་གྲངས་སྟོན་ཏེ། འདོན་པ་སོགས་ལས་ཕན་ཡོན་དེ་ལྟར་འབྱུང་བར་མ་ཟད། གཞུང་འདི་ལེགས་པར་འདོན་པ་དང་འདིའི་དོན་སྟོན་ཅིང་ཉམས་སུ་ལེན་པའི་ས་ཕྱོགས་སམ་གནས་དེ་ནི་གཞན་གྱི་མཆོད་པའི་རྟེན་དུ་འགྱུར་བ་ཡིན་པས། དེ་ལྟ་ན་གཞུང་འདིའི་ཚིག་བློ་ལ་ལེན་ཅིང་འཛིན་པ་དང༌། གླེགས་བམ་འཆང་བ་དང༌། དེ་ཀློག་པ་དང༌། དེའི་དོན་ཀུན་ཆུབ་པ་སྟེ་ཤེས་པ་དང༌། དོན་ཚུལ་བཞིན་དུ་ཉམས་ལེན་གྱིས་ཡིད་ལ་བྱེད་པའི་གང་ཟག་དེ་ནི་ངོ་མཚར་རབ་དང་ལྡན་པར་འགྱུར་པ་ལྟ་ཅི་སྨོས་ཏེ། ས་ཕྱོགས་དེ་ན་སྟོན་པ་སངས་རྒྱས་སམ་བླ་མ་སྐྱེས་བུ་དམ་པ་གང་ཡང་རུང་བ་གནས་སོ། །",
            "type": "source",
            "mapping": []
        },
        {
            "content": "ཡང་རབ་འབྱོར་ཞེས་སོགས་ཀྱིས་རྣམ་གྲངས་སྟོན་ཏེ། འདོན་པ་སོགས་ལས་ཕན་ཡོན་དེ་ལྟར་འབྱུང་བར་མ་ཟད། གཞུང་འདི་ལེགས་པར་འདོན་པ་དང་འདིའི་དོན་སྟོན་ཅིང་ཉམས་སུ་ལེན་པའི་ས་ཕྱོགས་སམ་གནས་དེ་ནི་གཞན་གྱི་མཆོད་པའི་རྟེན་དུ་འགྱུར་བ་ཡིན་པས། དེ་ལྟ་ན་གཞུང་འདིའི་ཚིག་བློ་ལ་ལེན་ཅིང་འཛིན་པ་དང༌། གླེགས་བམ་འཆང་བ་དང༌། དེ་ཀློག་པ་དང༌། དེའི་དོན་ཀུན་ཆུབ་པ་སྟེ་ཤེས་པ་དང༌། དོན་ཚུལ་བཞིན་དུ་ཉམས་ལེན་གྱིས་ཡིད་ལ་བྱེད་པའི་གང་ཟག་དེ་ནི་ངོ་མཚར་རབ་དང་ལྡན་པར་འགྱུར་པ་ལྟ་ཅི་སྨོས་ཏེ། ས་ཕྱོགས་དེ་ན་སྟོན་པ་སངས་རྒྱས་སམ་བླ་མ་སྐྱེས་བུ་དམ་པ་གང་ཡང་རུང་བ་གནས་སོ། །",
            "type": "source",
            "mapping": []
        },
        {
            "content": "ཡང་རབ་འབྱོར་ཞེས་སོགས་ཀྱིས་རྣམ་གྲངས་སྟོན་ཏེ། འདོན་པ་སོགས་ལས་ཕན་ཡོན་དེ་ལྟར་འབྱུང་བར་མ་ཟད། གཞུང་འདི་ལེགས་པར་འདོན་པ་དང་འདིའི་དོན་སྟོན་ཅིང་ཉམས་སུ་ལེན་པའི་ས་ཕྱོགས་སམ་གནས་དེ་ནི་གཞན་གྱི་མཆོད་པའི་རྟེན་དུ་འགྱུར་བ་ཡིན་པས། དེ་ལྟ་ན་གཞུང་འདིའི་ཚིག་བློ་ལ་ལེན་ཅིང་འཛིན་པ་དང༌། གླེགས་བམ་འཆང་བ་དང༌། དེ་ཀློག་པ་དང༌། དེའི་དོན་ཀུན་ཆུབ་པ་སྟེ་ཤེས་པ་དང༌། དོན་ཚུལ་བཞིན་དུ་ཉམས་ལེན་གྱིས་ཡིད་ལ་བྱེད་པའི་གང་ཟག་དེ་ནི་ངོ་མཚར་རབ་དང་ལྡན་པར་འགྱུར་པ་ལྟ་ཅི་སྨོས་ཏེ། ས་ཕྱོགས་དེ་ན་སྟོན་པ་སངས་རྒྱས་སམ་བླ་མ་སྐྱེས་བུ་དམ་པ་གང་ཡང་རུང་བ་གནས་སོ། །\n\n དེ་ནས་རབ་འབྱོར་གྱིས་གཞུང་འདིའི་མིང་ཅི་ལྟར་ལགས་ཞེས་ཞུས་པ་ན།",
            "type": "source",
            "mapping": []
        },
        {
            "content": "དེ་ནས་རབ་འབྱོར་གྱིས་གཞུང་འདིའི་མིང་ཅི་ལྟར་ལགས་ཞེས་ཞུས་པ་ན།",
            "type": "source",
            "mapping": []
        },
        {
            "content": "དེ་ནས་རབ་འབྱོར་གྱིས་གཞུང་འདིའི་མིང་ཅི་ལྟར་ལགས་ཞེས་ཞུས་པ་ན།",
            "type": "source",
            "mapping": []
        },
        {
            "content": "དེ་ནས་རབ་འབྱོར་གྱིས་གཞུང་འདིའི་མིང་ཅི་ལྟར་ལགས་ཞེས་ཞུས་པ་ན། \n\nལན་དུ་བཅོམ་ལྡན་འདས་ཀྱིས་འདིའི་མིང་ལ་གཞུང་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཞེས་བྱ་སྟེ་འདིའི་མིང་དེ་ལྟར་ཟུངས་ཤིག་ཅེས་པ་ནི། བརྗོད་བྱ་དོན་གྱི་ཤེར་ཕྱིན་བརྗོད་བྱར་བྱས་ནས་སྟོན་པས་རྗོད་བྱེད་གཞུང་ལ་བརྗོད་བྱའི་མིང་གིས་བཏགས་པའོ། །འདིས་ཤེས་རབ་ཀྱི་ཕར་ཕྱིན་གྱི་མིང་གིས་མཚོན་ཏེ་ཕར་ཕྱིན་གཞན་ཡང་བསྟན་ཏོ། ། དེ་བཞིན་གཤེགས་པས་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཞེས་གང་གསུངས་པ་དེ་ཉིད་དོན་དམ་པར་ཕ་རོལ་ཏུ་ཕྱིན་པར་གྲུབ་པ་མེད་ཅིང༌། དེས་ན་ཐ་སྙད་དུ་ཤེས་རབ་ཀྱི་རོལ་ཏུ་ཕྱིན་པ་ཞེས་འདོགས་སོ། །",
            "type": "source",
            "mapping": []
        },
        {
            "content": "ལན་དུ་བཅོམ་ལྡན་འདས་ཀྱིས་འདིའི་མིང་ལ་གཞུང་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཞེས་བྱ་སྟེ་འདིའི་མིང་དེ་ལྟར་ཟུངས་ཤིག་ཅེས་པ་ནི། བརྗོད་བྱ་དོན་གྱི་ཤེར་ཕྱིན་བརྗོད་བྱར་བྱས་ནས་སྟོན་པས་རྗོད་བྱེད་གཞུང་ལ་བརྗོད་བྱའི་མིང་གིས་བཏགས་པའོ། །འདིས་ཤེས་རབ་ཀྱི་ཕར་ཕྱིན་གྱི་མིང་གིས་མཚོན་ཏེ་ཕར་ཕྱིན་གཞན་ཡང་བསྟན་ཏོ། ། དེ་བཞིན་གཤེགས་པས་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཞེས་གང་གསུངས་པ་དེ་ཉིད་དོན་དམ་པར་ཕ་རོལ་ཏུ་ཕྱིན་པར་གྲུབ་པ་མེད་ཅིང༌། དེས་ན་ཐ་སྙད་དུ་ཤེས་རབ་ཀྱི་རོལ་ཏུ་ཕྱིན་པ་ཞེས་འདོགས་སོ། །",
            "type": "source",
            "mapping": []
        },
        {
            "content": "ལན་དུ་བཅོམ་ལྡན་འདས་ཀྱིས་འདིའི་མིང་ལ་གཞུང་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཞེས་བྱ་སྟེ་འདིའི་མིང་དེ་ལྟར་ཟུངས་ཤིག་ཅེས་པ་ནི། བརྗོད་བྱ་དོན་གྱི་ཤེར་ཕྱིན་བརྗོད་བྱར་བྱས་ནས་སྟོན་པས་རྗོད་བྱེད་གཞུང་ལ་བརྗོད་བྱའི་མིང་གིས་བཏགས་པའོ། །འདིས་ཤེས་རབ་ཀྱི་ཕར་ཕྱིན་གྱི་མིང་གིས་མཚོན་ཏེ་ཕར་ཕྱིན་གཞན་ཡང་བསྟན་ཏོ། ། དེ་བཞིན་གཤེགས་པས་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཞེས་གང་གསུངས་པ་དེ་ཉིད་དོན་དམ་པར་ཕ་རོལ་ཏུ་ཕྱིན་པར་གྲུབ་པ་མེད་ཅིང༌། དེས་ན་ཐ་སྙད་དུ་ཤེས་རབ་ཀྱི་རོལ་ཏུ་ཕྱིན་པ་ཞེས་འདོགས་སོ། །",
            "type": "source",
            "mapping": []
        },
        {
            "content": "ལན་དུ་བཅོམ་ལྡན་འདས་ཀྱིས་འདིའི་མིང་ལ་གཞུང་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཞེས་བྱ་སྟེ་འདིའི་མིང་དེ་ལྟར་ཟུངས་ཤིག་ཅེས་པ་ནི། བརྗོད་བྱ་དོན་གྱི་ཤེར་ཕྱིན་བརྗོད་བྱར་བྱས་ནས་སྟོན་པས་རྗོད་བྱེད་གཞུང་ལ་བརྗོད་བྱའི་མིང་གིས་བཏགས་པའོ། །འདིས་ཤེས་རབ་ཀྱི་ཕར་ཕྱིན་གྱི་མིང་གིས་མཚོན་ཏེ་ཕར་ཕྱིན་གཞན་ཡང་བསྟན་ཏོ། ། དེ་བཞིན་གཤེགས་པས་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཞེས་གང་གསུངས་པ་དེ་ཉིད་དོན་དམ་པར་ཕ་རོལ་ཏུ་ཕྱིན་པར་གྲུབ་པ་མེད་ཅིང༌། དེས་ན་ཐ་སྙད་དུ་ཤེས་རབ་ཀྱི་རོལ་ཏུ་ཕྱིན་པ་ཞེས་འདོགས་སོ། །",
            "type": "source",
            "mapping": []
        },
        {
            "content": "ལན་དུ་བཅོམ་ལྡན་འདས་ཀྱིས་འདིའི་མིང་ལ་གཞུང་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཞེས་བྱ་སྟེ་འདིའི་མིང་དེ་ལྟར་ཟུངས་ཤིག་ཅེས་པ་ནི། བརྗོད་བྱ་དོན་གྱི་ཤེར་ཕྱིན་བརྗོད་བྱར་བྱས་ནས་སྟོན་པས་རྗོད་བྱེད་གཞུང་ལ་བརྗོད་བྱའི་མིང་གིས་བཏགས་པའོ། །འདིས་ཤེས་རབ་ཀྱི་ཕར་ཕྱིན་གྱི་མིང་གིས་མཚོན་ཏེ་ཕར་ཕྱིན་གཞན་ཡང་བསྟན་ཏོ། ། དེ་བཞིན་གཤེགས་པས་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཞེས་གང་གསུངས་པ་དེ་ཉིད་དོན་དམ་པར་ཕ་རོལ་ཏུ་ཕྱིན་པར་གྲུབ་པ་མེད་ཅིང༌། དེས་ན་ཐ་སྙད་དུ་ཤེས་རབ་ཀྱི་རོལ་ཏུ་ཕྱིན་པ་ཞེས་འདོགས་སོ། །",
            "type": "source",
            "mapping": []
        },
        {
            "content": "འདིར་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་གང་གསུངས་པ་དེ་ཞེས་ཤེར་ཕྱིན་གསུངས་པར་བཤད་པ་ན། འོ་ན་དེ་བཞིན་གཤེགས་པས་དོན་དམ་པར་གསུངས་པའི་ཆོས་གཞན་ཡོད་དམ་སྙམ་པ་ན། དེ་མེད་ཅེས་སྟོན་པ་ནི་ཆོས་དེ་གང་ཡང་ཡོད་སྙམ་མམ་ཞེས་དྲིས་པའི་ཚེ།",
            "type": "source",
            "mapping": []
        },
        {
            "content": "འདིར་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་གང་གསུངས་པ་དེ་ཞེས་ཤེར་ཕྱིན་གསུངས་པར་བཤད་པ་ན། འོ་ན་དེ་བཞིན་གཤེགས་པས་དོན་དམ་པར་གསུངས་པའི་ཆོས་གཞན་ཡོད་དམ་སྙམ་པ་ན། དེ་མེད་ཅེས་སྟོན་པ་ནི་ཆོས་དེ་གང་ཡང་ཡོད་སྙམ་མམ་ཞེས་དྲིས་པའི་ཚེ།",
            "type": "source",
            "mapping": []
        },
        {
            "content": "ལན་དུ་རབ་འབྱོར་གྱིས་དེ་བཞིན་གཤེགས་པས་གང་གསུངས་པའི་ཆོས་དེ་གང་ཡང་དོན་དམ་པར་མ་མཆིས་སོ་ཞེས་ལན་ཕུལ་ཏེ། སྔར་དེ་བཞིན་གཤེགས་པས་ཆོས་བསྟན་པ་མ་མཆིས་པར་གསུངས་པའི་དོན་བཤད་པ་དང་འདྲའོ། ། དེ་ནས་ཡང་དེ་རྡུལ་ཕྲ་རབ་དང་རྡུལ་ཕྲ་རབ་བསགས་པའི་འཇིག་རྟེན་གྱི་ཁམས་དོན་དམ་པར་མ་གྲུབ་ཞེས་སྟོན་པ་ནི། བཅོམ་ལྡན་འདས་ཀྱིས་རབ་འབྱོར་ལ་སྟོང་གསུམ་འཇིག་རྟེན་གྱི་ཁམས་ན་སའི་རྡུལ་ཇི་སྙེད་ཡོད་པ་དེ་མང་ངམ་ཞེས་དྲིས་པ་ན།",
            "type": "source",
            "mapping": []
        },
        {
            "content": "ལན་དུ་རབ་འབྱོར་གྱིས་དེ་བཞིན་གཤེགས་པས་གང་གསུངས་པའི་ཆོས་དེ་གང་ཡང་དོན་དམ་པར་མ་མཆིས་སོ་ཞེས་ལན་ཕུལ་ཏེ། སྔར་དེ་བཞིན་གཤེགས་པས་ཆོས་བསྟན་པ་མ་མཆིས་པར་གསུངས་པའི་དོན་བཤད་པ་དང་འདྲའོ། ། དེ་ནས་ཡང་དེ་རྡུལ་ཕྲ་རབ་དང་རྡུལ་ཕྲ་རབ་བསགས་པའི་འཇིག་རྟེན་གྱི་ཁམས་དོན་དམ་པར་མ་གྲུབ་ཞེས་སྟོན་པ་ནི། བཅོམ་ལྡན་འདས་ཀྱིས་རབ་འབྱོར་ལ་སྟོང་གསུམ་འཇིག་རྟེན་གྱི་ཁམས་ན་སའི་རྡུལ་ཇི་སྙེད་ཡོད་པ་དེ་མང་ངམ་ཞེས་དྲིས་པ་ན།",
            "type": "source",
            "mapping": []
        },
        {
            "content": "ལན་དུ་རབ་འབྱོར་གྱིས་དེ་བཞིན་གཤེགས་པས་གང་གསུངས་པའི་ཆོས་དེ་གང་ཡང་དོན་དམ་པར་མ་མཆིས་སོ་ཞེས་ལན་ཕུལ་ཏེ། སྔར་དེ་བཞིན་གཤེགས་པས་ཆོས་བསྟན་པ་མ་མཆིས་པར་གསུངས་པའི་དོན་བཤད་པ་དང་འདྲའོ། ། དེ་ནས་ཡང་དེ་རྡུལ་ཕྲ་རབ་དང་རྡུལ་ཕྲ་རབ་བསགས་པའི་འཇིག་རྟེན་གྱི་ཁམས་དོན་དམ་པར་མ་གྲུབ་ཞེས་སྟོན་པ་ནི། བཅོམ་ལྡན་འདས་ཀྱིས་རབ་འབྱོར་ལ་སྟོང་གསུམ་འཇིག་རྟེན་གྱི་ཁམས་ན་སའི་རྡུལ་ཇི་སྙེད་ཡོད་པ་དེ་མང་ངམ་ཞེས་དྲིས་པ་ན།",
            "type": "source",
            "mapping": []
        },
        {
            "content": "ལན་དུ་དེ་མང་ངོ་ཞེས་ཞུས་ཤིང༌། སའི་རྡུལ་ཕྲ་རབ་གང་ཡིན་པ་དེ་རྣམས་ནི་དོན་དམ་པར་རྡུལ་དུ་གྲུབ་པ་མ་མཆིས་པར་དེ་བཞིན་གཤེགས་པས་གསུངས་ཏེ། དོན་དམ་པར་མེད་ཅིང་ཐ་སྙད་དུ་ཡོད་པ་དེས་ན་སའི་རྡུལ་ཞེས་བགྱིའོ། ། དེས་ན་རྡུལ་ཕྲ་རབ་བསགས་པའི་འཇིག་རྟེན་གྱི་ཁམས་གང་ཡིན་པ་དེ་ཡང་དོན་དམ་པར་འཇིག་རྟེན་གྱི་ཁམས་སུ་གྲུབ་པ་མ་མཆིས་པར་དེ་བཞིན་གཤེགས་པས་གསུངས་པའི་སླད་དུ་སྟེ། དེས་ན་ཐ་སྙད་དུ་འཇིག་རྟེན་གྱི་ཁམས་ཞེས་བགྱིའོ། །",
            "type": "source",
            "mapping": []
        },
        {
            "content": "ལན་དུ་དེ་མང་ངོ་ཞེས་ཞུས་ཤིང༌། སའི་རྡུལ་ཕྲ་རབ་གང་ཡིན་པ་དེ་རྣམས་ནི་དོན་དམ་པར་རྡུལ་དུ་གྲུབ་པ་མ་མཆིས་པར་དེ་བཞིན་གཤེགས་པས་གསུངས་ཏེ། དོན་དམ་པར་མེད་ཅིང་ཐ་སྙད་དུ་ཡོད་པ་དེས་ན་སའི་རྡུལ་ཞེས་བགྱིའོ། ། དེས་ན་རྡུལ་ཕྲ་རབ་བསགས་པའི་འཇིག་རྟེན་གྱི་ཁམས་གང་ཡིན་པ་དེ་ཡང་དོན་དམ་པར་འཇིག་རྟེན་གྱི་ཁམས་སུ་གྲུབ་པ་མ་མཆིས་པར་དེ་བཞིན་གཤེགས་པས་གསུངས་པའི་སླད་དུ་སྟེ། དེས་ན་ཐ་སྙད་དུ་འཇིག་རྟེན་གྱི་ཁམས་ཞེས་བགྱིའོ། །",
            "type": "source",
            "mapping": []
        },
        {
            "content": "ལན་དུ་དེ་མང་ངོ་ཞེས་ཞུས་ཤིང༌། སའི་རྡུལ་ཕྲ་རབ་གང་ཡིན་པ་དེ་རྣམས་ནི་དོན་དམ་པར་རྡུལ་དུ་གྲུབ་པ་མ་མཆིས་པར་དེ་བཞིན་གཤེགས་པས་གསུངས་ཏེ། དོན་དམ་པར་མེད་ཅིང་ཐ་སྙད་དུ་ཡོད་པ་དེས་ན་སའི་རྡུལ་ཞེས་བགྱིའོ། ། དེས་ན་རྡུལ་ཕྲ་རབ་བསགས་པའི་འཇིག་རྟེན་གྱི་ཁམས་གང་ཡིན་པ་དེ་ཡང་དོན་དམ་པར་འཇིག་རྟེན་གྱི་ཁམས་སུ་གྲུབ་པ་མ་མཆིས་པར་དེ་བཞིན་གཤེགས་པས་གསུངས་པའི་སླད་དུ་སྟེ། དེས་ན་ཐ་སྙད་དུ་འཇིག་རྟེན་གྱི་ཁམས་ཞེས་བགྱིའོ། །",
            "type": "source",
            "mapping": []
        },
        {
            "content": "ལན་དུ་དེ་མང་ངོ་ཞེས་ཞུས་ཤིང༌། སའི་རྡུལ་ཕྲ་རབ་གང་ཡིན་པ་དེ་རྣམས་ནི་དོན་དམ་པར་རྡུལ་དུ་གྲུབ་པ་མ་མཆིས་པར་དེ་བཞིན་གཤེགས་པས་གསུངས་ཏེ། དོན་དམ་པར་མེད་ཅིང་ཐ་སྙད་དུ་ཡོད་པ་དེས་ན་སའི་རྡུལ་ཞེས་བགྱིའོ། ། དེས་ན་རྡུལ་ཕྲ་རབ་བསགས་པའི་འཇིག་རྟེན་གྱི་ཁམས་གང་ཡིན་པ་དེ་ཡང་དོན་དམ་པར་འཇིག་རྟེན་གྱི་ཁམས་སུ་གྲུབ་པ་མ་མཆིས་པར་དེ་བཞིན་གཤེགས་པས་གསུངས་པའི་སླད་དུ་སྟེ། དེས་ན་ཐ་སྙད་དུ་འཇིག་རྟེན་གྱི་ཁམས་ཞེས་བགྱིའོ། །",
            "type": "source",
            "mapping": []
        },
        {
            "content": "ལན་དུ་དེ་མང་ངོ་ཞེས་ཞུས་ཤིང༌། སའི་རྡུལ་ཕྲ་རབ་གང་ཡིན་པ་དེ་རྣམས་ནི་དོན་དམ་པར་རྡུལ་དུ་གྲུབ་པ་མ་མཆིས་པར་དེ་བཞིན་གཤེགས་པས་གསུངས་ཏེ། དོན་དམ་པར་མེད་ཅིང་ཐ་སྙད་དུ་ཡོད་པ་དེས་ན་སའི་རྡུལ་ཞེས་བགྱིའོ། ། དེས་ན་རྡུལ་ཕྲ་རབ་བསགས་པའི་འཇིག་རྟེན་གྱི་ཁམས་གང་ཡིན་པ་དེ་ཡང་དོན་དམ་པར་འཇིག་རྟེན་གྱི་ཁམས་སུ་གྲུབ་པ་མ་མཆིས་པར་དེ་བཞིན་གཤེགས་པས་གསུངས་པའི་སླད་དུ་སྟེ། དེས་ན་ཐ་སྙད་དུ་འཇིག་རྟེན་གྱི་ཁམས་ཞེས་བགྱིའོ། །",
            "type": "source",
            "mapping": []
        },
        {
            "content": "ལན་དུ་དེ་མང་ངོ་ཞེས་ཞུས་ཤིང༌། སའི་རྡུལ་ཕྲ་རབ་གང་ཡིན་པ་དེ་རྣམས་ནི་དོན་དམ་པར་རྡུལ་དུ་གྲུབ་པ་མ་མཆིས་པར་དེ་བཞིན་གཤེགས་པས་གསུངས་ཏེ། དོན་དམ་པར་མེད་ཅིང་ཐ་སྙད་དུ་ཡོད་པ་དེས་ན་སའི་རྡུལ་ཞེས་བགྱིའོ། ། དེས་ན་རྡུལ་ཕྲ་རབ་བསགས་པའི་འཇིག་རྟེན་གྱི་ཁམས་གང་ཡིན་པ་དེ་ཡང་དོན་དམ་པར་འཇིག་རྟེན་གྱི་ཁམས་སུ་གྲུབ་པ་མ་མཆིས་པར་དེ་བཞིན་གཤེགས་པས་གསུངས་པའི་སླད་དུ་སྟེ། དེས་ན་ཐ་སྙད་དུ་འཇིག་རྟེན་གྱི་ཁམས་ཞེས་བགྱིའོ། །",
            "type": "source",
            "mapping": []
        },
        {
            "content": "དེ་ནས་འཇིག་རྟེན་གྱི་ཁམས་སུ་མ་ཟད། སངས་རྒྱས་ཀྱི་གཟུགས་སྐུ་དང་དེའི་མཚན་དཔེ་ཡང་དོན་དམ་པར་མ་གྲུབ་ཅེས་པ་ནི། བཅོམ་ལྡན་འདས་ཀྱིས་རབ་འབྱོར་ལ་སྐྱེས་བུ་ཆེན་པོ་དེ་བཞིན་གཤེགས་པའི་མཚན་སུམ་ཅུ་རྩ་གཉིས་པོ་དེ་དག་ཚོགས་པའི་སྐུ་ཙམ་ཞིག་དེ་བཞིན་གཤེགས་པར་བལྟ་བ་སྟེ་གཟུང་བར་བྱ་སྙམ་མམ་ཞེས་དྲིས་པ་ན།",
            "type": "source",
            "mapping": []
        },
        {
            "content": "དེ་ནས་འཇིག་རྟེན་གྱི་ཁམས་སུ་མ་ཟད། སངས་རྒྱས་ཀྱི་གཟུགས་སྐུ་དང་དེའི་མཚན་དཔེ་ཡང་དོན་དམ་པར་མ་གྲུབ་ཅེས་པ་ནི། བཅོམ་ལྡན་འདས་ཀྱིས་རབ་འབྱོར་ལ་སྐྱེས་བུ་ཆེན་པོ་དེ་བཞིན་གཤེགས་པའི་མཚན་སུམ་ཅུ་རྩ་གཉིས་པོ་དེ་དག་ཚོགས་པའི་སྐུ་ཙམ་ཞིག་དེ་བཞིན་གཤེགས་པར་བལྟ་བ་སྟེ་གཟུང་བར་བྱ་སྙམ་མམ་ཞེས་དྲིས་པ་ན།",
            "type": "source",
            "mapping": []
        },
        {
            "content": "རབ་འབྱོར་གྱིས་དེ་མ་ལགས་ཏེ། རྒྱུ་མཚན་ནི་སྐྱེས་བུ་ཆེན་པོ་སངས་རྒྱས་ཀྱི་མཚན་སོ་གཉིས་པོ་གང་དག་དེ་བཞིན་གཤེགས་པས་ཐ་སྙད་དུ་ཡོད་པར་གསུངས་པ་དེ་དག་ནི་དོན་དམ་པར་མཚན་མ་མཆིས་པར་གསུངས་པའི་སླད་དུ་སྟེ་ཞེས་སྒྲོ་འདོགས་རྟག་མཐའ་བཀག་ཅིང༌། དེས་ན་ཐ་སྙད་དུ་དེ་དག་ལ་སྐྱེས་བུ་ཆེན་པོའི་མཚན་རྣམས་ཞེས་བྱའོ་ཞེས་པས་སྐུར་འདེབས་ཆད་མཐའ་བཀག་པ་འདི་ལྟ་བུ་གཞན་ལ་ཡང་འདྲའོ། ། མཚན་བསྟན་པའི་ཤུགས་ལ་དཔེ་བྱད་བརྒྱད་ཅུ་ཡང་བསྟན་ཏེ། དཔེ་བྱད་རྣམས་ནི་མཚན་གྱི་འཁོར་ཡིན་པའི་ཕྱིར་རོ། །",
            "type": "source",
            "mapping": []
        },
        {
            "content": "རབ་འབྱོར་གྱིས་དེ་མ་ལགས་ཏེ། རྒྱུ་མཚན་ནི་སྐྱེས་བུ་ཆེན་པོ་སངས་རྒྱས་ཀྱི་མཚན་སོ་གཉིས་པོ་གང་དག་དེ་བཞིན་གཤེགས་པས་ཐ་སྙད་དུ་ཡོད་པར་གསུངས་པ་དེ་དག་ནི་དོན་དམ་པར་མཚན་མ་མཆིས་པར་གསུངས་པའི་སླད་དུ་སྟེ་ཞེས་སྒྲོ་འདོགས་རྟག་མཐའ་བཀག་ཅིང༌། དེས་ན་ཐ་སྙད་དུ་དེ་དག་ལ་སྐྱེས་བུ་ཆེན་པོའི་མཚན་རྣམས་ཞེས་བྱའོ་ཞེས་པས་སྐུར་འདེབས་ཆད་མཐའ་བཀག་པ་འདི་ལྟ་བུ་གཞན་ལ་ཡང་འདྲའོ། ། མཚན་བསྟན་པའི་ཤུགས་ལ་དཔེ་བྱད་བརྒྱད་ཅུ་ཡང་བསྟན་ཏེ། དཔེ་བྱད་རྣམས་ནི་མཚན་གྱི་འཁོར་ཡིན་པའི་ཕྱིར་རོ། །",
            "type": "source",
            "mapping": []
        },
        {
            "content": "རབ་འབྱོར་གྱིས་དེ་མ་ལགས་ཏེ། རྒྱུ་མཚན་ནི་སྐྱེས་བུ་ཆེན་པོ་སངས་རྒྱས་ཀྱི་མཚན་སོ་གཉིས་པོ་གང་དག་དེ་བཞིན་གཤེགས་པས་ཐ་སྙད་དུ་ཡོད་པར་གསུངས་པ་དེ་དག་ནི་དོན་དམ་པར་མཚན་མ་མཆིས་པར་གསུངས་པའི་སླད་དུ་སྟེ་ཞེས་སྒྲོ་འདོགས་རྟག་མཐའ་བཀག་ཅིང༌། དེས་ན་ཐ་སྙད་དུ་དེ་དག་ལ་སྐྱེས་བུ་ཆེན་པོའི་མཚན་རྣམས་ཞེས་བྱའོ་ཞེས་པས་སྐུར་འདེབས་ཆད་མཐའ་བཀག་པ་འདི་ལྟ་བུ་གཞན་ལ་ཡང་འདྲའོ། ། མཚན་བསྟན་པའི་ཤུགས་ལ་དཔེ་བྱད་བརྒྱད་ཅུ་ཡང་བསྟན་ཏེ། དཔེ་བྱད་རྣམས་ནི་མཚན་གྱི་འཁོར་ཡིན་པའི་ཕྱིར་རོ། །",
            "type": "source",
            "mapping": []
        },
        {
            "content": "གཞུང་འདི་ལ་བརྟེན་ནས་དེ་ལྟར་དག་མ་དག་གི་ཆོས་ཐམས་ཅད་རང་བཞིན་གྱིས་སྟོང་པར་ཤེས་ཤིང་བསྒོམས་ན་ཕན་ཡོན་ཆེའོ་ཞེས་སྙོན་པ་ནི། བཅོམ་ལྡན་འདས་ཀྱིས་རབ་འབྱོར་ལ་གང་ཟག་གང་གིས་རང་གི་ལུས་ཀྱི་སྦྱིན་པ་གངྒཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་བཏང་བ་ལས་ཀྱང༌། ཆོས་ཀྱི་རྣམ་གྲགས་འདི་ལས་ཚིག་བཞི་པའི་ཚིགས་སུ་བཅད་པ་ཙམ་བཟུང་ཞིང་གཞན་དག་ལ་སྟོན་ཅིང་བསྒོམས་ན་བསོད་ནམས་ལྷག་པར་ཆེའོ་ཞེས་གསུངས་སོ། ། འདི་ནི་འཕགས་པ་ལྷས། བསོད་ནམས་ཆུང་ངུས་ཆོས་འདི་ལ། །ཐེ་ཚོམ་ཟ་བ་ཡང་མི་འགྱུར། །ཐེ་ཚོམ་ཟོས་པ་ཙམ་གྱིས་ཀྱང༌། སྲིད་པ་ཧྲུལ་པོར་བྱེད་པར་འགྱུར། །ཞེས་གསུངས་པ་ལྟ་བུའི་ཕན་ཡོན་འབྱུང་བ་ལ་ཡང་དགོངས་མོད། ཕྱིས་འབྱུང་གི་གདུལ་བྱ་བློ་དམན་དང་བ་དང་ལྡན་པ་རྣམས་ཕན་ཡོན་ལ་སྤྲོ་བ་སྐྱེས་ནས་གཞུང་ལ་ཐོས་བསམ་གྱིས་འཇུག་པའི་ཆེད་བསྔགས་བརྗོད་ཀྱི་ཚུལ་དུ། ཚིག་བཞི་པའི་ཚིགས་སུ་བཅད་པ་ཙམ་གཟུང་ཞིང་བརྗོད་ན་ཕན་ཡོན་རྒྱ་ཆེན་པོ་དེ་ལྟ་བུ་འབྱུང་བར་གསུངས་ཤིང་དགོངས་གཞི་དངོས་ནི་དེ་ལྟར་བསྟན་པའི་དོན་གྱི་ཤེར་ཕྱིན་ལས་དེ་ལྟ་བུའི་ཕན་ཡོན་རྫོགས་པར་ཐོབ་པར་འགྱུར་པ་ལ་དགོངས་ཀྱི། གཞུང་བཀླག་པ་ཙམ་ལས་དེ་ལྟ་བུའི་ཕན་ཡོན་གྱི་ཕྱོགས་གཅིག་ལས་རྫོགས་པར་མིན་ནོ། །ཚུལ་འདི་ནི་དེ་ལྟ་བུའི་སྐབས་གཞན་ལའང་ཤེས་དགོས་སོ། །",
            "type": "source",
            "mapping": []
        },
        {
            "content": "དེ་ལྟར་གསུངས་པ་ན་རབ་འབྱོར་གྱིས་ཆོས་ཟབ་མོ་འདི་ཐོས་ནས་ངོ་མཚར་སྐྱེས་པའི་ཤུགས་སྟོབས་ཀྱིས་ སྤྱན་ལས་མཆི་མ་ཕྱུང་སྟེ། རབ་འབྱོར་དེས་མཆི་མ་ཕྱིས་ནས་བཅོམ་ལྡན་འདས་ལ་ཤེར་ཕྱིན་གྱི་ཆོས་འདི་དེ་བཞིན་གཤེགས་པ་ཇི་སྙེད་བྱོན་ཅིང་བཞུགས་པ་ཐམས་ཅད་ཀྱིས་གསུངས་པ་ནི་ངོ་མཚར་ཆེའོ། །",
            "type": "source",
            "mapping": []
        },
        {
            "content": "དེ་ལྟར་གསུངས་པ་ན་རབ་འབྱོར་གྱིས་ཆོས་ཟབ་མོ་འདི་ཐོས་ནས་ངོ་མཚར་སྐྱེས་པའི་ཤུགས་སྟོབས་ཀྱིས་ སྤྱན་ལས་མཆི་མ་ཕྱུང་སྟེ། རབ་འབྱོར་དེས་མཆི་མ་ཕྱིས་ནས་བཅོམ་ལྡན་འདས་ལ་ཤེར་ཕྱིན་གྱི་ཆོས་འདི་དེ་བཞིན་གཤེགས་པ་ཇི་སྙེད་བྱོན་ཅིང་བཞུགས་པ་ཐམས་ཅད་ཀྱིས་གསུངས་པ་ནི་ངོ་མཚར་ཆེའོ། །",
            "type": "source",
            "mapping": []
        },
        {
            "content": "དེ་ལྟར་གསུངས་པ་ན་རབ་འབྱོར་གྱིས་ཆོས་ཟབ་མོ་འདི་ཐོས་ནས་ངོ་མཚར་སྐྱེས་པའི་ཤུགས་སྟོབས་ཀྱིས་ སྤྱན་ལས་མཆི་མ་ཕྱུང་སྟེ། རབ་འབྱོར་དེས་མཆི་མ་ཕྱིས་ནས་བཅོམ་ལྡན་འདས་ལ་ཤེར་ཕྱིན་གྱི་ཆོས་འདི་དེ་བཞིན་གཤེགས་པ་ཇི་སྙེད་བྱོན་ཅིང་བཞུགས་པ་ཐམས་ཅད་ཀྱིས་གསུངས་པ་ནི་ངོ་མཚར་ཆེའོ། ། \n\nརབ་འབྱོར་བདག་གིས་ནི་རང་ལ་འཕགས་པའི་ཡེ་ཤེས་སྐྱེས་ཚུན་ཆད་ནས་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་མ་ཐོས་ཤིང༌། དེར་མ་ཟད་སྔོན་ནམ་ཡང་འདི་མ་ཐོས་སོ་ཞེས་པ་ནི་རབ་འབྱོར་གྱིས་སྔོན་འདི་ལྟ་བུ་མ་ཐོས་པ་མ་ཡིན་གྱི། ཤེར་ཕྱིན་གྱི་ཆོས་ཟབ་མོ་འདི་ལྟ་བུ་གཞན་གྱིས་ཐོས་པར་དཀའ་བར་བསྟན་པའོ། །",
            "type": "source",
            "mapping": []
        },
        {
            "content": "རབ་འབྱོར་བདག་གིས་ནི་རང་ལ་འཕགས་པའི་ཡེ་ཤེས་སྐྱེས་ཚུན་ཆད་ནས་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་མ་ཐོས་ཤིང༌། དེར་མ་ཟད་སྔོན་ནམ་ཡང་འདི་མ་ཐོས་སོ་ཞེས་པ་ནི་རབ་འབྱོར་གྱིས་སྔོན་འདི་ལྟ་བུ་མ་ཐོས་པ་མ་ཡིན་གྱི། ཤེར་ཕྱིན་གྱི་ཆོས་ཟབ་མོ་འདི་ལྟ་བུ་གཞན་གྱིས་ཐོས་པར་དཀའ་བར་བསྟན་པའོ། །",
            "type": "source",
            "mapping": []
        },
        {
            "content": "ངོ་མཚར་ཆེ་ཚུལ་ནི། མདོ་སྡེ་འདི་བཤད་པའི་ཚིག་དང་དོན་ལ་སེམས་ཅན་གང་དག་བདེན་ཞེན་མེད་པ་ཡང་དག་པའི་འདུ་ཤེས་སྐྱེད་པར་འགྱུར་བའི་སེམས་ཅན་དེ་དག་ནི། ཐར་པའི་བག་ཆགས་འཇོག་ཅིང་སངས་རྒྱས་ཐོབ་པའི་རྒྱུ་ཆེན་པོ་བཟུང་བས་ན་ངོ་མཚར་ཆེན་པོ་རབ་དང་ལྡན་པར་འགྱུར་རོ། ། ཡང་དག་པའི་འདུ་ཤེས་ཞེས་བཤད་པ་གང་ཡིན་པ་དེ་ནི་བདེན་པར་ཞེན་པའི་འདུ་ཤེས་མ་མཆིས་པའི་སླད་དུ་སྟེ། དེས་ན་བདེན་ཞེན་མེད་ཅིང་བདེན་མེད་རྟོགས་པའི་འདུ་ཤེས་དེ་ལ་ཡང་དག་པའི་འདུ་ཤེས་ཞེས་དེ་བཞིན་གཤེགས་པས་གསུངས་སོ། །",
            "type": "source",
            "mapping": []
        },
        {
            "content": "ངོ་མཚར་ཆེ་ཚུལ་ནི། མདོ་སྡེ་འདི་བཤད་པའི་ཚིག་དང་དོན་ལ་སེམས་ཅན་གང་དག་བདེན་ཞེན་མེད་པ་ཡང་དག་པའི་འདུ་ཤེས་སྐྱེད་པར་འགྱུར་བའི་སེམས་ཅན་དེ་དག་ནི། ཐར་པའི་བག་ཆགས་འཇོག་ཅིང་སངས་རྒྱས་ཐོབ་པའི་རྒྱུ་ཆེན་པོ་བཟུང་བས་ན་ངོ་མཚར་ཆེན་པོ་རབ་དང་ལྡན་པར་འགྱུར་རོ། ། ཡང་དག་པའི་འདུ་ཤེས་ཞེས་བཤད་པ་གང་ཡིན་པ་དེ་ནི་བདེན་པར་ཞེན་པའི་འདུ་ཤེས་མ་མཆིས་པའི་སླད་དུ་སྟེ། དེས་ན་བདེན་ཞེན་མེད་ཅིང་བདེན་མེད་རྟོགས་པའི་འདུ་ཤེས་དེ་ལ་ཡང་དག་པའི་འདུ་ཤེས་ཞེས་དེ་བཞིན་གཤེགས་པས་གསུངས་སོ། །",
            "type": "source",
            "mapping": []
        },
        {
            "content": "ངོ་མཚར་ཆེ་ཚུལ་ནི། མདོ་སྡེ་འདི་བཤད་པའི་ཚིག་དང་དོན་ལ་སེམས་ཅན་གང་དག་བདེན་ཞེན་མེད་པ་ཡང་དག་པའི་འདུ་ཤེས་སྐྱེད་པར་འགྱུར་བའི་སེམས་ཅན་དེ་དག་ནི། ཐར་པའི་བག་ཆགས་འཇོག་ཅིང་སངས་རྒྱས་ཐོབ་པའི་རྒྱུ་ཆེན་པོ་བཟུང་བས་ན་ངོ་མཚར་ཆེན་པོ་རབ་དང་ལྡན་པར་འགྱུར་རོ། ། ཡང་དག་པའི་འདུ་ཤེས་ཞེས་བཤད་པ་གང་ཡིན་པ་དེ་ནི་བདེན་པར་ཞེན་པའི་འདུ་ཤེས་མ་མཆིས་པའི་སླད་དུ་སྟེ། དེས་ན་བདེན་ཞེན་མེད་ཅིང་བདེན་མེད་རྟོགས་པའི་འདུ་ཤེས་དེ་ལ་ཡང་དག་པའི་འདུ་ཤེས་ཞེས་དེ་བཞིན་གཤེགས་པས་གསུངས་སོ། །",
            "type": "source",
            "mapping": []
        },
        {
            "content": "བཅོམ་ལྡན་འདས་བདག་ཆོས་འདི་བཤད་པའི་དོན་ལ་དད་པས་རྟོག་ཅིང་ཤེས་ནས་མོས་པ་སྐྱེས་པ་འདི་ནི། བདག་ལ་ངོ་མཚར་ཆེན་པོ་བྱུང་བ་མ་ལགས་ཀྱི། སླད་མའི་དུས་སུ་སེམས་ཅན་གང་དག་སྟོང་ཉིད་ཀྱི་དོན་ལ་མོས་ཤིང་ཆོས་འདི་ལེན་པ་སོགས་བྱེད་པ་དེ་དག་ནི་ངོ་མཚར་ཆེན་པོ་རབ་དང་ལྡན་པར་འགྱུར་ལགས་སོ། །ཚུལ་འདི་ངོ་མཚར་ཆེ་སྟེ། མགོན་པོ་ཀླུ་སྒྲུབ་ཞབས་ཀྱིས། ཆོས་རྣམས་སྟོང་པ་འདི་ཤེས་ནས། །ལས་དང་འབྲས་བུ་བསྟན་པ་གང༌། །ངོ་མཚར་བས་ཀྱང་འདི་ངོ་མཚར། །རྨད་བྱུང་བས་ཀྱང་འདི་རྨད་བྱུང༌། །ཞེས་གསུངས་པ་ལྟར་རོ། ། གཞན་གྱི་དོན་སྔར་བཤད་ཟིན་ཅིང༌། འདྲི་བ་ལ་ནི་ད་འདྲི་འབྱུང་བ་ལྟར་ན་དོན་གཞན་ལ་འདྲི་བ་དང༌། བ་འབྲི་འབྱུང་བ་ལྟར་ན་ཡི་གེར་འབྲི་བ་དང་སྦྱོར་ཏེ། འོན་ཀྱང་དབུ་མཐའ་ལས། ཡི་གེ་འབྲི་མཆོད་སྦྱིན་པ་དང༌། །ཞེས་འབྱུང་བ་ལྟར་ན་ཕྱི་མའོ། །གཞུང་འདི་དག་གིས་ནི་ཇི་ལྟར་གནས་པ་དང་སྒྲུབ་པ་དང་གཟུང་བར་བྱ་བའི་ཚུལ་བསྟན་ཏོ། །",
            "type": "source",
            "mapping": []
        },
        {
            "content": "བཅོམ་ལྡན་འདས་བདག་ཆོས་འདི་བཤད་པའི་དོན་ལ་དད་པས་རྟོག་ཅིང་ཤེས་ནས་མོས་པ་སྐྱེས་པ་འདི་ནི། བདག་ལ་ངོ་མཚར་ཆེན་པོ་བྱུང་བ་མ་ལགས་ཀྱི། སླད་མའི་དུས་སུ་སེམས་ཅན་གང་དག་སྟོང་ཉིད་ཀྱི་དོན་ལ་མོས་ཤིང་ཆོས་འདི་ལེན་པ་སོགས་བྱེད་པ་དེ་དག་ནི་ངོ་མཚར་ཆེན་པོ་རབ་དང་ལྡན་པར་འགྱུར་ལགས་སོ། །ཚུལ་འདི་ངོ་མཚར་ཆེ་སྟེ། མགོན་པོ་ཀླུ་སྒྲུབ་ཞབས་ཀྱིས། ཆོས་རྣམས་སྟོང་པ་འདི་ཤེས་ནས། །ལས་དང་འབྲས་བུ་བསྟན་པ་གང༌། །ངོ་མཚར་བས་ཀྱང་འདི་ངོ་མཚར། །རྨད་བྱུང་བས་ཀྱང་འདི་རྨད་བྱུང༌། །ཞེས་གསུངས་པ་ལྟར་རོ། ། གཞན་གྱི་དོན་སྔར་བཤད་ཟིན་ཅིང༌། འདྲི་བ་ལ་ནི་ད་འདྲི་འབྱུང་བ་ལྟར་ན་དོན་གཞན་ལ་འདྲི་བ་དང༌། བ་འབྲི་འབྱུང་བ་ལྟར་ན་ཡི་གེར་འབྲི་བ་དང་སྦྱོར་ཏེ། འོན་ཀྱང་དབུ་མཐའ་ལས། ཡི་གེ་འབྲི་མཆོད་སྦྱིན་པ་དང༌། །ཞེས་འབྱུང་བ་ལྟར་ན་ཕྱི་མའོ། །གཞུང་འདི་དག་གིས་ནི་ཇི་ལྟར་གནས་པ་དང་སྒྲུབ་པ་དང་གཟུང་བར་བྱ་བའི་ཚུལ་བསྟན་ཏོ། །",
            "type": "source",
            "mapping": []
        },
        {
            "content": "མ་འོངས་པའི་དུས་ན་གཞུང་འདི་ལྟ་བུ་ལ་ཐོས་བསམ་བསྒོམས་པས་འཇུག་པའི་སེམས་ཅན་དེ་དག་ལ་ནི། གང་ཟག་གི་བདག་ཏུ་འདུ་ཤེས་རགས་པ་འཇུག་པར་མི་འགྱུར་ཞིང༌། དེ་བཞིན་དུ་སེམས་ཅན་དང་སྲོག་དང་གང་ཟག་ཏུ་བདེན་ཞེན་གྱི་འདུ་ཤེས་ཅི་རིགས་འཇུག་པ་སྟེ་སྐྱེ་བར་མི་འགྱུར་རོ། །",
            "type": "source",
            "mapping": []
        },
        {
            "content": "མ་འོངས་པའི་དུས་ན་གཞུང་འདི་ལྟ་བུ་ལ་ཐོས་བསམ་བསྒོམས་པས་འཇུག་པའི་སེམས་ཅན་དེ་དག་ལ་ནི། གང་ཟག་གི་བདག་ཏུ་འདུ་ཤེས་རགས་པ་འཇུག་པར་མི་འགྱུར་ཞིང༌། དེ་བཞིན་དུ་སེམས་ཅན་དང་སྲོག་དང་གང་ཟག་ཏུ་བདེན་ཞེན་གྱི་འདུ་ཤེས་ཅི་རིགས་འཇུག་པ་སྟེ་སྐྱེ་བར་མི་འགྱུར་རོ། །",
            "type": "source",
            "mapping": []
        },
        {
            "content": "རྒྱུ་མཚན་ནི་དེ་ལྟ་བུའི་བདག་ཏུ་འདུ་ཤེས་པ་སོགས་ནི་ཞེན་ཡུལ་ལ་ཕྱིན་ཅི་ལོག་ཏུ་ཞུགས་པ་ཡིན་པས། དེ་ཉིད་ཡང་དག་པའི་འདུ་ཤེས་ཐམས་ཅད་དང་བྲལ་བའི་ཕྱིར་རམ། འདུ་ཤེས་དག་དོན་དམ་པར་འདུ་ཤེས་སུ་གྲུབ་པ་དང་བྲལ་བའི་ཕྱིར་ཞེས་པའོ་ཞུས་པ་ན། བཅོམ་ལྡན་འདས་ཀྱིས་རབ་འབྱོར་ལ་དེ་དེ་བཞིན་ནོ་ཞེས་པ་དང༌།",
            "type": "source",
            "mapping": []
        },
        {
            "content": "རྒྱུ་མཚན་ནི། མ་འོངས་པ་ན་སེམས་ཅན་གང་དག་མདོ་སྡེ་འདི་བཤད་པའི་ཚིག་དོན་ཐོས་པ་ན། དེ་ལྟར་ཐམས་ཅད་བདེན་པར་མེད་ན་ལས་འབྲས་སོགས་བྱ་བྱེད་མི་འཐད་ཅིང་མེད་པར་འགྱུར་རོ་སྙམ་དུ་ཡིད་མི་སྐྲག་ཅིང་མི་དངང་ལ། ཤིན་ཏུ་དངང་བར་མི་འགྱུར་ཞིང་ཡིད་ཆེས་ཏེ་མོས་པ་དེ་དག་ནི་ངོ་མཚར་རབ་དང་ལྡན་པར་འགྱུར་རོ། །",
            "type": "source",
            "mapping": []
        },
        {
            "content": "རྒྱུ་མཚན་ནི། མ་འོངས་པ་ན་སེམས་ཅན་གང་དག་མདོ་སྡེ་འདི་བཤད་པའི་ཚིག་དོན་ཐོས་པ་ན། དེ་ལྟར་ཐམས་ཅད་བདེན་པར་མེད་ན་ལས་འབྲས་སོགས་བྱ་བྱེད་མི་འཐད་ཅིང་མེད་པར་འགྱུར་རོ་སྙམ་དུ་ཡིད་མི་སྐྲག་ཅིང་མི་དངང་ལ། ཤིན་ཏུ་དངང་བར་མི་འགྱུར་ཞིང་ཡིད་ཆེས་ཏེ་མོས་པ་དེ་དག་ནི་ངོ་མཚར་རབ་དང་ལྡན་པར་འགྱུར་རོ། །",
            "type": "source",
            "mapping": []
        },
        {
            "content": "རྒྱུ་མཚན་ནི། མ་འོངས་པ་ན་སེམས་ཅན་གང་དག་མདོ་སྡེ་འདི་བཤད་པའི་ཚིག་དོན་ཐོས་པ་ན། དེ་ལྟར་ཐམས་ཅད་བདེན་པར་མེད་ན་ལས་འབྲས་སོགས་བྱ་བྱེད་མི་འཐད་ཅིང་མེད་པར་འགྱུར་རོ་སྙམ་དུ་ཡིད་མི་སྐྲག་ཅིང་མི་དངང་ལ། ཤིན་ཏུ་དངང་བར་མི་འགྱུར་ཞིང་ཡིད་ཆེས་ཏེ་མོས་པ་དེ་དག་ནི་ངོ་མཚར་རབ་དང་ལྡན་པར་འགྱུར་རོ། །",
            "type": "source",
            "mapping": []
        },
        {
            "content": "རྒྱུ་མཚན་ནི། མ་འོངས་པ་ན་སེམས་ཅན་གང་དག་མདོ་སྡེ་འདི་བཤད་པའི་ཚིག་དོན་ཐོས་པ་ན། དེ་ལྟར་ཐམས་ཅད་བདེན་པར་མེད་ན་ལས་འབྲས་སོགས་བྱ་བྱེད་མི་འཐད་ཅིང་མེད་པར་འགྱུར་རོ་སྙམ་དུ་ཡིད་མི་སྐྲག་ཅིང་མི་དངང་ལ། ཤིན་ཏུ་དངང་བར་མི་འགྱུར་ཞིང་ཡིད་ཆེས་ཏེ་མོས་པ་དེ་དག་ནི་ངོ་མཚར་རབ་དང་ལྡན་པར་འགྱུར་རོ། །",
            "type": "source",
            "mapping": []
        },
        {
            "content": "ངོ་མཚར་ཆེ་བའི་རྒྱུ་མཚན་ནི། ཆོས་ཀུན་རང་བཞིན་གྱིས་མ་གྲུབ་པར་སྟོན་པའི་གཞུང་ཕ་རོལ་ཏུ་ཕྱིན་པ་དམ་པ་མཆོག་འདི་ནི་ད་ལྟ་དེ་བཞིན་གཤེགས་པ་ངས་གསུངས་ཏེ། སྔོན་སངས་རྒྱས་བཅོམ་ལྡན་འདས་དཔག་ཏུ་མེད་པ་རྣམས་ཀྱིས་གསུངས་པའི་ཕྱིར་རོ། ། དེ་ནི་གོང་དུ་རྒྱུ་འབྲས་ཀྱི་ཆོས་རྣམས་རང་བཞིན་གྱིས་མེད་པར་བཤད་པ་ལ་ཡིད་ཆེས་པའི་གནས་སུ་འཛིན་པའི་ཆེད་དུ་གསུངས་པའོ། །རྒྱུ་མཚན་དེས་ན་ཕ་རོལ་ཏུ་ཕྱིན་པ་དམ་པ་ཞེས་བྱའོ། །",
            "type": "source",
            "mapping": []
        },
        {
            "content": "ངོ་མཚར་ཆེ་བའི་རྒྱུ་མཚན་ནི། ཆོས་ཀུན་རང་བཞིན་གྱིས་མ་གྲུབ་པར་སྟོན་པའི་གཞུང་ཕ་རོལ་ཏུ་ཕྱིན་པ་དམ་པ་མཆོག་འདི་ནི་ད་ལྟ་དེ་བཞིན་གཤེགས་པ་ངས་གསུངས་ཏེ། སྔོན་སངས་རྒྱས་བཅོམ་ལྡན་འདས་དཔག་ཏུ་མེད་པ་རྣམས་ཀྱིས་གསུངས་པའི་ཕྱིར་རོ། ། དེ་ནི་གོང་དུ་རྒྱུ་འབྲས་ཀྱི་ཆོས་རྣམས་རང་བཞིན་གྱིས་མེད་པར་བཤད་པ་ལ་ཡིད་ཆེས་པའི་གནས་སུ་འཛིན་པའི་ཆེད་དུ་གསུངས་པའོ། །རྒྱུ་མཚན་དེས་ན་ཕ་རོལ་ཏུ་ཕྱིན་པ་དམ་པ་ཞེས་བྱའོ། །",
            "type": "source",
            "mapping": []
        },
        {
            "content": "ངོ་མཚར་ཆེ་བའི་རྒྱུ་མཚན་ནི། ཆོས་ཀུན་རང་བཞིན་གྱིས་མ་གྲུབ་པར་སྟོན་པའི་གཞུང་ཕ་རོལ་ཏུ་ཕྱིན་པ་དམ་པ་མཆོག་འདི་ནི་ད་ལྟ་དེ་བཞིན་གཤེགས་པ་ངས་གསུངས་ཏེ། སྔོན་སངས་རྒྱས་བཅོམ་ལྡན་འདས་དཔག་ཏུ་མེད་པ་རྣམས་ཀྱིས་གསུངས་པའི་ཕྱིར་རོ། ། དེ་ནི་གོང་དུ་རྒྱུ་འབྲས་ཀྱི་ཆོས་རྣམས་རང་བཞིན་གྱིས་མེད་པར་བཤད་པ་ལ་ཡིད་ཆེས་པའི་གནས་སུ་འཛིན་པའི་ཆེད་དུ་གསུངས་པའོ། །རྒྱུ་མཚན་དེས་ན་ཕ་རོལ་ཏུ་ཕྱིན་པ་དམ་པ་ཞེས་བྱའོ། །",
            "type": "source",
            "mapping": []
        },
        {
            "content": "དེ་ནས་བཟོད་པའི་ཕར་ཕྱིན་སྒོས་སུ་འཆད་པ་ནི། རབ་འབྱོར་བཟོད་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཞེས་གང་གསུངས་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དེ་ཉིད་དོན་དམ་པར་མེད་པས་གང་གིས་བཟོད་པ་དང་ཇི་ལྟར་རམ་གང་བཟོད་པ་དང༌། གང་ལ་བཟོད་པའི་འཁོར་གསུམ་ལ་བདེན་ཞེན་གྱིས་གཟུང་བར་བྱར་མི་རུང་སྟེ། རྒྱུ་མཚན་ནི་རབ་འབྱོར་སྔོན་གྱི་དུས་གང་གི་ཚེ་ཀ་ལིངྐའི་རྒྱལ་པོས་ང་ཁོ་རང་གི་བུད་མེད་དང་འབྲེལ་ལམ་སྙམ་པའི་དོགས་ངན་བྱུང་སྟེ་རལ་གྲིས་ངའི་ཡན་ལག་དང་ཉིང་ལག་སོར་མོ་རྣམས་བཅད་པར་གྱུར་པ་དེའི་ཚེ། ངས་བཟོད་པའི་འཁོར་གསུམ་བདེན་མེད་དུ་ཤེས་ནས་བཟོད་པ་བསྒོམས་པས། ཐ་སྙད་པའི་ང་ལ་དམིགས་ནས་ངའོ་སྙམ་དུ་བདག་ཏུ་བདེན་པར་ཞེན་པའི་འདུ་ཤེས་ནས་གང་ཟག་ཏུ་བདེན་པར་ཞེན་པའི་འདུ་ཤེས་ཀྱང་མ་བྱུང་ཞིང༌། དེའི་ཚེ་ང་ལ་དེ་ལྟ་བུའི་བདེན་ཞེན་གྱི་འདུ་ཤེས་ཅི་ཡང་མེད་ལ། ཐ་སྙད་དུ་འདུ་ཤེས་གཞན་མེད་པར་གྱུར་པ་ཡང་མ་ཡིན་ཏེ།བཟོད་དོ་སྙམ་པའི་སྡུག་བསྔལ་དང་ལེན་དང་གནོད་པ་ལ་ཇི་མི་སྙམ་པ་དང༌། བདེན་མེད་དུ་རྟོགས་པའི་ཆོས་ལ་ངེས་སེམས་ཀྱི་འདུ་ཤེས་རྣམས་ཡོད་པའི་ཕྱིར་རོ་སྙམ་དུ་དགོངས་སོ། །",
            "type": "source",
            "mapping": []
        },
        {
            "content": "དེ་ནས་བཟོད་པའི་ཕར་ཕྱིན་སྒོས་སུ་འཆད་པ་ནི། རབ་འབྱོར་བཟོད་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཞེས་གང་གསུངས་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དེ་ཉིད་དོན་དམ་པར་མེད་པས་གང་གིས་བཟོད་པ་དང་ཇི་ལྟར་རམ་གང་བཟོད་པ་དང༌། གང་ལ་བཟོད་པའི་འཁོར་གསུམ་ལ་བདེན་ཞེན་གྱིས་གཟུང་བར་བྱར་མི་རུང་སྟེ། རྒྱུ་མཚན་ནི་རབ་འབྱོར་སྔོན་གྱི་དུས་གང་གི་ཚེ་ཀ་ལིངྐའི་རྒྱལ་པོས་ང་ཁོ་རང་གི་བུད་མེད་དང་འབྲེལ་ལམ་སྙམ་པའི་དོགས་ངན་བྱུང་སྟེ་རལ་གྲིས་ངའི་ཡན་ལག་དང་ཉིང་ལག་སོར་མོ་རྣམས་བཅད་པར་གྱུར་པ་དེའི་ཚེ། ངས་བཟོད་པའི་འཁོར་གསུམ་བདེན་མེད་དུ་ཤེས་ནས་བཟོད་པ་བསྒོམས་པས། ཐ་སྙད་པའི་ང་ལ་དམིགས་ནས་ངའོ་སྙམ་དུ་བདག་ཏུ་བདེན་པར་ཞེན་པའི་འདུ་ཤེས་ནས་གང་ཟག་ཏུ་བདེན་པར་ཞེན་པའི་འདུ་ཤེས་ཀྱང་མ་བྱུང་ཞིང༌། དེའི་ཚེ་ང་ལ་དེ་ལྟ་བུའི་བདེན་ཞེན་གྱི་འདུ་ཤེས་ཅི་ཡང་མེད་ལ། ཐ་སྙད་དུ་འདུ་ཤེས་གཞན་མེད་པར་གྱུར་པ་ཡང་མ་ཡིན་ཏེ།བཟོད་དོ་སྙམ་པའི་སྡུག་བསྔལ་དང་ལེན་དང་གནོད་པ་ལ་ཇི་མི་སྙམ་པ་དང༌། བདེན་མེད་དུ་རྟོགས་པའི་ཆོས་ལ་ངེས་སེམས་ཀྱི་འདུ་ཤེས་རྣམས་ཡོད་པའི་ཕྱིར་རོ་སྙམ་དུ་དགོངས་སོ། །",
            "type": "source",
            "mapping": []
        },
        {
            "content": "དེ་ནས་བཟོད་པའི་ཕར་ཕྱིན་སྒོས་སུ་འཆད་པ་ནི། རབ་འབྱོར་བཟོད་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཞེས་གང་གསུངས་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དེ་ཉིད་དོན་དམ་པར་མེད་པས་གང་གིས་བཟོད་པ་དང་ཇི་ལྟར་རམ་གང་བཟོད་པ་དང༌། གང་ལ་བཟོད་པའི་འཁོར་གསུམ་ལ་བདེན་ཞེན་གྱིས་གཟུང་བར་བྱར་མི་རུང་སྟེ། རྒྱུ་མཚན་ནི་རབ་འབྱོར་སྔོན་གྱི་དུས་གང་གི་ཚེ་ཀ་ལིངྐའི་རྒྱལ་པོས་ང་ཁོ་རང་གི་བུད་མེད་དང་འབྲེལ་ལམ་སྙམ་པའི་དོགས་ངན་བྱུང་སྟེ་རལ་གྲིས་ངའི་ཡན་ལག་དང་ཉིང་ལག་སོར་མོ་རྣམས་བཅད་པར་གྱུར་པ་དེའི་ཚེ། ངས་བཟོད་པའི་འཁོར་གསུམ་བདེན་མེད་དུ་ཤེས་ནས་བཟོད་པ་བསྒོམས་པས། ཐ་སྙད་པའི་ང་ལ་དམིགས་ནས་ངའོ་སྙམ་དུ་བདག་ཏུ་བདེན་པར་ཞེན་པའི་འདུ་ཤེས་ནས་གང་ཟག་ཏུ་བདེན་པར་ཞེན་པའི་འདུ་ཤེས་ཀྱང་མ་བྱུང་ཞིང༌། དེའི་ཚེ་ང་ལ་དེ་ལྟ་བུའི་བདེན་ཞེན་གྱི་འདུ་ཤེས་ཅི་ཡང་མེད་ལ། ཐ་སྙད་དུ་འདུ་ཤེས་གཞན་མེད་པར་གྱུར་པ་ཡང་མ་ཡིན་ཏེ།བཟོད་དོ་སྙམ་པའི་སྡུག་བསྔལ་དང་ལེན་དང་གནོད་པ་ལ་ཇི་མི་སྙམ་པ་དང༌། བདེན་མེད་དུ་རྟོགས་པའི་ཆོས་ལ་ངེས་སེམས་ཀྱི་འདུ་ཤེས་རྣམས་ཡོད་པའི་ཕྱིར་རོ་སྙམ་དུ་དགོངས་སོ། །",
            "type": "source",
            "mapping": []
        },
        {
            "content": "རྒྱུ་མཚན་ནི་གལ་ཏེ་དུས་དེའི་ཚེ་ང་ལ་ངའོ་སྙམ་དུ་དོན་དམ་པར་བདག་ཏུ་འདུ་ཤེས་པ་སོགས་ཡོད་ན་ནི་དེའི་ཚེ་གཞན་ལ་གནོད་སེམས་ཀྱི་འདུ་ཤེས་ཀྱང་འབྱུང་བར་འགྱུར་ན་དེ་མ་བྱུང་བའི་ཕྱིར་རོ་ཞེས་སོ། དེར་མ་ཟད། ངས་མངོན་པར་ཤེས་ཤིང་མཁྱེན་ཏེ། ང་སྔོན་ཚེ་རབས་ལྔ་བརྒྱར་བཟོད་པ་སྨྲ་བ་ཞེས་བྱ་བའི་དྲང་སྲོང་དུ་གྱུར་པའི་དུས་སུ་རྐྱེན་དེ་ལྟ་བུ་ལ་བརྟེན་ནས་གཞན་གྱིས་ངའི་ཡན་ལག་སོགས་བཅད་པ་ན་བདག་ཏུ་འདུ་ཤེས་སོགས་མ་བྱུང་ངོ༌། ། ཏེ་ཡན་ལག་བཅད་པའི་དུས་ཀྱི་ང་དེ་སྟོན་པ་མིན་ཞིང༌། སྟོན་པ་ཡང་དེའི་དུས་ཀྱི་ང་དེ་མིན་པས། སྟོན་པས་ངའི་ཡན་ལག་རྣམས་གསུངས་པ་དེ་ཇི་ལྟར་འཐད་སྙམ་ན། བདེན་མོད། འདིའི་ལན་ཞིབ་ཏུ་བཤད་ན་མང་དུ་འགྱུར་བས། བསྡུས་ན་དེ་ནི་རྒྱུད་གཅིག་པ་ལ་དགོངས་ཤིང་སྐྱོན་མེད་ཚུལ་གོང་དུ་ཅུང་ཟད་བཤད་ཅིང་འཆད་པར་བྱའོ། །",
            "type": "source",
            "mapping": []
        },
        {
            "content": "རྒྱུ་མཚན་ནི་གལ་ཏེ་དུས་དེའི་ཚེ་ང་ལ་ངའོ་སྙམ་དུ་དོན་དམ་པར་བདག་ཏུ་འདུ་ཤེས་པ་སོགས་ཡོད་ན་ནི་དེའི་ཚེ་གཞན་ལ་གནོད་སེམས་ཀྱི་འདུ་ཤེས་ཀྱང་འབྱུང་བར་འགྱུར་ན་དེ་མ་བྱུང་བའི་ཕྱིར་རོ་ཞེས་སོ། དེར་མ་ཟད། ངས་མངོན་པར་ཤེས་ཤིང་མཁྱེན་ཏེ། ང་སྔོན་ཚེ་རབས་ལྔ་བརྒྱར་བཟོད་པ་སྨྲ་བ་ཞེས་བྱ་བའི་དྲང་སྲོང་དུ་གྱུར་པའི་དུས་སུ་རྐྱེན་དེ་ལྟ་བུ་ལ་བརྟེན་ནས་གཞན་གྱིས་ངའི་ཡན་ལག་སོགས་བཅད་པ་ན་བདག་ཏུ་འདུ་ཤེས་སོགས་མ་བྱུང་ངོ༌། ། ཏེ་ཡན་ལག་བཅད་པའི་དུས་ཀྱི་ང་དེ་སྟོན་པ་མིན་ཞིང༌། སྟོན་པ་ཡང་དེའི་དུས་ཀྱི་ང་དེ་མིན་པས། སྟོན་པས་ངའི་ཡན་ལག་རྣམས་གསུངས་པ་དེ་ཇི་ལྟར་འཐད་སྙམ་ན། བདེན་མོད། འདིའི་ལན་ཞིབ་ཏུ་བཤད་ན་མང་དུ་འགྱུར་བས། བསྡུས་ན་དེ་ནི་རྒྱུད་གཅིག་པ་ལ་དགོངས་ཤིང་སྐྱོན་མེད་ཚུལ་གོང་དུ་ཅུང་ཟད་བཤད་ཅིང་འཆད་པར་བྱའོ། །",
            "type": "source",
            "mapping": []
        },
        {
            "content": "རྒྱུ་མཚན་ནི་གལ་ཏེ་དུས་དེའི་ཚེ་ང་ལ་ངའོ་སྙམ་དུ་དོན་དམ་པར་བདག་ཏུ་འདུ་ཤེས་པ་སོགས་ཡོད་ན་ནི་དེའི་ཚེ་གཞན་ལ་གནོད་སེམས་ཀྱི་འདུ་ཤེས་ཀྱང་འབྱུང་བར་འགྱུར་ན་དེ་མ་བྱུང་བའི་ཕྱིར་རོ་ཞེས་སོ། དེར་མ་ཟད། ངས་མངོན་པར་ཤེས་ཤིང་མཁྱེན་ཏེ། ང་སྔོན་ཚེ་རབས་ལྔ་བརྒྱར་བཟོད་པ་སྨྲ་བ་ཞེས་བྱ་བའི་དྲང་སྲོང་དུ་གྱུར་པའི་དུས་སུ་རྐྱེན་དེ་ལྟ་བུ་ལ་བརྟེན་ནས་གཞན་གྱིས་ངའི་ཡན་ལག་སོགས་བཅད་པ་ན་བདག་ཏུ་འདུ་ཤེས་སོགས་མ་བྱུང་ངོ༌། ། ཏེ་ཡན་ལག་བཅད་པའི་དུས་ཀྱི་ང་དེ་སྟོན་པ་མིན་ཞིང༌། སྟོན་པ་ཡང་དེའི་དུས་ཀྱི་ང་དེ་མིན་པས། སྟོན་པས་ངའི་ཡན་ལག་རྣམས་གསུངས་པ་དེ་ཇི་ལྟར་འཐད་སྙམ་ན། བདེན་མོད། འདིའི་ལན་ཞིབ་ཏུ་བཤད་ན་མང་དུ་འགྱུར་བས། བསྡུས་ན་དེ་ནི་རྒྱུད་གཅིག་པ་ལ་དགོངས་ཤིང་སྐྱོན་མེད་ཚུལ་གོང་དུ་ཅུང་ཟད་བཤད་ཅིང་འཆད་པར་བྱའོ། །",
            "type": "source",
            "mapping": []
        },
        {
            "content": "རྒྱུ་མཚན་ནི་གལ་ཏེ་དུས་དེའི་ཚེ་ང་ལ་ངའོ་སྙམ་དུ་དོན་དམ་པར་བདག་ཏུ་འདུ་ཤེས་པ་སོགས་ཡོད་ན་ནི་དེའི་ཚེ་གཞན་ལ་གནོད་སེམས་ཀྱི་འདུ་ཤེས་ཀྱང་འབྱུང་བར་འགྱུར་ན་དེ་མ་བྱུང་བའི་ཕྱིར་རོ་ཞེས་སོ། དེར་མ་ཟད། ངས་མངོན་པར་ཤེས་ཤིང་མཁྱེན་ཏེ། ང་སྔོན་ཚེ་རབས་ལྔ་བརྒྱར་བཟོད་པ་སྨྲ་བ་ཞེས་བྱ་བའི་དྲང་སྲོང་དུ་གྱུར་པའི་དུས་སུ་རྐྱེན་དེ་ལྟ་བུ་ལ་བརྟེན་ནས་གཞན་གྱིས་ངའི་ཡན་ལག་སོགས་བཅད་པ་ན་བདག་ཏུ་འདུ་ཤེས་སོགས་མ་བྱུང་ངོ༌། ། ཏེ་ཡན་ལག་བཅད་པའི་དུས་ཀྱི་ང་དེ་སྟོན་པ་མིན་ཞིང༌། སྟོན་པ་ཡང་དེའི་དུས་ཀྱི་ང་དེ་མིན་པས། སྟོན་པས་ངའི་ཡན་ལག་རྣམས་གསུངས་པ་དེ་ཇི་ལྟར་འཐད་སྙམ་ན། བདེན་མོད། འདིའི་ལན་ཞིབ་ཏུ་བཤད་ན་མང་དུ་འགྱུར་བས། བསྡུས་ན་དེ་ནི་རྒྱུད་གཅིག་པ་ལ་དགོངས་ཤིང་སྐྱོན་མེད་ཚུལ་གོང་དུ་ཅུང་ཟད་བཤད་ཅིང་འཆད་པར་བྱའོ། །",
            "type": "source",
            "mapping": []
        },
        {
            "content": "ངའོ་སྙམ་པའི་བདག་ཏུ་ཞེན་པ་ཡོད་ན་གནོད་སེམས་སོགས་འབྱུང་བ་ནི། རྣམ་འགྲེལ་ལས། བདག་ཡོད་ན་ནི་གཞན་དུ་ཤེས། །བདག་གཞན་ཆ་ལ་འཛིན་དང་སྡང༌། །འདི་དག་དང་ནི་ཡོངས་འབྲེལ་བས། །ཉེས་པ་ཐམས་ཅད་འབྱུང་བར་འགྱུར། །ཞེས་བཤད་པ་བཞིན་ནོ། ། དེ་ལྟ་བུའི་བཟོད་པའི་སྟོབས་ཀྱིས་ང་སངས་རྒྱས་པས་རྒྱུ་མཚན་དེ་ལྟ་བས་ན་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱིས་དེ་ལྟ་བུའི་བདག་ཏུ་འདུ་ཤེས་པ་རྣམ་པར་སྤངས་ཏེ་བླ་ན་མེད་པའི་བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་ཅིང་གོང་འཕེལ་དུ་བྱའོ། །",
            "type": "source",
            "mapping": []
        },
        {
            "content": "ངའོ་སྙམ་པའི་བདག་ཏུ་ཞེན་པ་ཡོད་ན་གནོད་སེམས་སོགས་འབྱུང་བ་ནི། རྣམ་འགྲེལ་ལས། བདག་ཡོད་ན་ནི་གཞན་དུ་ཤེས། །བདག་གཞན་ཆ་ལ་འཛིན་དང་སྡང༌། །འདི་དག་དང་ནི་ཡོངས་འབྲེལ་བས། །ཉེས་པ་ཐམས་ཅད་འབྱུང་བར་འགྱུར། །ཞེས་བཤད་པ་བཞིན་ནོ། ། དེ་ལྟ་བུའི་བཟོད་པའི་སྟོབས་ཀྱིས་ང་སངས་རྒྱས་པས་རྒྱུ་མཚན་དེ་ལྟ་བས་ན་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱིས་དེ་ལྟ་བུའི་བདག་ཏུ་འདུ་ཤེས་པ་རྣམ་པར་སྤངས་ཏེ་བླ་ན་མེད་པའི་བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་ཅིང་གོང་འཕེལ་དུ་བྱའོ། །",
            "type": "source",
            "mapping": []
        },
        {
            "content": "བཟོད་པའི་འཁོར་གསུམ་ལ་བདེན་ཞེན་གྱིས་མི་གནས་པར་མ་ཟད། གཟུགས་སྒྲ་སོགས་ལ་ཡང་དེ་ལྟར་མི་གནས་ཤིང༌། ཀུན་རྫོབ་པའི་ཆོས་གང་ཅི་ལ་ཡང་བདེན་ཞེན་གྱིས་མི་གནས་པ་དང༌། ཀུན་རྫོབ་པའི་ཆོས་བདེན་པར་མེད་པའི་དོན་དམ་པ་ལ་ཡང་བདེན་ཞེན་གྱིས་གནས་པར་མི་བྱའོ། །",
            "type": "source",
            "mapping": []
        },
        {
            "content": "བཟོད་པའི་འཁོར་གསུམ་ལ་བདེན་ཞེན་གྱིས་མི་གནས་པར་མ་ཟད། གཟུགས་སྒྲ་སོགས་ལ་ཡང་དེ་ལྟར་མི་གནས་ཤིང༌། ཀུན་རྫོབ་པའི་ཆོས་གང་ཅི་ལ་ཡང་བདེན་ཞེན་གྱིས་མི་གནས་པ་དང༌། ཀུན་རྫོབ་པའི་ཆོས་བདེན་པར་མེད་པའི་དོན་དམ་པ་ལ་ཡང་བདེན་ཞེན་གྱིས་གནས་པར་མི་བྱའོ། །",
            "type": "source",
            "mapping": []
        },
        {
            "content": "བཟོད་པའི་འཁོར་གསུམ་ལ་བདེན་ཞེན་གྱིས་མི་གནས་པར་མ་ཟད། གཟུགས་སྒྲ་སོགས་ལ་ཡང་དེ་ལྟར་མི་གནས་ཤིང༌། ཀུན་རྫོབ་པའི་ཆོས་གང་ཅི་ལ་ཡང་བདེན་ཞེན་གྱིས་མི་གནས་པ་དང༌། ཀུན་རྫོབ་པའི་ཆོས་བདེན་པར་མེད་པའི་དོན་དམ་པ་ལ་ཡང་བདེན་ཞེན་གྱིས་གནས་པར་མི་བྱའོ། །",
            "type": "source",
            "mapping": []
        },
        {
            "content": "བཟོད་པའི་འཁོར་གསུམ་ལ་བདེན་ཞེན་གྱིས་མི་གནས་པར་མ་ཟད། གཟུགས་སྒྲ་སོགས་ལ་ཡང་དེ་ལྟར་མི་གནས་ཤིང༌། ཀུན་རྫོབ་པའི་ཆོས་གང་ཅི་ལ་ཡང་བདེན་ཞེན་གྱིས་མི་གནས་པ་དང༌། ཀུན་རྫོབ་པའི་ཆོས་བདེན་པར་མེད་པའི་དོན་དམ་པ་ལ་ཡང་བདེན་ཞེན་གྱིས་གནས་པར་མི་བྱའོ། །",
            "type": "source",
            "mapping": []
        },
        {
            "content": "བཟོད་པའི་འཁོར་གསུམ་ལ་བདེན་ཞེན་གྱིས་མི་གནས་པར་མ་ཟད། གཟུགས་སྒྲ་སོགས་ལ་ཡང་དེ་ལྟར་མི་གནས་ཤིང༌། ཀུན་རྫོབ་པའི་ཆོས་གང་ཅི་ལ་ཡང་བདེན་ཞེན་གྱིས་མི་གནས་པ་དང༌། ཀུན་རྫོབ་པའི་ཆོས་བདེན་པར་མེད་པའི་དོན་དམ་པ་ལ་ཡང་བདེན་ཞེན་གྱིས་གནས་པར་མི་བྱའོ། །",
            "type": "source",
            "mapping": []
        },
        {
            "content": "རྒྱུ་མཚན་ནི་གཟུགས་སྒྲ་སོགས་ལ་ཞེན་ཅིང་གནས་པའི་ཡུལ་གཟུགས་སོགས་གང་ཡིན་པ་དེ་ཉིད་དོན་དམ་པར་མི་གནས་པ་སྟེ་མ་གྲུབ་པའི་ཕྱིར་རོ་ཞེས་སོ། ། དེ་བས་ན་དེ་བཞིན་གཤེགས་པས་བྱང་ཆུབ་སེམས་དཔའ་ཅི་ལ་ཡང་དོན་དམ་པར་མི་གནས་པར་སྦྱིན་པ་སྦྱིན་པར་བྱའོ་ཞེས་གསུངས་ཏེ། དེས་མཚོན་ནས་ཚུལ་ཁྲིམས་སོགས་གཞན་ལའང་སྦྱོར་བར་དགོངས་སོ། །",
            "type": "source",
            "mapping": []
        },
        {
            "content": "རྒྱུ་མཚན་ནི་གཟུགས་སྒྲ་སོགས་ལ་ཞེན་ཅིང་གནས་པའི་ཡུལ་གཟུགས་སོགས་གང་ཡིན་པ་དེ་ཉིད་དོན་དམ་པར་མི་གནས་པ་སྟེ་མ་གྲུབ་པའི་ཕྱིར་རོ་ཞེས་སོ། ། དེ་བས་ན་དེ་བཞིན་གཤེགས་པས་བྱང་ཆུབ་སེམས་དཔའ་ཅི་ལ་ཡང་དོན་དམ་པར་མི་གནས་པར་སྦྱིན་པ་སྦྱིན་པར་བྱའོ་ཞེས་གསུངས་ཏེ། དེས་མཚོན་ནས་ཚུལ་ཁྲིམས་སོགས་གཞན་ལའང་སྦྱོར་བར་དགོངས་སོ། །",
            "type": "source",
            "mapping": []
        },
        {
            "content": "བྱང་ཆུབ་སེམས་དཔས་ནི་བདེན་ཞེན་མེད་པའི་ཚུལ་འདི་ལྟར་སྦྱིན་པ་ཡོངས་སུ་གཏོང་བ་དང་ཚུལ་ཁྲིམས་སྲུང་སོགས་བྱའོ། །",
            "type": "source",
            "mapping": []
        },
        {
            "content": "སེམས་ཅན་དུ་བདེན་པར་འདུ་ཤེས་པ་དེ་ཉིད་ཀྱང་དོན་དམ་པར་འདུ་ཤེས་མེད་པ་དང༌། ཐ་སྙད་དུ་སེམས་ཅན་གང་དག་ཅེས་གསུངས་པའི་སེམས་ཅན་དེ་དག་ཉིད་ཀྱང་སེམས་ཅན་དུ་རང་བཞིན་གྱིས་མེད་པའོ། །",
            "type": "source",
            "mapping": []
        },
        {
            "content": "སེམས་ཅན་དུ་བདེན་པར་འདུ་ཤེས་པ་དེ་ཉིད་ཀྱང་དོན་དམ་པར་འདུ་ཤེས་མེད་པ་དང༌། ཐ་སྙད་དུ་སེམས་ཅན་གང་དག་ཅེས་གསུངས་པའི་སེམས་ཅན་དེ་དག་ཉིད་ཀྱང་སེམས་ཅན་དུ་རང་བཞིན་གྱིས་མེད་པའོ། །",
            "type": "source",
            "mapping": []
        },
        {
            "content": "རྒྱུ་མཚན་ནི་རབ་འབྱོར་དེ་བཞིན་གཤེགས་པས་དེ་ལྟར་ཆོས་རྣམས་བདེན་སྟོང་དུ་བཤད་པ་ནི་རྫུན་དུ་གསུངས་པ་མ་ཡིན་ཏེ། དེ་བཞིན་གཤེགས་པ་ནི་ཕྱིན་ཅི་མ་ལོག་པར་ཡང་དག་པར་གསུངས་པ་དང༌། རྣམ་པ་གཞན་དུ་མི་འགྱུར་བའི་བདེན་པར་གསུངས་པ་དང༌། ཆོས་རྣམས་ཀྱི་གནས་ཚུལ་ཇི་ལྟ་བ་དེ་བཞིན་ཉིད་དུ་གསུངས་པ་པོ་སྟེ། ལོག་པར་གསུངས་པ་པོ་མ་ཡིན་པའི་ཕྱིར་རོ། །",
            "type": "source",
            "mapping": []
        },
        {
            "content": "རྒྱུ་མཚན་ནི་རབ་འབྱོར་དེ་བཞིན་གཤེགས་པས་དེ་ལྟར་ཆོས་རྣམས་བདེན་སྟོང་དུ་བཤད་པ་ནི་རྫུན་དུ་གསུངས་པ་མ་ཡིན་ཏེ། དེ་བཞིན་གཤེགས་པ་ནི་ཕྱིན་ཅི་མ་ལོག་པར་ཡང་དག་པར་གསུངས་པ་དང༌། རྣམ་པ་གཞན་དུ་མི་འགྱུར་བའི་བདེན་པར་གསུངས་པ་དང༌། ཆོས་རྣམས་ཀྱི་གནས་ཚུལ་ཇི་ལྟ་བ་དེ་བཞིན་ཉིད་དུ་གསུངས་པ་པོ་སྟེ། ལོག་པར་གསུངས་པ་པོ་མ་ཡིན་པའི་ཕྱིར་རོ། །",
            "type": "source",
            "mapping": []
        },
        {
            "content": "རབ་འབྱོར་དེ་བཞིན་གཤེགས་པས་ཐོབ་བྱའི་ཆོས་གང་ཡང་སངས་རྒྱས་པའམ་བསྟན་པ་དེ་རྣམས་ལ་བདེན་པ་དོན་དམ་པའི་ཆོས་རྣམས་བདེན་པར་གྲུབ་པ་ཡང་མེད་ཅིང༌། རྫུན་པ་ཀུན་རྫོབ་པའི་ཆོས་རྣམས་ཀྱང་བདེན་པར་གྲུབ་པ་མེད་དོ་ཞེས་སོ། །ཀ་མ་ལ་ཤཱི་ལས་ནི། ཀུན་རྫོབ་རྣམས་དོན་དམ་དཔྱོད་པའི་རིག་ཤེས་ཀྱི་ངོ་བོར་མེད་པས་མི་བདེན་ཅིང་རྫུན་པ་ལ་བཤད་པ་ལྟར་སྣང་སྟེ། གཞུང་འདིས་མཐའ་གཉིས་སེལ་བའང་ཡིན་ནོ། །",
            "type": "source",
            "mapping": []
        },
        {
            "content": "བདེན་མེད་རྟོགས་མ་རྟོགས་པའི་དབང་གིས་སྦྱིན་སོགས་ཀྱི་བྱེད་ལས་ལ་ཁྱད་པར་ཡོད་ཅེས་སྟོན་པ་ནི། འདི་ལྟ་སྟེ་དཔེར་ན། མིག་དང་ལྡན་པའི་མི་ཞིག་མུན་པ་ཆེན་པོར་ཞུགས་ནས་ཡུལ་གཟུགས་ཀྱི་དངོས་པོ་ཅི་ཡང་གསལ་བར་མི་མཐོང་བ་དེ་བཞིན་དུ། བྱང་སེམས་གང་བདེན་མེད་ལ་བློ་ཁ་མ་ཕྱོགས་ཤིང་བདེན་འཛིན་གྱིས་བཅིངས་པའི་མངོན་ཞེན་གྱི་ལྟ་བའི་གཡང་དུ་ལྷུང་ནས་སྦྱིན་པ་གཏོང་བའི་བྱང་སེམས་རྣམས་ནི་དཔེ་དེ་དང་འདྲ་བའི་བྱང་ཆུབ་སེམས་དཔར་བལྟ་བར་བྱའོ། །",
            "type": "source",
            "mapping": []
        },
        {
            "content": "ཡང་འདི་ལྟ་སྟེ། ནམ་ལངས་ཏེ་ཉི་མ་ཤར་ནས་མིག་དང་ལྡན་པའི་མིས་ཡུལ་གཟུགས་བཟང་ངན་རྣམ་པ་སྣ་ཚོགས་མཐོང་བ་དེ་བཞིན་དུ། བྱང་སེམས་གང་བདེན་འཛིན་གྱིས་བཅིངས་པའི་དངོས་པོར་མ་ལྷུང་བས་སྦྱིན་པ་ཡོངས་སུ་གཏོང་བའི་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ནི་དཔེ་དེ་དང་འདྲ་བར་བལྟ་བར་བྱའོ་ཞེས་བདེན་འཛིན་གྱིས་བཅིངས་པའི་སྦྱིན་པ་ནི་མི་མུན་པར་ཞུགས་ནས་གཟུགས་མི་མཐོང་བ་དང་འདྲ་ཞིང༌།",
            "type": "source",
            "mapping": []
        },
        {
            "content": "དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་ད་ལྟ་དང་མ་འོངས་པའི་དུས་སུ་གཞུང་འདི་འཛིན་འཆང་སོགས་བྱེད་པའི་གང་ཟག་གང་འབྱུང་བ་ནི་དེ་བཞིན་གཤེགས་པས་ད་ལྟ་ནས་མཁྱེན་ཅིང་གཟིགས་ཏེ།  སེམས་ཅན་དེ་དག་ཐམས་ཅད་ནི་བསོད་ནམས་ཀྱི་ཕུང་པོ་དཔག་ཏུ་མེད་པ་བསྐྱེད་པར་འགྱུར་རོ་ཞེས་པ་ནི།སངས་རྒྱས་ཀྱིས་སེམས་ཅན་དེ་དག་ལ་ཐུགས་ཀྱིས་དགོངས་ཤིང་བསོད་ནམས་ཆེའོ་ཞེས་སྤྲོ་བ་བསྐྱེད་པའོ། །",
            "type": "source",
            "mapping": []
        },
        {
            "content": "དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་ད་ལྟ་དང་མ་འོངས་པའི་དུས་སུ་གཞུང་འདི་འཛིན་འཆང་སོགས་བྱེད་པའི་གང་ཟག་གང་འབྱུང་བ་ནི་དེ་བཞིན་གཤེགས་པས་ད་ལྟ་ནས་མཁྱེན་ཅིང་གཟིགས་ཏེ།  སེམས་ཅན་དེ་དག་ཐམས་ཅད་ནི་བསོད་ནམས་ཀྱི་ཕུང་པོ་དཔག་ཏུ་མེད་པ་བསྐྱེད་པར་འགྱུར་རོ་ཞེས་པ་ནི།སངས་རྒྱས་ཀྱིས་སེམས་ཅན་དེ་དག་ལ་ཐུགས་ཀྱིས་དགོངས་ཤིང་བསོད་ནམས་ཆེའོ་ཞེས་སྤྲོ་བ་བསྐྱེད་པའོ། །",
            "type": "source",
            "mapping": []
        },
        {
            "content": "གཞན་ཡང་གང་གིས་སྔ་དྲོ་དང་ཕྱི་དྲོའི་དུས་རྣམས་དང་བསྐལ་བ་མང་པོར་ལུས་ཀྱི་སྦྱིན་པ་གངྒཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་ཀྱིས་མཚན་པའི་ལུས་གཏོང་ཞིང༌། བཏང་བའི་ཕན་ཡོན་ལས་གང་གིས་གཞུང་འདི་རྫོགས་པར་ཐོས་ཤིང་མོས་ནས་བློས་མི་སྤོང་ན། དེའི་བསོད་ནམས་ཀྱི་ཕུང་པོ་སྔ་མ་ལས་ཀྱང་ཆེ་ན་གང་གཞུང་འདི་ཡི་གེར་འབྲི་བ་སོགས་བྱས་ན་བསོད་ནམས་དེ་ལས་ཆེ་བ་ལྟ་ཅི་སྨོས་ཞེས་གསུངས། དེ་ཡང་ལེན་པ་ནས་རབ་ཏུ་སྟོན་པའི་བར་སྔ་མ་སྔ་མ་ལས་ཕྱི་མ་ཕྱི་མ་བསོད་ནམས་ཏེ་ཕན་ཡོན་ཆེ་བར་འགྱུར་རོ། །",
            "type": "source",
            "mapping": []
        },
        {
            "content": "གཞན་ཡང་གང་གིས་སྔ་དྲོ་དང་ཕྱི་དྲོའི་དུས་རྣམས་དང་བསྐལ་བ་མང་པོར་ལུས་ཀྱི་སྦྱིན་པ་གངྒཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་ཀྱིས་མཚན་པའི་ལུས་གཏོང་ཞིང༌། བཏང་བའི་ཕན་ཡོན་ལས་གང་གིས་གཞུང་འདི་རྫོགས་པར་ཐོས་ཤིང་མོས་ནས་བློས་མི་སྤོང་ན། དེའི་བསོད་ནམས་ཀྱི་ཕུང་པོ་སྔ་མ་ལས་ཀྱང་ཆེ་ན་གང་གཞུང་འདི་ཡི་གེར་འབྲི་བ་སོགས་བྱས་ན་བསོད་ནམས་དེ་ལས་ཆེ་བ་ལྟ་ཅི་སྨོས་ཞེས་གསུངས། དེ་ཡང་ལེན་པ་ནས་རབ་ཏུ་སྟོན་པའི་བར་སྔ་མ་སྔ་མ་ལས་ཕྱི་མ་ཕྱི་མ་བསོད་ནམས་ཏེ་ཕན་ཡོན་ཆེ་བར་འགྱུར་རོ། །",
            "type": "source",
            "mapping": []
        },
        {
            "content": "བསྔགས་པ་ནི་ཆོས་ཀྱི་རྣམ་གྲངས་འདིའི་དོན་ཟབ་པ་དང་རྟོགས་དཀའ་བའི་ཕྱིར་བསམ་གྱིས་མི་ཁྱབ་ཅིང་འདི་དང་མཉམ་པའི་མཚུངས་པ་གཞན་མེད་དེ། འདི་ལ་ཐོས་བསམ་བསྒོམས་པ་བྱས་པའི་འབྲས་བུ་རྣམ་པར་སྨིན་པ་ཡང་རྒྱ་ཆེ་བ་བསམ་གྱིས་མི་ཁྱབ་པ་ཉིད་དུ་རིག་པ་སྟེ་ཤེས་པར་བྱའོ། །",
            "type": "source",
            "mapping": []
        },
        {
            "content": "བསྔགས་པ་ནི་ཆོས་ཀྱི་རྣམ་གྲངས་འདིའི་དོན་ཟབ་པ་དང་རྟོགས་དཀའ་བའི་ཕྱིར་བསམ་གྱིས་མི་ཁྱབ་ཅིང་འདི་དང་མཉམ་པའི་མཚུངས་པ་གཞན་མེད་དེ། འདི་ལ་ཐོས་བསམ་བསྒོམས་པ་བྱས་པའི་འབྲས་བུ་རྣམ་པར་སྨིན་པ་ཡང་རྒྱ་ཆེ་བ་བསམ་གྱིས་མི་ཁྱབ་པ་ཉིད་དུ་རིག་པ་སྟེ་ཤེས་པར་བྱའོ། །",
            "type": "source",
            "mapping": []
        },
        {
            "content": "ཆོས་འདི་ནི་ཐེག་པ་དམན་པ་ལ་མོས་པ་རྣམས་ཀྱི་ཆེད་དུ་གཙོ་བོར་མ་ཡིན་གྱི། ཐེག་པ་མཆོག་དང་ཐེག་པ་ཕུལ་དུ་ཕྱིན་པ་ཐེག་པ་ཆེན་པོའི་ལམ་དུ་ཞུགས་པའི་སེམས་ཅན་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་དོན་གྱི་ཕྱིར་དེ་བཞིན་གཤེགས་པས་གསུངས་སོ། ། ཐེག་པ་མཆོག་དང་ཐེག་པ་ཕུལ་དུ་ཕྱིན་པ་གཉིས་ཀ་ཐེག་པ་ཆེན་པོའི་མིང་གི་རྣམ་གྲངས་སོ། །",
            "type": "source",
            "mapping": []
        },
        {
            "content": "དེ་ལྟ་བུའི་ཐེག་པ་ཆེན་པོའི་སེམས་ཅན་གང་དག་ཆོས་འདི་ལེན་པ་དང་འཛིན་པ་སོགས་བྱེད་པ་དེ་དག་ནི། དེ་བཞིན་གཤེགས་པས་ད་ལྟ་ནས་མཁྱེན་ཅིང་གཟིགས་ཏེ་སེམས་ཅན་དེ་དག་ནི་བསོད་ནམས་ཀྱི་ཕུང་པོ་དཔག་ཏུ་མེད་པ་དང༌། བློས་བསམ་གྱིས་མི་ཁྱབ་པ་དང༌།  དེ་དང་མཚུངས་པ་མེད་པ་དང༌། མཐའ་གཞལ་དུ་མེད་པ་དང༌། ཚད་མེད་པ་དང་ལྡན་པར་འགྱུར་ཏེ་སེམས་ཅན་དེ་དག་ཐམས་ཅད་ཀྱང་དེ་བཞིན་གཤེགས་པ་ངའི་བྱང་ཆུབ་ཀྱི་གོ་འཕང་ཕྲག་པ་ལ་ཐོགས་པ་ལྟར་མྱུར་དུ་ཐོབ་པར་འགྱུར་རོ། །",
            "type": "source",
            "mapping": []
        },
        {
            "content": "དེ་ལྟ་བུའི་ཐེག་པ་ཆེན་པོའི་སེམས་ཅན་གང་དག་ཆོས་འདི་ལེན་པ་དང་འཛིན་པ་སོགས་བྱེད་པ་དེ་དག་ནི། དེ་བཞིན་གཤེགས་པས་ད་ལྟ་ནས་མཁྱེན་ཅིང་གཟིགས་ཏེ་སེམས་ཅན་དེ་དག་ནི་བསོད་ནམས་ཀྱི་ཕུང་པོ་དཔག་ཏུ་མེད་པ་དང༌། བློས་བསམ་གྱིས་མི་ཁྱབ་པ་དང༌།  དེ་དང་མཚུངས་པ་མེད་པ་དང༌། མཐའ་གཞལ་དུ་མེད་པ་དང༌། ཚད་མེད་པ་དང་ལྡན་པར་འགྱུར་ཏེ་སེམས་ཅན་དེ་དག་ཐམས་ཅད་ཀྱང་དེ་བཞིན་གཤེགས་པ་ངའི་བྱང་ཆུབ་ཀྱི་གོ་འཕང་ཕྲག་པ་ལ་ཐོགས་པ་ལྟར་མྱུར་དུ་ཐོབ་པར་འགྱུར་རོ། །",
            "type": "source",
            "mapping": []
        },
        {
            "content": "དེ་ལྟ་བུའི་ཐེག་པ་ཆེན་པོའི་སེམས་ཅན་གང་དག་ཆོས་འདི་ལེན་པ་དང་འཛིན་པ་སོགས་བྱེད་པ་དེ་དག་ནི། དེ་བཞིན་གཤེགས་པས་ད་ལྟ་ནས་མཁྱེན་ཅིང་གཟིགས་ཏེ་སེམས་ཅན་དེ་དག་ནི་བསོད་ནམས་ཀྱི་ཕུང་པོ་དཔག་ཏུ་མེད་པ་དང༌། བློས་བསམ་གྱིས་མི་ཁྱབ་པ་དང༌།  དེ་དང་མཚུངས་པ་མེད་པ་དང༌། མཐའ་གཞལ་དུ་མེད་པ་དང༌། ཚད་མེད་པ་དང་ལྡན་པར་འགྱུར་ཏེ་སེམས་ཅན་དེ་དག་ཐམས་ཅད་ཀྱང་དེ་བཞིན་གཤེགས་པ་ངའི་བྱང་ཆུབ་ཀྱི་གོ་འཕང་ཕྲག་པ་ལ་ཐོགས་པ་ལྟར་མྱུར་དུ་ཐོབ་པར་འགྱུར་རོ། །",
            "type": "source",
            "mapping": []
        },
        {
            "content": "དེ་ལྟ་བུའི་ཐེག་པ་ཆེན་པོའི་སེམས་ཅན་གང་དག་ཆོས་འདི་ལེན་པ་དང་འཛིན་པ་སོགས་བྱེད་པ་དེ་དག་ནི། དེ་བཞིན་གཤེགས་པས་ད་ལྟ་ནས་མཁྱེན་ཅིང་གཟིགས་ཏེ་སེམས་ཅན་དེ་དག་ནི་བསོད་ནམས་ཀྱི་ཕུང་པོ་དཔག་ཏུ་མེད་པ་དང༌། བློས་བསམ་གྱིས་མི་ཁྱབ་པ་དང༌།  དེ་དང་མཚུངས་པ་མེད་པ་དང༌། མཐའ་གཞལ་དུ་མེད་པ་དང༌། ཚད་མེད་པ་དང་ལྡན་པར་འགྱུར་ཏེ་སེམས་ཅན་དེ་དག་ཐམས་ཅད་ཀྱང་དེ་བཞིན་གཤེགས་པ་ངའི་བྱང་ཆུབ་ཀྱི་གོ་འཕང་ཕྲག་པ་ལ་ཐོགས་པ་ལྟར་མྱུར་དུ་ཐོབ་པར་འགྱུར་རོ། །",
            "type": "source",
            "mapping": []
        },
        {
            "content": "རྒྱུ་མཚན་ནི། ཆོས་དམན་པ་ལ་མོས་པ་རྣམས་ཀྱིས་ནི་ཆོས་ཀྱི་རྣམས་གྲངས་ཟབ་མོ་འདི་ལ་ཐོས་བསམ་སྒོམ་པའི་ཚུལ་གྱིས་མཉན་པར་བྱར་མི་ནུས་ཏེ། གང་ཟག་གི་བདག་ཏུ་ལྟ་བ་དང་སེམས་ཅན་དང་སྲོག་དང་གང་ཟག་ཏུ་བདེན་ཞེན་གྱིས་ལྟ་ཞིང༌། འདོད་པའི་གང་ཟག་ཕྱི་རོལ་པ་ལྟ་བུ་རྣམས་ཀྱིས་གཞུང་འདིའི་ཚིག་དོན་མཉན་པ་དང་བླང་བ་སོགས་བྱེད་མི་ནུས་ཏེ། དེ་བྱེད་པའི་གནས་སམ་གོ་སྐབས་མེད་པའི་ཕྱིར་ཏེ། དེ་ལྟ་བུའི་སེམས་ཅན་རྣམས་ཀྱིས་བདག་མེད་པའི་དོན་མི་འདོད་པའི་ཕྱིར་རོ། །",
            "type": "source",
            "mapping": []
        },
        {
            "content": "རྒྱུ་མཚན་ནི། ཆོས་དམན་པ་ལ་མོས་པ་རྣམས་ཀྱིས་ནི་ཆོས་ཀྱི་རྣམས་གྲངས་ཟབ་མོ་འདི་ལ་ཐོས་བསམ་སྒོམ་པའི་ཚུལ་གྱིས་མཉན་པར་བྱར་མི་ནུས་ཏེ། གང་ཟག་གི་བདག་ཏུ་ལྟ་བ་དང་སེམས་ཅན་དང་སྲོག་དང་གང་ཟག་ཏུ་བདེན་ཞེན་གྱིས་ལྟ་ཞིང༌། འདོད་པའི་གང་ཟག་ཕྱི་རོལ་པ་ལྟ་བུ་རྣམས་ཀྱིས་གཞུང་འདིའི་ཚིག་དོན་མཉན་པ་དང་བླང་བ་སོགས་བྱེད་མི་ནུས་ཏེ། དེ་བྱེད་པའི་གནས་སམ་གོ་སྐབས་མེད་པའི་ཕྱིར་ཏེ། དེ་ལྟ་བུའི་སེམས་ཅན་རྣམས་ཀྱིས་བདག་མེད་པའི་དོན་མི་འདོད་པའི་ཕྱིར་རོ། །",
            "type": "source",
            "mapping": []
        },
        {
            "content": "རྒྱུ་མཚན་ནི། ཆོས་དམན་པ་ལ་མོས་པ་རྣམས་ཀྱིས་ནི་ཆོས་ཀྱི་རྣམས་གྲངས་ཟབ་མོ་འདི་ལ་ཐོས་བསམ་སྒོམ་པའི་ཚུལ་གྱིས་མཉན་པར་བྱར་མི་ནུས་ཏེ། གང་ཟག་གི་བདག་ཏུ་ལྟ་བ་དང་སེམས་ཅན་དང་སྲོག་དང་གང་ཟག་ཏུ་བདེན་ཞེན་གྱིས་ལྟ་ཞིང༌། འདོད་པའི་གང་ཟག་ཕྱི་རོལ་པ་ལྟ་བུ་རྣམས་ཀྱིས་གཞུང་འདིའི་ཚིག་དོན་མཉན་པ་དང་བླང་བ་སོགས་བྱེད་མི་ནུས་ཏེ། དེ་བྱེད་པའི་གནས་སམ་གོ་སྐབས་མེད་པའི་ཕྱིར་ཏེ། དེ་ལྟ་བུའི་སེམས་ཅན་རྣམས་ཀྱིས་བདག་མེད་པའི་དོན་མི་འདོད་པའི་ཕྱིར་རོ། །",
            "type": "source",
            "mapping": []
        },
        {
            "content": "རྒྱུ་མཚན་ནི། ཆོས་དམན་པ་ལ་མོས་པ་རྣམས་ཀྱིས་ནི་ཆོས་ཀྱི་རྣམས་གྲངས་ཟབ་མོ་འདི་ལ་ཐོས་བསམ་སྒོམ་པའི་ཚུལ་གྱིས་མཉན་པར་བྱར་མི་ནུས་ཏེ། གང་ཟག་གི་བདག་ཏུ་ལྟ་བ་དང་སེམས་ཅན་དང་སྲོག་དང་གང་ཟག་ཏུ་བདེན་ཞེན་གྱིས་ལྟ་ཞིང༌། འདོད་པའི་གང་ཟག་ཕྱི་རོལ་པ་ལྟ་བུ་རྣམས་ཀྱིས་གཞུང་འདིའི་ཚིག་དོན་མཉན་པ་དང་བླང་བ་སོགས་བྱེད་མི་ནུས་ཏེ། དེ་བྱེད་པའི་གནས་སམ་གོ་སྐབས་མེད་པའི་ཕྱིར་ཏེ། དེ་ལྟ་བུའི་སེམས་ཅན་རྣམས་ཀྱིས་བདག་མེད་པའི་དོན་མི་འདོད་པའི་ཕྱིར་རོ། །",
            "type": "source",
            "mapping": []
        },
        {
            "content": "ཡང་ས་ཕྱོགས་གང་ན་མདོ་སྡེ་འདི་སྟོན་པའི་ས་ཕྱོགས་དེ་ལྷ་དང་མི་དང་ལྷ་མ་ཡིན་དང་བཅས་པའི་འཇིག་རྟེན་གྱི་སེམས་ཅན་རྣམས་ཀྱིས་མཆོད་པ་དང་ཕྱག་བྱ་བ་དང་བསྐོར་བར་བྱ་བའི་འོས་སུ་འགྱུར་ཏེ། །ས་ཕྱོགས་དེ་མཆོད་རྟེན་ལྟ་བུར་འགྱུར་རོ། །འདི་ནི་མངོན་རྟོགས་རྒྱན་ལས། བྱང་ཆུབ་དག་ནི་རྟེན་མཆོད་ཉིད། ། ཞེས་པའི་རྩ་བའི་མདོ་ཡུམ་རྒྱས་འབྲིང་བསྡུས་གསུམ་དང་འགྲེལ་པ་རྣམས་ལས་ནི་བྱང་སེམས་སྒོམ་ལམ་པ་གང་དུ་བཞུགས་པའི་གནས་དེ་གཞན་གྱིས་བཀུར་བའི་གནས་མཆོད་རྟེན་ལྟ་བུར་གསུངས་པ་དང་འདྲ་ལ། གཙོ་བོ་ནི་གཞུང་འདིའི་བརྗོད་བྱ་དོན་གྱི་ཤེར་ཕྱིན་ཁྱད་པར་ཅན་རྒྱུད་ལ་སྐྱེས་པའི་གང་ཟག་བཞུགས་པའི་གནས་ལ་དགོངས་སོ། །གོང་དུ་འདི་ལྟ་བུ་ཞིག་སོང་ཡང་གཞི་སོ་སོའི་དབང་དུ་མཛད་པའོ། །",
            "type": "source",
            "mapping": []
        },
        {
            "content": "ཡང་ས་ཕྱོགས་གང་ན་མདོ་སྡེ་འདི་སྟོན་པའི་ས་ཕྱོགས་དེ་ལྷ་དང་མི་དང་ལྷ་མ་ཡིན་དང་བཅས་པའི་འཇིག་རྟེན་གྱི་སེམས་ཅན་རྣམས་ཀྱིས་མཆོད་པ་དང་ཕྱག་བྱ་བ་དང་བསྐོར་བར་བྱ་བའི་འོས་སུ་འགྱུར་ཏེ། །ས་ཕྱོགས་དེ་མཆོད་རྟེན་ལྟ་བུར་འགྱུར་རོ། །འདི་ནི་མངོན་རྟོགས་རྒྱན་ལས། བྱང་ཆུབ་དག་ནི་རྟེན་མཆོད་ཉིད། ། ཞེས་པའི་རྩ་བའི་མདོ་ཡུམ་རྒྱས་འབྲིང་བསྡུས་གསུམ་དང་འགྲེལ་པ་རྣམས་ལས་ནི་བྱང་སེམས་སྒོམ་ལམ་པ་གང་དུ་བཞུགས་པའི་གནས་དེ་གཞན་གྱིས་བཀུར་བའི་གནས་མཆོད་རྟེན་ལྟ་བུར་གསུངས་པ་དང་འདྲ་ལ། གཙོ་བོ་ནི་གཞུང་འདིའི་བརྗོད་བྱ་དོན་གྱི་ཤེར་ཕྱིན་ཁྱད་པར་ཅན་རྒྱུད་ལ་སྐྱེས་པའི་གང་ཟག་བཞུགས་པའི་གནས་ལ་དགོངས་སོ། །གོང་དུ་འདི་ལྟ་བུ་ཞིག་སོང་ཡང་གཞི་སོ་སོའི་དབང་དུ་མཛད་པའོ། །",
            "type": "source",
            "mapping": []
        },
        {
            "content": "ཡང་ས་ཕྱོགས་གང་ན་མདོ་སྡེ་འདི་སྟོན་པའི་ས་ཕྱོགས་དེ་ལྷ་དང་མི་དང་ལྷ་མ་ཡིན་དང་བཅས་པའི་འཇིག་རྟེན་གྱི་སེམས་ཅན་རྣམས་ཀྱིས་མཆོད་པ་དང་ཕྱག་བྱ་བ་དང་བསྐོར་བར་བྱ་བའི་འོས་སུ་འགྱུར་ཏེ། །ས་ཕྱོགས་དེ་མཆོད་རྟེན་ལྟ་བུར་འགྱུར་རོ། །འདི་ནི་མངོན་རྟོགས་རྒྱན་ལས། བྱང་ཆུབ་དག་ནི་རྟེན་མཆོད་ཉིད། ། ཞེས་པའི་རྩ་བའི་མདོ་ཡུམ་རྒྱས་འབྲིང་བསྡུས་གསུམ་དང་འགྲེལ་པ་རྣམས་ལས་ནི་བྱང་སེམས་སྒོམ་ལམ་པ་གང་དུ་བཞུགས་པའི་གནས་དེ་གཞན་གྱིས་བཀུར་བའི་གནས་མཆོད་རྟེན་ལྟ་བུར་གསུངས་པ་དང་འདྲ་ལ། གཙོ་བོ་ནི་གཞུང་འདིའི་བརྗོད་བྱ་དོན་གྱི་ཤེར་ཕྱིན་ཁྱད་པར་ཅན་རྒྱུད་ལ་སྐྱེས་པའི་གང་ཟག་བཞུགས་པའི་གནས་ལ་དགོངས་སོ། །གོང་དུ་འདི་ལྟ་བུ་ཞིག་སོང་ཡང་གཞི་སོ་སོའི་དབང་དུ་མཛད་པའོ། །",
            "type": "source",
            "mapping": []
        },
        {
            "content": "སྔ་མ་ལས་གཞན་ཡང་རབ་འབྱོར་རིགས་ཀྱི་བུའམ་བུ་མོ་གང་མདོ་སྡེ་འདི་འཛིན་འཆང་སོགས་བྱེད་ཅིང་དོན་ཉམས་སུ་ལེན་པའི་སེམས་ཅན་དེ་དག་ནི་ནད་སྣ་ཚོགས་དང་འཐབ་རྩོད་མཚང་འདྲུ་དང་བཅིང་རྡེག་སོགས་ཀྱིས་མནར་བ་དང་ཤིན་ཏུ་མནར་བའི་སྡུག་བསྔལ་མྱོང་བར་འགྱུར་བ་ཡོད་སྲིད་ཀྱང༌། སྐྱོན་ཆེན་པོ་མ་ཡིན་ཏེ།  རྒྱུ་མཚན་དེ་ཅིའི་ཕྱིར་ཞེ་ན། སེམས་ཅན་དེ་དག་གིས་ནི་ཚེ་རབས་འདི་དང་སྔ་མའི་དུས་སུ་མི་དགེ་བའི་ལས་ཆེན་པོ་ངན་སོང་གསུམ་དུ་སྐྱེ་བར་འགྱུར་བའི་ལས་གང་དག་བྱས་པ་དེ་དག་ཐམས་ཅད་ཀྱི་འབྲས་བུ་ནི་ཚེ་འདི་ཉིད་ཀྱི་ཐོག་མ་སྨིན་ཏེ་སྡུག་བསྔལ་གྱིས་མནར་བ་དེའི་སྟོབས་ཀྱིས་ཚེ་རབས་སྔ་མའི་མི་དགེ་བའི་ལས་དེ་དག་ཐམས་ཅད་འབྱང་བ་སྟེ་དག་པར་འགྱུར་ཏེ། སངས་རྒྱས་ཀྱི་བྱང་ཆུབ་ཀྱང་མྱུར་དུ་ཐོབ་པར་འགྱུར་རོ། །",
            "type": "source",
            "mapping": []
        },
        {
            "content": "སྔ་མ་ལས་གཞན་ཡང་རབ་འབྱོར་རིགས་ཀྱི་བུའམ་བུ་མོ་གང་མདོ་སྡེ་འདི་འཛིན་འཆང་སོགས་བྱེད་ཅིང་དོན་ཉམས་སུ་ལེན་པའི་སེམས་ཅན་དེ་དག་ནི་ནད་སྣ་ཚོགས་དང་འཐབ་རྩོད་མཚང་འདྲུ་དང་བཅིང་རྡེག་སོགས་ཀྱིས་མནར་བ་དང་ཤིན་ཏུ་མནར་བའི་སྡུག་བསྔལ་མྱོང་བར་འགྱུར་བ་ཡོད་སྲིད་ཀྱང༌། སྐྱོན་ཆེན་པོ་མ་ཡིན་ཏེ།  རྒྱུ་མཚན་དེ་ཅིའི་ཕྱིར་ཞེ་ན། སེམས་ཅན་དེ་དག་གིས་ནི་ཚེ་རབས་འདི་དང་སྔ་མའི་དུས་སུ་མི་དགེ་བའི་ལས་ཆེན་པོ་ངན་སོང་གསུམ་དུ་སྐྱེ་བར་འགྱུར་བའི་ལས་གང་དག་བྱས་པ་དེ་དག་ཐམས་ཅད་ཀྱི་འབྲས་བུ་ནི་ཚེ་འདི་ཉིད་ཀྱི་ཐོག་མ་སྨིན་ཏེ་སྡུག་བསྔལ་གྱིས་མནར་བ་དེའི་སྟོབས་ཀྱིས་ཚེ་རབས་སྔ་མའི་མི་དགེ་བའི་ལས་དེ་དག་ཐམས་ཅད་འབྱང་བ་སྟེ་དག་པར་འགྱུར་ཏེ། སངས་རྒྱས་ཀྱི་བྱང་ཆུབ་ཀྱང་མྱུར་དུ་ཐོབ་པར་འགྱུར་རོ། །",
            "type": "source",
            "mapping": []
        },
        {
            "content": "སྔ་མ་ལས་གཞན་ཡང་རབ་འབྱོར་རིགས་ཀྱི་བུའམ་བུ་མོ་གང་མདོ་སྡེ་འདི་འཛིན་འཆང་སོགས་བྱེད་ཅིང་དོན་ཉམས་སུ་ལེན་པའི་སེམས་ཅན་དེ་དག་ནི་ནད་སྣ་ཚོགས་དང་འཐབ་རྩོད་མཚང་འདྲུ་དང་བཅིང་རྡེག་སོགས་ཀྱིས་མནར་བ་དང་ཤིན་ཏུ་མནར་བའི་སྡུག་བསྔལ་མྱོང་བར་འགྱུར་བ་ཡོད་སྲིད་ཀྱང༌། སྐྱོན་ཆེན་པོ་མ་ཡིན་ཏེ།  རྒྱུ་མཚན་དེ་ཅིའི་ཕྱིར་ཞེ་ན། སེམས་ཅན་དེ་དག་གིས་ནི་ཚེ་རབས་འདི་དང་སྔ་མའི་དུས་སུ་མི་དགེ་བའི་ལས་ཆེན་པོ་ངན་སོང་གསུམ་དུ་སྐྱེ་བར་འགྱུར་བའི་ལས་གང་དག་བྱས་པ་དེ་དག་ཐམས་ཅད་ཀྱི་འབྲས་བུ་ནི་ཚེ་འདི་ཉིད་ཀྱི་ཐོག་མ་སྨིན་ཏེ་སྡུག་བསྔལ་གྱིས་མནར་བ་དེའི་སྟོབས་ཀྱིས་ཚེ་རབས་སྔ་མའི་མི་དགེ་བའི་ལས་དེ་དག་ཐམས་ཅད་འབྱང་བ་སྟེ་དག་པར་འགྱུར་ཏེ། སངས་རྒྱས་ཀྱི་བྱང་ཆུབ་ཀྱང་མྱུར་དུ་ཐོབ་པར་འགྱུར་རོ། །",
            "type": "source",
            "mapping": []
        },
        {
            "content": "སྔ་མ་ལས་གཞན་ཡང་རབ་འབྱོར་རིགས་ཀྱི་བུའམ་བུ་མོ་གང་མདོ་སྡེ་འདི་འཛིན་འཆང་སོགས་བྱེད་ཅིང་དོན་ཉམས་སུ་ལེན་པའི་སེམས་ཅན་དེ་དག་ནི་ནད་སྣ་ཚོགས་དང་འཐབ་རྩོད་མཚང་འདྲུ་དང་བཅིང་རྡེག་སོགས་ཀྱིས་མནར་བ་དང་ཤིན་ཏུ་མནར་བའི་སྡུག་བསྔལ་མྱོང་བར་འགྱུར་བ་ཡོད་སྲིད་ཀྱང༌། སྐྱོན་ཆེན་པོ་མ་ཡིན་ཏེ།  རྒྱུ་མཚན་དེ་ཅིའི་ཕྱིར་ཞེ་ན། སེམས་ཅན་དེ་དག་གིས་ནི་ཚེ་རབས་འདི་དང་སྔ་མའི་དུས་སུ་མི་དགེ་བའི་ལས་ཆེན་པོ་ངན་སོང་གསུམ་དུ་སྐྱེ་བར་འགྱུར་བའི་ལས་གང་དག་བྱས་པ་དེ་དག་ཐམས་ཅད་ཀྱི་འབྲས་བུ་ནི་ཚེ་འདི་ཉིད་ཀྱི་ཐོག་མ་སྨིན་ཏེ་སྡུག་བསྔལ་གྱིས་མནར་བ་དེའི་སྟོབས་ཀྱིས་ཚེ་རབས་སྔ་མའི་མི་དགེ་བའི་ལས་དེ་དག་ཐམས་ཅད་འབྱང་བ་སྟེ་དག་པར་འགྱུར་ཏེ། སངས་རྒྱས་ཀྱི་བྱང་ཆུབ་ཀྱང་མྱུར་དུ་ཐོབ་པར་འགྱུར་རོ། །",
            "type": "source",
            "mapping": []
        },
        {
            "content": "རབ་འབྱོར་ངས་མངོན་པར་ཤེས་ཤིང་མཁྱེན་ཏེ། སྔོན་འདས་པའི་བསྐལ་བ་གྲངས་མེད་པའི་ཡང་ཆེས་གྲངས་མེད་པ་དང༌། སངས་རྒྱས་མར་མེ་མཛད་ཀྱི་སྔ་རོལ་གྱི་ཡང་ཆེས་སྔ་རོལ་གྱི་དུས་ན༑ སངས་རྒྱས་བྱེ་བ་ཁྲག་ཁྲིག་འབུམ་ཕྲག་བརྒྱད་ཅུ་རྩ་བཞི་དག་བྱུང་བ་དེ་དག་ངས་མཆོད་ཅིང་བསྙེན་བཀུར་བ་སོགས་ཀྱིས་ཐུགས་མཉེས་པར་བྱས་ཏེ། མི་མཉེས་པར་མ་བྱས་ཤིང་ཐུགས་སུན་ཕྱུང་པ་མ་བྱས་ཏེ། ངས་དེ་ལྟར་བྱས་པའི་བསོད་ནམས་དང༌། ཕྱི་མའི་དུས་ལྔ་བརྒྱའི་མཐའ་མ་ལ་མདོ་སྡེ་འདི་འབྲི་བ་སོགས་བྱེད་པའི་བསོད་ནམས་གང་ཡིན་པ་གཉིས་ལས།",
            "type": "source",
            "mapping": []
        },
        {
            "content": "རབ་འབྱོར་ངས་མངོན་པར་ཤེས་ཤིང་མཁྱེན་ཏེ། སྔོན་འདས་པའི་བསྐལ་བ་གྲངས་མེད་པའི་ཡང་ཆེས་གྲངས་མེད་པ་དང༌། སངས་རྒྱས་མར་མེ་མཛད་ཀྱི་སྔ་རོལ་གྱི་ཡང་ཆེས་སྔ་རོལ་གྱི་དུས་ན༑ སངས་རྒྱས་བྱེ་བ་ཁྲག་ཁྲིག་འབུམ་ཕྲག་བརྒྱད་ཅུ་རྩ་བཞི་དག་བྱུང་བ་དེ་དག་ངས་མཆོད་ཅིང་བསྙེན་བཀུར་བ་སོགས་ཀྱིས་ཐུགས་མཉེས་པར་བྱས་ཏེ། མི་མཉེས་པར་མ་བྱས་ཤིང་ཐུགས་སུན་ཕྱུང་པ་མ་བྱས་ཏེ། ངས་དེ་ལྟར་བྱས་པའི་བསོད་ནམས་དང༌། ཕྱི་མའི་དུས་ལྔ་བརྒྱའི་མཐའ་མ་ལ་མདོ་སྡེ་འདི་འབྲི་བ་སོགས་བྱེད་པའི་བསོད་ནམས་གང་ཡིན་པ་གཉིས་ལས།",
            "type": "source",
            "mapping": []
        },
        {
            "content": "རབ་འབྱོར་ངས་མངོན་པར་ཤེས་ཤིང་མཁྱེན་ཏེ། སྔོན་འདས་པའི་བསྐལ་བ་གྲངས་མེད་པའི་ཡང་ཆེས་གྲངས་མེད་པ་དང༌། སངས་རྒྱས་མར་མེ་མཛད་ཀྱི་སྔ་རོལ་གྱི་ཡང་ཆེས་སྔ་རོལ་གྱི་དུས་ན༑ སངས་རྒྱས་བྱེ་བ་ཁྲག་ཁྲིག་འབུམ་ཕྲག་བརྒྱད་ཅུ་རྩ་བཞི་དག་བྱུང་བ་དེ་དག་ངས་མཆོད་ཅིང་བསྙེན་བཀུར་བ་སོགས་ཀྱིས་ཐུགས་མཉེས་པར་བྱས་ཏེ། མི་མཉེས་པར་མ་བྱས་ཤིང་ཐུགས་སུན་ཕྱུང་པ་མ་བྱས་ཏེ། ངས་དེ་ལྟར་བྱས་པའི་བསོད་ནམས་དང༌། ཕྱི་མའི་དུས་ལྔ་བརྒྱའི་མཐའ་མ་ལ་མདོ་སྡེ་འདི་འབྲི་བ་སོགས་བྱེད་པའི་བསོད་ནམས་གང་ཡིན་པ་གཉིས་ལས།\n\n བསོད་ནམས་ཀྱི་ཕུང་པོ་ཕྱི་མ་འདི་ཆེ་སྟེ་བསོད་ནམས་ཀྱི་ཕུང་པོ་སྔོན་མས་འདི་ལ་ཆ་བརྒྱར་བགོས་པའི་བརྒྱའི་ཆ་སྟེ་ཆ་གཅིག་ཙམ་གྱི་བར་ཉེ་བར་མི་ཕོད་མི་འགྲོ་ཞིང༌། དེ་བཞིན་དུ་སྟོང་གི་ཆ་དང་འབུམ་གྱི་ཆ་དང་གྲངས་དང་ཚད་དང་བགྲང་བ་དང་དཔེ་དང་ཟླ་དང་རྒྱུར་ཡང་འགྲན་པར་མི་བཟོད་པ་སྟེ་མི་ནུས་སོ། །",
            "type": "source",
            "mapping": []
        },
        {
            "content": "བསོད་ནམས་ཀྱི་ཕུང་པོ་ཕྱི་མ་འདི་ཆེ་སྟེ་བསོད་ནམས་ཀྱི་ཕུང་པོ་སྔོན་མས་འདི་ལ་ཆ་བརྒྱར་བགོས་པའི་བརྒྱའི་ཆ་སྟེ་ཆ་གཅིག་ཙམ་གྱི་བར་ཉེ་བར་མི་ཕོད་མི་འགྲོ་ཞིང༌། དེ་བཞིན་དུ་སྟོང་གི་ཆ་དང་འབུམ་གྱི་ཆ་དང་གྲངས་དང་ཚད་དང་བགྲང་བ་དང་དཔེ་དང་ཟླ་དང་རྒྱུར་ཡང་འགྲན་པར་མི་བཟོད་པ་སྟེ་མི་ནུས་སོ། །",
            "type": "source",
            "mapping": []
        },
        {
            "content": "གལ་ཏེ་དེ་དག་གིས་བསོད་ནམས་ཀྱི་ཕུང་པོ་ཇི་སྙེད་ཅིག་རབ་ཏུ་བསྐྱེད་ཅིང་འཛིན་པར་འགྱུར་བའི་བསོད་ནམས་ཀྱི་ཕུང་པོ་འདི་ལྟ་བུའོ་ཞེས་ལེགས་པར་ཕྱེ་ཞིང་བརྗོད་ན།  བློ་དམན་པའི་སེམས་ཅན་རྣམས་ཡིད་མི་ཆེས་ཤིང་ཡིད་མྱོས་མྱོས་པོར་ཏེ་རྨོངས་ནས་སེམས་རབ་ཏུ་འཁྲུགས་པར་འགྱུར་རོ། །",
            "type": "source",
            "mapping": []
        },
        {
            "content": "ཆོས་ཀྱི་རྣམ་གྲངས་འདི་གཞུང་ཉུང་ཡང་དོན་རྒྱ་ཆེ་བས་བསམ་གྱིས་མི་ཁྱབ་ཅིང༌། འདིའི་དོན་ཉམས་སུ་བླངས་པའི་རྣམ་པར་སྨིན་པའི་འབྲས་བུ་ཡང་བསམ་གྱིས་མི་ཁྱབ་བོ། །རྣམ་པར་སྨིན་པའི་འབྲས་བུ་ཞེས་པའི་རྣམ་སྨིན་གྱི་འབྲས་བུ་ཁོ་ན་ལ་མི་བཟུང་གི །རྒྱུ་མཐུན་དང་བདག་འབྲས་དང་བྲལ་འབྲས་སོགས་ཀྱང་སྡུད་དོ། །འདི་ལྟ་བུ་ཞིག་གོང་དུ་ཡང་བྱུང་མོད། སྐབས་དོན་ཐ་དད་ལ་དགོངས་ནས་གསུངས་སོ། །",
            "type": "source",
            "mapping": []
        },
        {
            "content": "ཆོས་ཀྱི་རྣམ་གྲངས་འདི་གཞུང་ཉུང་ཡང་དོན་རྒྱ་ཆེ་བས་བསམ་གྱིས་མི་ཁྱབ་ཅིང༌། འདིའི་དོན་ཉམས་སུ་བླངས་པའི་རྣམ་པར་སྨིན་པའི་འབྲས་བུ་ཡང་བསམ་གྱིས་མི་ཁྱབ་བོ། །རྣམ་པར་སྨིན་པའི་འབྲས་བུ་ཞེས་པའི་རྣམ་སྨིན་གྱི་འབྲས་བུ་ཁོ་ན་ལ་མི་བཟུང་གི །རྒྱུ་མཐུན་དང་བདག་འབྲས་དང་བྲལ་འབྲས་སོགས་ཀྱང་སྡུད་དོ། །འདི་ལྟ་བུ་ཞིག་གོང་དུ་ཡང་བྱུང་མོད། སྐབས་དོན་ཐ་དད་ལ་དགོངས་ནས་གསུངས་སོ། །",
            "type": "source",
            "mapping": []
        },
        {
            "content": "ཆོས་ཀྱི་རྣམ་གྲངས་འདི་གཞུང་ཉུང་ཡང་དོན་རྒྱ་ཆེ་བས་བསམ་གྱིས་མི་ཁྱབ་ཅིང༌། འདིའི་དོན་ཉམས་སུ་བླངས་པའི་རྣམ་པར་སྨིན་པའི་འབྲས་བུ་ཡང་བསམ་གྱིས་མི་ཁྱབ་བོ། །རྣམ་པར་སྨིན་པའི་འབྲས་བུ་ཞེས་པའི་རྣམ་སྨིན་གྱི་འབྲས་བུ་ཁོ་ན་ལ་མི་བཟུང་གི །རྒྱུ་མཐུན་དང་བདག་འབྲས་དང་བྲལ་འབྲས་སོགས་ཀྱང་སྡུད་དོ། །འདི་ལྟ་བུ་ཞིག་གོང་དུ་ཡང་བྱུང་མོད། སྐབས་དོན་ཐ་དད་ལ་དགོངས་ནས་གསུངས་སོ། །",
            "type": "source",
            "mapping": []
        },
        {
            "content": "ཡང་བཅོམ་ལྡན་འདས་ཀྱིས་རབ་འབྱོར་ལ་བྱང་ཆུབ་སེམས་དཔའི་ཐེག་པ་ལ་ཞུགས་པས་ཇི་ལྟར་གནས་པར་བགྱི་ཞེས་སོགས་ཞུས་སོ། །སྔར་འདི་ལྟ་བུ་ཞིག་སོང་ཡང་ཚོགས་ལམ་དང་མོས་སྤྱོད་ཀྱི་སའི་དབང་དུ་མཛད་ལ།འདིར་ནི་མཐོང་ལམ་ཐོབ་པ་ལ་ཉེ་བ་དང་དེ་ཐོབ་པའི་སྐབས་ནས་དེ་ལྟར་བྱེད་པ་ལ་དགོངས་ནས་གསུངས་ཏེ་དོན་ནི་སྔར་བཤད་ཟིན་པ་ལྟར་རོ། །བྱང་ཆུབ་སེམས་དཔའི་ཐེག་པ་ལ་ཞུགས་པའི་ཆོས་དེ་གང་ཡང་བདེན་པར་གྲུབ་པ་མེད་དོ་ཞེས་མཇུག་བསྡུས་སོ། །",
            "type": "source",
            "mapping": []
        },
        {
            "content": "ཡང་བཅོམ་ལྡན་འདས་ཀྱིས་རབ་འབྱོར་ལ་བྱང་ཆུབ་སེམས་དཔའི་ཐེག་པ་ལ་ཞུགས་པས་ཇི་ལྟར་གནས་པར་བགྱི་ཞེས་སོགས་ཞུས་སོ། །སྔར་འདི་ལྟ་བུ་ཞིག་སོང་ཡང་ཚོགས་ལམ་དང་མོས་སྤྱོད་ཀྱི་སའི་དབང་དུ་མཛད་ལ།འདིར་ནི་མཐོང་ལམ་ཐོབ་པ་ལ་ཉེ་བ་དང་དེ་ཐོབ་པའི་སྐབས་ནས་དེ་ལྟར་བྱེད་པ་ལ་དགོངས་ནས་གསུངས་ཏེ་དོན་ནི་སྔར་བཤད་ཟིན་པ་ལྟར་རོ། །བྱང་ཆུབ་སེམས་དཔའི་ཐེག་པ་ལ་ཞུགས་པའི་ཆོས་དེ་གང་ཡང་བདེན་པར་གྲུབ་པ་མེད་དོ་ཞེས་མཇུག་བསྡུས་སོ། །",
            "type": "source",
            "mapping": []
        },
        {
            "content": "ཡང་བཅོམ་ལྡན་འདས་ཀྱིས་རབ་འབྱོར་ལ་བྱང་ཆུབ་སེམས་དཔའི་ཐེག་པ་ལ་ཞུགས་པས་ཇི་ལྟར་གནས་པར་བགྱི་ཞེས་སོགས་ཞུས་སོ། །སྔར་འདི་ལྟ་བུ་ཞིག་སོང་ཡང་ཚོགས་ལམ་དང་མོས་སྤྱོད་ཀྱི་སའི་དབང་དུ་མཛད་ལ།འདིར་ནི་མཐོང་ལམ་ཐོབ་པ་ལ་ཉེ་བ་དང་དེ་ཐོབ་པའི་སྐབས་ནས་དེ་ལྟར་བྱེད་པ་ལ་དགོངས་ནས་གསུངས་ཏེ་དོན་ནི་སྔར་བཤད་ཟིན་པ་ལྟར་རོ། །བྱང་ཆུབ་སེམས་དཔའི་ཐེག་པ་ལ་ཞུགས་པའི་ཆོས་དེ་གང་ཡང་བདེན་པར་གྲུབ་པ་མེད་དོ་ཞེས་མཇུག་བསྡུས་སོ། །",
            "type": "source",
            "mapping": []
        },
        {
            "content": "ཡང་བཅོམ་ལྡན་འདས་ཀྱིས་རབ་འབྱོར་ལ་བྱང་ཆུབ་སེམས་དཔའི་ཐེག་པ་ལ་ཞུགས་པས་ཇི་ལྟར་གནས་པར་བགྱི་ཞེས་སོགས་ཞུས་སོ། །སྔར་འདི་ལྟ་བུ་ཞིག་སོང་ཡང་ཚོགས་ལམ་དང་མོས་སྤྱོད་ཀྱི་སའི་དབང་དུ་མཛད་ལ།འདིར་ནི་མཐོང་ལམ་ཐོབ་པ་ལ་ཉེ་བ་དང་དེ་ཐོབ་པའི་སྐབས་ནས་དེ་ལྟར་བྱེད་པ་ལ་དགོངས་ནས་གསུངས་ཏེ་དོན་ནི་སྔར་བཤད་ཟིན་པ་ལྟར་རོ། །བྱང་ཆུབ་སེམས་དཔའི་ཐེག་པ་ལ་ཞུགས་པའི་ཆོས་དེ་གང་ཡང་བདེན་པར་གྲུབ་པ་མེད་དོ་ཞེས་མཇུག་བསྡུས་སོ། །",
            "type": "source",
            "mapping": []
        },
        {
            "content": "ཡང་བཅོམ་ལྡན་འདས་ཀྱིས་རབ་འབྱོར་ལ་བྱང་ཆུབ་སེམས་དཔའི་ཐེག་པ་ལ་ཞུགས་པས་ཇི་ལྟར་གནས་པར་བགྱི་ཞེས་སོགས་ཞུས་སོ། །སྔར་འདི་ལྟ་བུ་ཞིག་སོང་ཡང་ཚོགས་ལམ་དང་མོས་སྤྱོད་ཀྱི་སའི་དབང་དུ་མཛད་ལ།འདིར་ནི་མཐོང་ལམ་ཐོབ་པ་ལ་ཉེ་བ་དང་དེ་ཐོབ་པའི་སྐབས་ནས་དེ་ལྟར་བྱེད་པ་ལ་དགོངས་ནས་གསུངས་ཏེ་དོན་ནི་སྔར་བཤད་ཟིན་པ་ལྟར་རོ། །བྱང་ཆུབ་སེམས་དཔའི་ཐེག་པ་ལ་ཞུགས་པའི་ཆོས་དེ་གང་ཡང་བདེན་པར་གྲུབ་པ་མེད་དོ་ཞེས་མཇུག་བསྡུས་སོ། །",
            "type": "source",
            "mapping": []
        },
        {
            "content": "ཡང་བཅོམ་ལྡན་འདས་ཀྱིས་རབ་འབྱོར་ལ་བྱང་ཆུབ་སེམས་དཔའི་ཐེག་པ་ལ་ཞུགས་པས་ཇི་ལྟར་གནས་པར་བགྱི་ཞེས་སོགས་ཞུས་སོ། །སྔར་འདི་ལྟ་བུ་ཞིག་སོང་ཡང་ཚོགས་ལམ་དང་མོས་སྤྱོད་ཀྱི་སའི་དབང་དུ་མཛད་ལ།འདིར་ནི་མཐོང་ལམ་ཐོབ་པ་ལ་ཉེ་བ་དང་དེ་ཐོབ་པའི་སྐབས་ནས་དེ་ལྟར་བྱེད་པ་ལ་དགོངས་ནས་གསུངས་ཏེ་དོན་ནི་སྔར་བཤད་ཟིན་པ་ལྟར་རོ། །བྱང་ཆུབ་སེམས་དཔའི་ཐེག་པ་ལ་ཞུགས་པའི་ཆོས་དེ་གང་ཡང་བདེན་པར་གྲུབ་པ་མེད་དོ་ཞེས་མཇུག་བསྡུས་སོ། །",
            "type": "source",
            "mapping": []
        },
        {
            "content": "ཡང་བཅོམ་ལྡན་འདས་ཀྱིས་རབ་འབྱོར་ལ་བྱང་ཆུབ་སེམས་དཔའི་ཐེག་པ་ལ་ཞུགས་པས་ཇི་ལྟར་གནས་པར་བགྱི་ཞེས་སོགས་ཞུས་སོ། །སྔར་འདི་ལྟ་བུ་ཞིག་སོང་ཡང་ཚོགས་ལམ་དང་མོས་སྤྱོད་ཀྱི་སའི་དབང་དུ་མཛད་ལ།འདིར་ནི་མཐོང་ལམ་ཐོབ་པ་ལ་ཉེ་བ་དང་དེ་ཐོབ་པའི་སྐབས་ནས་དེ་ལྟར་བྱེད་པ་ལ་དགོངས་ནས་གསུངས་ཏེ་དོན་ནི་སྔར་བཤད་ཟིན་པ་ལྟར་རོ། །བྱང་ཆུབ་སེམས་དཔའི་ཐེག་པ་ལ་ཞུགས་པའི་ཆོས་དེ་གང་ཡང་བདེན་པར་གྲུབ་པ་མེད་དོ་ཞེས་མཇུག་བསྡུས་སོ། །",
            "type": "source",
            "mapping": []
        },
        {
            "content": "ཡང་བཅོམ་ལྡན་འདས་ཀྱིས་རབ་འབྱོར་ལ་བྱང་ཆུབ་སེམས་དཔའི་ཐེག་པ་ལ་ཞུགས་པས་ཇི་ལྟར་གནས་པར་བགྱི་ཞེས་སོགས་ཞུས་སོ། །སྔར་འདི་ལྟ་བུ་ཞིག་སོང་ཡང་ཚོགས་ལམ་དང་མོས་སྤྱོད་ཀྱི་སའི་དབང་དུ་མཛད་ལ།འདིར་ནི་མཐོང་ལམ་ཐོབ་པ་ལ་ཉེ་བ་དང་དེ་ཐོབ་པའི་སྐབས་ནས་དེ་ལྟར་བྱེད་པ་ལ་དགོངས་ནས་གསུངས་ཏེ་དོན་ནི་སྔར་བཤད་ཟིན་པ་ལྟར་རོ། །བྱང་ཆུབ་སེམས་དཔའི་ཐེག་པ་ལ་ཞུགས་པའི་ཆོས་དེ་གང་ཡང་བདེན་པར་གྲུབ་པ་མེད་དོ་ཞེས་མཇུག་བསྡུས་སོ། །",
            "type": "source",
            "mapping": []
        },
        {
            "content": "ཡང་བཅོམ་ལྡན་འདས་ཀྱིས་རབ་འབྱོར་ལ་བྱང་ཆུབ་སེམས་དཔའི་ཐེག་པ་ལ་ཞུགས་པས་ཇི་ལྟར་གནས་པར་བགྱི་ཞེས་སོགས་ཞུས་སོ། །སྔར་འདི་ལྟ་བུ་ཞིག་སོང་ཡང་ཚོགས་ལམ་དང་མོས་སྤྱོད་ཀྱི་སའི་དབང་དུ་མཛད་ལ།འདིར་ནི་མཐོང་ལམ་ཐོབ་པ་ལ་ཉེ་བ་དང་དེ་ཐོབ་པའི་སྐབས་ནས་དེ་ལྟར་བྱེད་པ་ལ་དགོངས་ནས་གསུངས་ཏེ་དོན་ནི་སྔར་བཤད་ཟིན་པ་ལྟར་རོ། །བྱང་ཆུབ་སེམས་དཔའི་ཐེག་པ་ལ་ཞུགས་པའི་ཆོས་དེ་གང་ཡང་བདེན་པར་གྲུབ་པ་མེད་དོ་ཞེས་མཇུག་བསྡུས་སོ། །",
            "type": "source",
            "mapping": []
        },
        {
            "content": "ཡང་རབ་འབྱོར་དེ་བཞིན་གཤེགས་པ་ངས་སྔོན་སངས་རྒྱས་མར་མེ་མཛད་ལས་ཆོས་གང་དོན་དམ་པར་བླངས་ནས་སངས་རྒྱས་པའི་ཆོས་དེ་གང་དག་ཡོད་སྙམ་མམ་ཞེས་དྲིས་པ་ན། ལན་དུ་རབ་འབྱོར་གྱིས་དེ་མ་མཆིས་སོ་ཞེས་གསོལ་བ་དང༌། བཅོམ་ལྡན་འདས་ཀྱིས་དེ་དེ་བཞིན་ནོ་ཞེས་ཚིག་དང༌། དེ་དེ་བཞིན་ནོ་ཞེས་དོན་ལ་བདེན་ཁ་གནང་སྟེ། དེ་ལྟ་བུའི་ཆོས་གང་ཡང་མེད་དོ། །",
            "type": "source",
            "mapping": []
        },
        {
            "content": "ཡང་རབ་འབྱོར་དེ་བཞིན་གཤེགས་པ་ངས་སྔོན་སངས་རྒྱས་མར་མེ་མཛད་ལས་ཆོས་གང་དོན་དམ་པར་བླངས་ནས་སངས་རྒྱས་པའི་ཆོས་དེ་གང་དག་ཡོད་སྙམ་མམ་ཞེས་དྲིས་པ་ན། ལན་དུ་རབ་འབྱོར་གྱིས་དེ་མ་མཆིས་སོ་ཞེས་གསོལ་བ་དང༌། བཅོམ་ལྡན་འདས་ཀྱིས་དེ་དེ་བཞིན་ནོ་ཞེས་ཚིག་དང༌། དེ་དེ་བཞིན་ནོ་ཞེས་དོན་ལ་བདེན་ཁ་གནང་སྟེ། དེ་ལྟ་བུའི་ཆོས་གང་ཡང་མེད་དོ། །",
            "type": "source",
            "mapping": []
        },
        {
            "content": "ཡང་རབ་འབྱོར་དེ་བཞིན་གཤེགས་པ་ངས་སྔོན་སངས་རྒྱས་མར་མེ་མཛད་ལས་ཆོས་གང་དོན་དམ་པར་བླངས་ནས་སངས་རྒྱས་པའི་ཆོས་དེ་གང་དག་ཡོད་སྙམ་མམ་ཞེས་དྲིས་པ་ན། ལན་དུ་རབ་འབྱོར་གྱིས་དེ་མ་མཆིས་སོ་ཞེས་གསོལ་བ་དང༌། བཅོམ་ལྡན་འདས་ཀྱིས་དེ་དེ་བཞིན་ནོ་ཞེས་ཚིག་དང༌། དེ་དེ་བཞིན་ནོ་ཞེས་དོན་ལ་བདེན་ཁ་གནང་སྟེ། དེ་ལྟ་བུའི་ཆོས་གང་ཡང་མེད་དོ། །",
            "type": "source",
            "mapping": []
        },
        {
            "content": "ཡང་རབ་འབྱོར་དེ་བཞིན་གཤེགས་པ་ངས་སྔོན་སངས་རྒྱས་མར་མེ་མཛད་ལས་ཆོས་གང་དོན་དམ་པར་བླངས་ནས་སངས་རྒྱས་པའི་ཆོས་དེ་གང་དག་ཡོད་སྙམ་མམ་ཞེས་དྲིས་པ་ན། ལན་དུ་རབ་འབྱོར་གྱིས་དེ་མ་མཆིས་སོ་ཞེས་གསོལ་བ་དང༌། བཅོམ་ལྡན་འདས་ཀྱིས་དེ་དེ་བཞིན་ནོ་ཞེས་ཚིག་དང༌། དེ་དེ་བཞིན་ནོ་ཞེས་དོན་ལ་བདེན་ཁ་གནང་སྟེ། དེ་ལྟ་བུའི་ཆོས་གང་ཡང་མེད་དོ། །",
            "type": "source",
            "mapping": []
        },
        {
            "content": "ཡང་རབ་འབྱོར་དེ་བཞིན་གཤེགས་པ་ངས་སྔོན་སངས་རྒྱས་མར་མེ་མཛད་ལས་ཆོས་གང་དོན་དམ་པར་བླངས་ནས་སངས་རྒྱས་པའི་ཆོས་དེ་གང་དག་ཡོད་སྙམ་མམ་ཞེས་དྲིས་པ་ན། ལན་དུ་རབ་འབྱོར་གྱིས་དེ་མ་མཆིས་སོ་ཞེས་གསོལ་བ་དང༌། བཅོམ་ལྡན་འདས་ཀྱིས་དེ་དེ་བཞིན་ནོ་ཞེས་ཚིག་དང༌། དེ་དེ་བཞིན་ནོ་ཞེས་དོན་ལ་བདེན་ཁ་གནང་སྟེ། དེ་ལྟ་བུའི་ཆོས་གང་ཡང་མེད་དོ། །",
            "type": "source",
            "mapping": []
        },
        {
            "content": "ཡང་རབ་འབྱོར་དེ་བཞིན་གཤེགས་པ་ངས་སྔོན་སངས་རྒྱས་མར་མེ་མཛད་ལས་ཆོས་གང་དོན་དམ་པར་བླངས་ནས་སངས་རྒྱས་པའི་ཆོས་དེ་གང་དག་ཡོད་སྙམ་མམ་ཞེས་དྲིས་པ་ན། ལན་དུ་རབ་འབྱོར་གྱིས་དེ་མ་མཆིས་སོ་ཞེས་གསོལ་བ་དང༌། བཅོམ་ལྡན་འདས་ཀྱིས་དེ་དེ་བཞིན་ནོ་ཞེས་ཚིག་དང༌། དེ་དེ་བཞིན་ནོ་ཞེས་དོན་ལ་བདེན་ཁ་གནང་སྟེ། དེ་ལྟ་བུའི་ཆོས་གང་ཡང་མེད་དོ། །",
            "type": "source",
            "mapping": []
        },
        {
            "content": "ཡང་རབ་འབྱོར་དེ་བཞིན་གཤེགས་པ་ངས་སྔོན་སངས་རྒྱས་མར་མེ་མཛད་ལས་ཆོས་གང་དོན་དམ་པར་བླངས་ནས་སངས་རྒྱས་པའི་ཆོས་དེ་གང་དག་ཡོད་སྙམ་མམ་ཞེས་དྲིས་པ་ན། ལན་དུ་རབ་འབྱོར་གྱིས་དེ་མ་མཆིས་སོ་ཞེས་གསོལ་བ་དང༌། བཅོམ་ལྡན་འདས་ཀྱིས་དེ་དེ་བཞིན་ནོ་ཞེས་ཚིག་དང༌། དེ་དེ་བཞིན་ནོ་ཞེས་དོན་ལ་བདེན་ཁ་གནང་སྟེ། དེ་ལྟ་བུའི་ཆོས་གང་ཡང་མེད་དོ། །",
            "type": "source",
            "mapping": []
        },
        {
            "content": "གལ་ཏེ་དེ་འདྲ་བའི་ཆོས་འགའ་ཞིག་ཡོད་པར་གྱུར་ན་ནི།   དེ་བཞིན་གཤེགས་པ་མར་མེ་མཛད་ཀྱིས་ང་ལ་བྲམ་ཟེའི་ཁྱེའུ་ཁྱོད་མ་འོངས་པའི་དུས་འདི་ཙམ་ནས་སངས་རྒྱས་ཤཱཀྱ་ཐུབ་པ་ཞེས་བྱ་བར་འགྱུར་རོ་ཞེས་ལུང་མི་སྟོན་པ་ཞིག་ན། མངོན་པར་རྫོགས་པར་སངས་རྒྱས་པའི་ཆོས་གང་ཡང་བདེན་པར་གྲུབ་པ་མེད་པའི་ཕྱིར་ན། དེའི་ཚེ་དེ་བཞིན་གཤེགས་པ་མར་མེ་མཛད་ཀྱིས་ང་ལ་དེ་ལྟར་བྱང་ཆུབ་ཏུ་ལུང་བསྟན་ཏོ། །",
            "type": "source",
            "mapping": []
        },
        {
            "content": "གལ་ཏེ་དེ་འདྲ་བའི་ཆོས་འགའ་ཞིག་ཡོད་པར་གྱུར་ན་ནི།   དེ་བཞིན་གཤེགས་པ་མར་མེ་མཛད་ཀྱིས་ང་ལ་བྲམ་ཟེའི་ཁྱེའུ་ཁྱོད་མ་འོངས་པའི་དུས་འདི་ཙམ་ནས་སངས་རྒྱས་ཤཱཀྱ་ཐུབ་པ་ཞེས་བྱ་བར་འགྱུར་རོ་ཞེས་ལུང་མི་སྟོན་པ་ཞིག་ན། མངོན་པར་རྫོགས་པར་སངས་རྒྱས་པའི་ཆོས་གང་ཡང་བདེན་པར་གྲུབ་པ་མེད་པའི་ཕྱིར་ན། དེའི་ཚེ་དེ་བཞིན་གཤེགས་པ་མར་མེ་མཛད་ཀྱིས་ང་ལ་དེ་ལྟར་བྱང་ཆུབ་ཏུ་ལུང་བསྟན་ཏོ། །",
            "type": "source",
            "mapping": []
        },
        {
            "content": "གལ་ཏེ་དེ་འདྲ་བའི་ཆོས་འགའ་ཞིག་ཡོད་པར་གྱུར་ན་ནི།   དེ་བཞིན་གཤེགས་པ་མར་མེ་མཛད་ཀྱིས་ང་ལ་བྲམ་ཟེའི་ཁྱེའུ་ཁྱོད་མ་འོངས་པའི་དུས་འདི་ཙམ་ནས་སངས་རྒྱས་ཤཱཀྱ་ཐུབ་པ་ཞེས་བྱ་བར་འགྱུར་རོ་ཞེས་ལུང་མི་སྟོན་པ་ཞིག་ན། མངོན་པར་རྫོགས་པར་སངས་རྒྱས་པའི་ཆོས་གང་ཡང་བདེན་པར་གྲུབ་པ་མེད་པའི་ཕྱིར་ན། དེའི་ཚེ་དེ་བཞིན་གཤེགས་པ་མར་མེ་མཛད་ཀྱིས་ང་ལ་དེ་ལྟར་བྱང་ཆུབ་ཏུ་ལུང་བསྟན་ཏོ། །",
            "type": "source",
            "mapping": []
        },
        {
            "content": "ལུང་སྟོན་པའི་རྒྱུ་མཚན་ལ་དེ་ཅིའི་ཕྱིར་ཞེ་ན། དེ་བཞིན་གཤེགས་པ་ཞེས་བརྗོད་པ་དེ་ནི་ཆོས་ཐམས་ཅད་བདེན་པས་སྟོང་པ་ཡང་དག་པའི་དེ་བཞིན་ཉིད་ཁོང་དུ་ཆུད་པའི་ཡེ་ཤེས་ཀྱི་ཚིག་བླ་དྭགས་ཏེ་དེའི་སྒོ་ནས་བརྗོད་པའི་ཕྱིར་རོ། །བསྡུ་ན་དེ་བཞིན་གཤེགས་པ་ཞེས་པའི་དོན་ནི་སྒྲིབ་གཉིས་སྤངས་པའི་དེ་བཞིན་ཉིད་མངོན་དུ་བྱས་ཤིང་ཁོང་དུ་ཆུད་པ་སྟེ། ཐུགས་དེ་བཞིན་ཉིད་ཇི་ལྟ་བ་དེ་བཞིན་དུ་གཤེགས་པའམ་མཁྱེན་པའི་དོན་ནོ། །",
            "type": "source",
            "mapping": []
        },
        {
            "content": "སེམས་ཅན་ལ་ལ་ཞིག་འདི་སྐད་དུ་དེ་བཞིན་གཤེགས་པ་ནི་དོན་དམ་པར་བྱང་ཆུབ་ཏུ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་སོ་ཞེས་ཟེར་ན་ཚིག་དེ་ལོག་པར་སྨྲ་བ་ཉིད་ཡིན་ནོ། །",
            "type": "source",
            "mapping": []
        },
        {
            "content": "སེམས་ཅན་ལ་ལ་ཞིག་འདི་སྐད་དུ་དེ་བཞིན་གཤེགས་པ་ནི་དོན་དམ་པར་བྱང་ཆུབ་ཏུ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་སོ་ཞེས་ཟེར་ན་ཚིག་དེ་ལོག་པར་སྨྲ་བ་ཉིད་ཡིན་ནོ། །",
            "type": "source",
            "mapping": []
        },
        {
            "content": "རྒྱུ་མཚན་ནི་དོན་དམ་པར་སངས་རྒྱས་པའི་ཆོས་དེ་གང་ཡང་མེད་པའི་ཕྱིར་རོ། །འདི་ལྟ་བུ་ཞིག་གོང་དུ་སོང་ཡང་སྐབས་སོ་སོ་དང་སྦྱར་བ་སྟེ། ཚིག་ལ་ཟློས་པ་ཡོད་ཀྱང་དོན་ལ་ཟློས་སྐྱོན་མེད་ཅིང༌། འདིའི་དོན་ལེགས་པར་ཤེས་པ་ནི་རྩ་བ་རང་བཞིན་མེད་པའི་དོན་ཤེས་པ་ལ་ཐུག་གོ །",
            "type": "source",
            "mapping": []
        },
        {
            "content": "དེ་བཞིན་གཤེགས་པས་ཆོས་གང་སངས་རྒྱས་པའམ་བསྟན་པ་དེ་ལ་རང་བཞིན་གྱིས་གྲུབ་པའི་དོན་དམ་པའི་ཆོས་བདེན་པ་ཡང་མེད་ཅིང༌། དེར་གྲུབ་པའི་ཀུན་རྫོབ་པའི་ཆོས་རྫུན་པ་ཡང་མེད་དོ། །འདི་ལ་འཆད་ཚུལ་མི་འདྲ་བ་གཞན་ཞིག་ཀྱང་སྣང་ངོ༌། །",
            "type": "source",
            "mapping": []
        },
        {
            "content": "རྒྱུ་མཚན་དེ་བས་ན་བདེན་གཉིས་ཀྱི་བསྡུས་པའི་ཆོས་ཐམས་ཅད་ཁྱད་པར་མེད་པར་རང་བཞིན་གྱིས་སྟོང་པ་དེ་བཞིན་གཤེགས་པས་ཁོང་དུ་ཆུད་ཅིང་མངོན་དུ་མཛད་ཅིང༌། དེའི་དབང་དུ་བྱས་ན་ཆོས་ཐམས་ཅད་བདེན་པས་སྟོང་པའི་དེ་བཞིན་ཉིད་ནི་སངས་རྒྱས་ཀྱི་ཆོས་སྐུ་དང་འདྲ་བས་ཆོས་ཐམས་ཅད་ལ་སངས་རྒྱས་ཀྱི་ཆོས་ཞེས་བྱའོ། །",
            "type": "source",
            "mapping": []
        },
        {
            "content": "རྒྱུ་མཚན་དེ་བས་ན་བདེན་གཉིས་ཀྱི་བསྡུས་པའི་ཆོས་ཐམས་ཅད་ཁྱད་པར་མེད་པར་རང་བཞིན་གྱིས་སྟོང་པ་དེ་བཞིན་གཤེགས་པས་ཁོང་དུ་ཆུད་ཅིང་མངོན་དུ་མཛད་ཅིང༌། དེའི་དབང་དུ་བྱས་ན་ཆོས་ཐམས་ཅད་བདེན་པས་སྟོང་པའི་དེ་བཞིན་ཉིད་ནི་སངས་རྒྱས་ཀྱི་ཆོས་སྐུ་དང་འདྲ་བས་ཆོས་ཐམས་ཅད་ལ་སངས་རྒྱས་ཀྱི་ཆོས་ཞེས་བྱའོ། །",
            "type": "source",
            "mapping": []
        },
        {
            "content": "རྒྱུ་མཚན་དེ་བས་ན་བདེན་གཉིས་ཀྱི་བསྡུས་པའི་ཆོས་ཐམས་ཅད་ཁྱད་པར་མེད་པར་རང་བཞིན་གྱིས་སྟོང་པ་དེ་བཞིན་གཤེགས་པས་ཁོང་དུ་ཆུད་ཅིང་མངོན་དུ་མཛད་ཅིང༌། དེའི་དབང་དུ་བྱས་ན་ཆོས་ཐམས་ཅད་བདེན་པས་སྟོང་པའི་དེ་བཞིན་ཉིད་ནི་སངས་རྒྱས་ཀྱི་ཆོས་སྐུ་དང་འདྲ་བས་ཆོས་ཐམས་ཅད་ལ་སངས་རྒྱས་ཀྱི་ཆོས་ཞེས་བྱའོ། །",
            "type": "source",
            "mapping": []
        },
        {
            "content": "དེ་ལ་དཔེ་སྟོན་པ་ནི། སྐྱེས་བུ་ཞིག་མིའི་ལུས་དང་ལྡན་ཞིང་ལུས་ཆེན་པོར་གྱུར་པ་བཞིན་ནོ་ཞེས་གསུངས། སློབ་དཔོན་ཀ་མ་ལ་ཤཱི་ལས་འདིའི་དོན་ལ་ལུས་དང་ལྡན་པ་ནི་བྱང་སེམས་ཀྱི་ལུས་དང་ལུས་ཆེན་པོ་སངས་རྒྱས་ཀྱི་སྐུ་ལ་སྦྱར་བ་ལྟར་སྣང་ལ། འདི་ལྟར་བཤད་པར་བྱ་སྟེ།",
            "type": "source",
            "mapping": []
        },
        {
            "content": "དེ་ནས་རབ་འབྱོར་གྱིས་དེ་ལྟ་བུའི་དཔེའི་ལུས་དེ་དོན་དམ་པར་ལུས་སུ་མ་གྲུབ་ཀྱང༌། ཐ་སྙད་དུ་དེ་ལྟར་འཇོག་གོ་ཞེས་ཞུས་པ་ན་བཅོམ་ལྡན་འདས་ཀྱིས་དེ་དེ་བཞིན་ནོ་ཞེས་སོགས་གནང་ངོ༌། །",
            "type": "source",
            "mapping": []
        },
        {
            "content": "དེ་ནས་རབ་འབྱོར་གྱིས་དེ་ལྟ་བུའི་དཔེའི་ལུས་དེ་དོན་དམ་པར་ལུས་སུ་མ་གྲུབ་ཀྱང༌། ཐ་སྙད་དུ་དེ་ལྟར་འཇོག་གོ་ཞེས་ཞུས་པ་ན་བཅོམ་ལྡན་འདས་ཀྱིས་དེ་དེ་བཞིན་ནོ་ཞེས་སོགས་གནང་ངོ༌། །",
            "type": "source",
            "mapping": []
        },
        {
            "content": "དེ་ནས་རབ་འབྱོར་གྱིས་དེ་ལྟ་བུའི་དཔེའི་ལུས་དེ་དོན་དམ་པར་ལུས་སུ་མ་གྲུབ་ཀྱང༌། ཐ་སྙད་དུ་དེ་ལྟར་འཇོག་གོ་ཞེས་ཞུས་པ་ན་བཅོམ་ལྡན་འདས་ཀྱིས་དེ་དེ་བཞིན་ནོ་ཞེས་སོགས་གནང་ངོ༌། །",
            "type": "source",
            "mapping": []
        },
        {
            "content": "ཡང༌། བྱང་ཆུབ་སེམས་དཔས་ཐ་སྙད་སྒྱུ་མ་ལྟ་བུའི་ཚུལ་གྱིས་སེམས་ཅན་དཔག་ཏུ་མེད་པ་མི་གནས་པའི་མྱང་འདས་ལ་འགོད་པར་སེམས་བསྐྱེད་དགོས་ཀྱང༌། དོན་དམ་པར་སེམས་ཅན་གང་ཡང་དེ་ལ་འགོད་པ་མེད་ཅེས་སྟོན་པ་ནི། བྱང་ཆུབ་སེམས་དཔའ་གང་ཞིག་འདི་སྙམ་དུ། བདེན་ཞེན་གྱིས་བདག་གིས་སེམས་ཅན་རྣམས་ཡོངས་སུ་མྱ་ངན་ལས་འདའོ་ཟེར་ན། དེ་བདག་མེད་ཀྱི་དོན་ཤེས་པའི་བྱང་ཆུབ་སེམས་དཔའ་ཞེས་མི་བྱའོ། །",
            "type": "source",
            "mapping": []
        },
        {
            "content": "རྒྱུ་མཚན་ནི་དོན་དམ་པར་བྱང་ཆུབ་སེམས་དཔའ་ཞེས་བྱ་བའི་ཆོས་དེ་གང་ཡང་ཡོད་སྙམ་མམ་ཞེས་དྲིས་པ་ན།",
            "type": "source",
            "mapping": []
        },
        {
            "content": "ལན་དུ་རབ་འབྱོར་དེ་ལྟ་བུ་ཡོད་པ་མ་ལགས་ཞེས་གསོལ།  བཅོམ་ལྡན་འདས་ཀྱིས་རབ་འབྱོར་ལ་དེ་མེད་པའི་རྒྱུ་མཚན་དེ་བས་ན་དེ་བཞིན་གཤེགས་པ་ཀུན་བྱང་གི་ཆོས་ཐམས་ཅད་གང་ཟག་གི་བདག་ཏུ་གྲུབ་པའི་སེམས་ཅན་མེད་པ། སྲོག་མེད་པ། གང་ཟག་མེད་པའོ་ཞེས་གསུངས་སོ། །བསྡུས་ན་བདག་ནི་ཐོབ་པར་བྱེད་པའོ། །",
            "type": "source",
            "mapping": []
        },
        {
            "content": "ལན་དུ་རབ་འབྱོར་དེ་ལྟ་བུ་ཡོད་པ་མ་ལགས་ཞེས་གསོལ།  བཅོམ་ལྡན་འདས་ཀྱིས་རབ་འབྱོར་ལ་དེ་མེད་པའི་རྒྱུ་མཚན་དེ་བས་ན་དེ་བཞིན་གཤེགས་པ་ཀུན་བྱང་གི་ཆོས་ཐམས་ཅད་གང་ཟག་གི་བདག་ཏུ་གྲུབ་པའི་སེམས་ཅན་མེད་པ། སྲོག་མེད་པ། གང་ཟག་མེད་པའོ་ཞེས་གསུངས་སོ། །བསྡུས་ན་བདག་ནི་ཐོབ་པར་བྱེད་པའོ། །",
            "type": "source",
            "mapping": []
        },
        {
            "content": "རབ་འབྱོར་བྱང་ཆུབ་སེམས་དཔའ་གང་ཞིག་འདི་སྙམ་དུ། བདག་གིས་གང་དུ་འཚང་རྒྱ་བའི་གནས་ཀྱི་ཞིང་གི་བཀོད་པ་ཕུན་སུམ་ཚོགས་པ་རྣམ་པར་དོན་དམ་པར་བསྒྲུབ་པར་བྱའོ་ཞེས་ཞེན་ཅིང་ཚིག་གིས་ཟེར་ན།དེ་ཡང་དེ་བཞིན་དུ་བརྗོད་ཅིང་ཞེན་པར་བྱར་མི་རུང་ངོ༌། །",
            "type": "source",
            "mapping": []
        },
        {
            "content": "རྒྱུ་མཚན་ལ་ཞིང་གི་བཀོད་པ་དེ་དག་ནི། ཀུན་རྫོབ་ཏུ་ཚོགས་ཤིང་འདུས་པ་སྒྱུ་མ་ལྟར་ཡོད་པ་ལས་གཞན་བདེན་པར་གྲུབ་པའི་བཀོད་པ་མེད་པར་དེ་བཞིན་གཤེགས་པས་གསུངས་པའི་ཕྱིར་ཏེ། དེས་ན་ཐ་སྙད་དུ་ཞིང་བཀོད་པ་རྣམས་ཞེས་བྱའོ། ། བྱང་ཆུབ་སེམས་དཔའ་གང་ཞིག་འདི་སྙམ་དུ་གཟུགས་སོགས་ཀྱི་ཆོས་རྣམས་ནི། གང་ཟག་གི་བདག་མེད་པ་དང༌། ཆོས་ཀྱི་བདག་མེད་པའོ་སྙམ་དུ་མོས་ཤིང་རྟོགས་པ་དེ་ནི། དེ་བཞིན་གཤེགས་པས་བདག་མེད་རྟོགས་པའི་བྱང་ཆུབ་སེམས་དཔའ་ཆེན་པོ་ཞེས་བརྗོད་དོ། ། འདིས་ཀྱང་བདག་མེད་གཉིས་སྒོམ་དགོས་པར་བཤད་དོ། །",
            "type": "source",
            "mapping": []
        },
        {
            "content": "རྒྱུ་མཚན་ལ་ཞིང་གི་བཀོད་པ་དེ་དག་ནི། ཀུན་རྫོབ་ཏུ་ཚོགས་ཤིང་འདུས་པ་སྒྱུ་མ་ལྟར་ཡོད་པ་ལས་གཞན་བདེན་པར་གྲུབ་པའི་བཀོད་པ་མེད་པར་དེ་བཞིན་གཤེགས་པས་གསུངས་པའི་ཕྱིར་ཏེ། དེས་ན་ཐ་སྙད་དུ་ཞིང་བཀོད་པ་རྣམས་ཞེས་བྱའོ། ། བྱང་ཆུབ་སེམས་དཔའ་གང་ཞིག་འདི་སྙམ་དུ་གཟུགས་སོགས་ཀྱི་ཆོས་རྣམས་ནི། གང་ཟག་གི་བདག་མེད་པ་དང༌། ཆོས་ཀྱི་བདག་མེད་པའོ་སྙམ་དུ་མོས་ཤིང་རྟོགས་པ་དེ་ནི། དེ་བཞིན་གཤེགས་པས་བདག་མེད་རྟོགས་པའི་བྱང་ཆུབ་སེམས་དཔའ་ཆེན་པོ་ཞེས་བརྗོད་དོ། ། འདིས་ཀྱང་བདག་མེད་གཉིས་སྒོམ་དགོས་པར་བཤད་དོ། །",
            "type": "source",
            "mapping": []
        },
        {
            "content": "རྒྱུ་མཚན་ལ་ཞིང་གི་བཀོད་པ་དེ་དག་ནི། ཀུན་རྫོབ་ཏུ་ཚོགས་ཤིང་འདུས་པ་སྒྱུ་མ་ལྟར་ཡོད་པ་ལས་གཞན་བདེན་པར་གྲུབ་པའི་བཀོད་པ་མེད་པར་དེ་བཞིན་གཤེགས་པས་གསུངས་པའི་ཕྱིར་ཏེ། དེས་ན་ཐ་སྙད་དུ་ཞིང་བཀོད་པ་རྣམས་ཞེས་བྱའོ། ། བྱང་ཆུབ་སེམས་དཔའ་གང་ཞིག་འདི་སྙམ་དུ་གཟུགས་སོགས་ཀྱི་ཆོས་རྣམས་ནི། གང་ཟག་གི་བདག་མེད་པ་དང༌། ཆོས་ཀྱི་བདག་མེད་པའོ་སྙམ་དུ་མོས་ཤིང་རྟོགས་པ་དེ་ནི། དེ་བཞིན་གཤེགས་པས་བདག་མེད་རྟོགས་པའི་བྱང་ཆུབ་སེམས་དཔའ་ཆེན་པོ་ཞེས་བརྗོད་དོ། ། འདིས་ཀྱང་བདག་མེད་གཉིས་སྒོམ་དགོས་པར་བཤད་དོ། །",
            "type": "source",
            "mapping": []
        },
        {
            "content": "འོ་ན་དེ་བཞིན་གཤེགས་པ་ལ་བདག་མེད་ཀྱི་དོན་གཟིགས་པའི་མཁྱེན་པ་ཇི་ལྟར་ཡོད་སྙམ་ན། དེ་བཞིན་གཤེགས་པ་ལ་སྤྱན་ལྔ་ཁྱད་པར་ཅན་ཡོད་དོ་ཞེས་སྟོན་པ་ནི། བཅོམ་ལྡན་འདས་ཀྱིས་རབ་འབྱོར་ལ་དེ་བཞིན་གཤེགས་པ་ལ་ཤའི་སྤྱན་དང༌། ལྷ་དང༌། ཤེས་རབ་དང༌། ཆོས་དང༌། སངས་རྒྱས་སྤྱན་མངའམ་ཞེས་དྲིས་པ་ན།",
            "type": "source",
            "mapping": []
        },
        {
            "content": "ལན་དུ་རབ་འབྱོར་གྱིས་དེ་བཞིན་གཤེགས་པ་ལ་དེ་དག་མངའོ་ཞེས་གསོལ་ཏོ། །",
            "type": "source",
            "mapping": []
        },
        {
            "content": "སྤྱིར་སྤྱན་ལྔས་ཡུལ་མཐོང་ཚུལ་ལ་རྒྱ་ཆེ་ཆུང་ཡོད་ཀྱང་འདིར་སངས་རྒྱས་དང་སྦྱར་ན། ཤའི་སྤྱན་གྱིས་ནི་འཇིག་རྟེན་ཁམས་ཀྱི་གཟུགས་ཕྲ་རགས་ཐམས་ཅད་མངོན་སུམ་དུ་གཟིགས་ཤིང༌། ལྷའི་སྤྱན་གྱིས་སེམས་ཅན་རྣམས་ཀྱི་སྐྱེ་འཆིའི་རིམ་པ་སོགས་དང༌། ཤེས་རབ་ཀྱི་སྤྱན་གྱིས་བདག་མེད་ཕྲ་རགས་ཐམས་ཅད་དང༌།  སྤྱན་གྱིས་ཀུན་རྫོབ་པའི་རབ་དབྱེ་ཐམས་ཅད་དང༌། སངས་རྒྱས་ཀྱི་སྤྱན་གྱིས་ནི་བདེན་གཉིས་ཀྱིས་བསྡུས་པའི་ཆོས་ཐམས་ཅད་ཇི་ལྟ་བ་བཞིན་དུ་མངོན་སུམ་དུ་གཟིགས་པའོ། །",
            "type": "source",
            "mapping": []
        },
        {
            "content": "སྤྱིར་སྤྱན་ལྔས་ཡུལ་མཐོང་ཚུལ་ལ་རྒྱ་ཆེ་ཆུང་ཡོད་ཀྱང་འདིར་སངས་རྒྱས་དང་སྦྱར་ན། ཤའི་སྤྱན་གྱིས་ནི་འཇིག་རྟེན་ཁམས་ཀྱི་གཟུགས་ཕྲ་རགས་ཐམས་ཅད་མངོན་སུམ་དུ་གཟིགས་ཤིང༌། ལྷའི་སྤྱན་གྱིས་སེམས་ཅན་རྣམས་ཀྱི་སྐྱེ་འཆིའི་རིམ་པ་སོགས་དང༌། ཤེས་རབ་ཀྱི་སྤྱན་གྱིས་བདག་མེད་ཕྲ་རགས་ཐམས་ཅད་དང༌།  སྤྱན་གྱིས་ཀུན་རྫོབ་པའི་རབ་དབྱེ་ཐམས་ཅད་དང༌། སངས་རྒྱས་ཀྱི་སྤྱན་གྱིས་ནི་བདེན་གཉིས་ཀྱིས་བསྡུས་པའི་ཆོས་ཐམས་ཅད་ཇི་ལྟ་བ་བཞིན་དུ་མངོན་སུམ་དུ་གཟིགས་པའོ། །",
            "type": "source",
            "mapping": []
        },
        {
            "content": "སྤྱིར་སྤྱན་ལྔས་ཡུལ་མཐོང་ཚུལ་ལ་རྒྱ་ཆེ་ཆུང་ཡོད་ཀྱང་འདིར་སངས་རྒྱས་དང་སྦྱར་ན། ཤའི་སྤྱན་གྱིས་ནི་འཇིག་རྟེན་ཁམས་ཀྱི་གཟུགས་ཕྲ་རགས་ཐམས་ཅད་མངོན་སུམ་དུ་གཟིགས་ཤིང༌། ལྷའི་སྤྱན་གྱིས་སེམས་ཅན་རྣམས་ཀྱི་སྐྱེ་འཆིའི་རིམ་པ་སོགས་དང༌། ཤེས་རབ་ཀྱི་སྤྱན་གྱིས་བདག་མེད་ཕྲ་རགས་ཐམས་ཅད་དང༌།  སྤྱན་གྱིས་ཀུན་རྫོབ་པའི་རབ་དབྱེ་ཐམས་ཅད་དང༌། སངས་རྒྱས་ཀྱི་སྤྱན་གྱིས་ནི་བདེན་གཉིས་ཀྱིས་བསྡུས་པའི་ཆོས་ཐམས་ཅད་ཇི་ལྟ་བ་བཞིན་དུ་མངོན་སུམ་དུ་གཟིགས་པའོ། །",
            "type": "source",
            "mapping": []
        },
        {
            "content": "སྤྱིར་སྤྱན་ལྔས་ཡུལ་མཐོང་ཚུལ་ལ་རྒྱ་ཆེ་ཆུང་ཡོད་ཀྱང་འདིར་སངས་རྒྱས་དང་སྦྱར་ན། ཤའི་སྤྱན་གྱིས་ནི་འཇིག་རྟེན་ཁམས་ཀྱི་གཟུགས་ཕྲ་རགས་ཐམས་ཅད་མངོན་སུམ་དུ་གཟིགས་ཤིང༌། ལྷའི་སྤྱན་གྱིས་སེམས་ཅན་རྣམས་ཀྱི་སྐྱེ་འཆིའི་རིམ་པ་སོགས་དང༌། ཤེས་རབ་ཀྱི་སྤྱན་གྱིས་བདག་མེད་ཕྲ་རགས་ཐམས་ཅད་དང༌།  སྤྱན་གྱིས་ཀུན་རྫོབ་པའི་རབ་དབྱེ་ཐམས་ཅད་དང༌། སངས་རྒྱས་ཀྱི་སྤྱན་གྱིས་ནི་བདེན་གཉིས་ཀྱིས་བསྡུས་པའི་ཆོས་ཐམས་ཅད་ཇི་ལྟ་བ་བཞིན་དུ་མངོན་སུམ་དུ་གཟིགས་པའོ། །",
            "type": "source",
            "mapping": []
        },
        {
            "content": "སྤྱིར་སྤྱན་ལྔས་ཡུལ་མཐོང་ཚུལ་ལ་རྒྱ་ཆེ་ཆུང་ཡོད་ཀྱང་འདིར་སངས་རྒྱས་དང་སྦྱར་ན། ཤའི་སྤྱན་གྱིས་ནི་འཇིག་རྟེན་ཁམས་ཀྱི་གཟུགས་ཕྲ་རགས་ཐམས་ཅད་མངོན་སུམ་དུ་གཟིགས་ཤིང༌། ལྷའི་སྤྱན་གྱིས་སེམས་ཅན་རྣམས་ཀྱི་སྐྱེ་འཆིའི་རིམ་པ་སོགས་དང༌། ཤེས་རབ་ཀྱི་སྤྱན་གྱིས་བདག་མེད་ཕྲ་རགས་ཐམས་ཅད་དང༌།  སྤྱན་གྱིས་ཀུན་རྫོབ་པའི་རབ་དབྱེ་ཐམས་ཅད་དང༌། སངས་རྒྱས་ཀྱི་སྤྱན་གྱིས་ནི་བདེན་གཉིས་ཀྱིས་བསྡུས་པའི་ཆོས་ཐམས་ཅད་ཇི་ལྟ་བ་བཞིན་དུ་མངོན་སུམ་དུ་གཟིགས་པའོ། །",
            "type": "source",
            "mapping": []
        },
        {
            "content": "སྤྱིར་སྤྱན་ལྔས་ཡུལ་མཐོང་ཚུལ་ལ་རྒྱ་ཆེ་ཆུང་ཡོད་ཀྱང་འདིར་སངས་རྒྱས་དང་སྦྱར་ན། ཤའི་སྤྱན་གྱིས་ནི་འཇིག་རྟེན་ཁམས་ཀྱི་གཟུགས་ཕྲ་རགས་ཐམས་ཅད་མངོན་སུམ་དུ་གཟིགས་ཤིང༌། ལྷའི་སྤྱན་གྱིས་སེམས་ཅན་རྣམས་ཀྱི་སྐྱེ་འཆིའི་རིམ་པ་སོགས་དང༌། ཤེས་རབ་ཀྱི་སྤྱན་གྱིས་བདག་མེད་ཕྲ་རགས་ཐམས་ཅད་དང༌།  སྤྱན་གྱིས་ཀུན་རྫོབ་པའི་རབ་དབྱེ་ཐམས་ཅད་དང༌། སངས་རྒྱས་ཀྱི་སྤྱན་གྱིས་ནི་བདེན་གཉིས་ཀྱིས་བསྡུས་པའི་ཆོས་ཐམས་ཅད་ཇི་ལྟ་བ་བཞིན་དུ་མངོན་སུམ་དུ་གཟིགས་པའོ། །",
            "type": "source",
            "mapping": []
        },
        {
            "content": "སྤྱིར་སྤྱན་ལྔས་ཡུལ་མཐོང་ཚུལ་ལ་རྒྱ་ཆེ་ཆུང་ཡོད་ཀྱང་འདིར་སངས་རྒྱས་དང་སྦྱར་ན། ཤའི་སྤྱན་གྱིས་ནི་འཇིག་རྟེན་ཁམས་ཀྱི་གཟུགས་ཕྲ་རགས་ཐམས་ཅད་མངོན་སུམ་དུ་གཟིགས་ཤིང༌། ལྷའི་སྤྱན་གྱིས་སེམས་ཅན་རྣམས་ཀྱི་སྐྱེ་འཆིའི་རིམ་པ་སོགས་དང༌། ཤེས་རབ་ཀྱི་སྤྱན་གྱིས་བདག་མེད་ཕྲ་རགས་ཐམས་ཅད་དང༌།  སྤྱན་གྱིས་ཀུན་རྫོབ་པའི་རབ་དབྱེ་ཐམས་ཅད་དང༌། སངས་རྒྱས་ཀྱི་སྤྱན་གྱིས་ནི་བདེན་གཉིས་ཀྱིས་བསྡུས་པའི་ཆོས་ཐམས་ཅད་ཇི་ལྟ་བ་བཞིན་དུ་མངོན་སུམ་དུ་གཟིགས་པའོ། །",
            "type": "source",
            "mapping": []
        },
        {
            "content": "སྤྱིར་སྤྱན་ལྔས་ཡུལ་མཐོང་ཚུལ་ལ་རྒྱ་ཆེ་ཆུང་ཡོད་ཀྱང་འདིར་སངས་རྒྱས་དང་སྦྱར་ན། ཤའི་སྤྱན་གྱིས་ནི་འཇིག་རྟེན་ཁམས་ཀྱི་གཟུགས་ཕྲ་རགས་ཐམས་ཅད་མངོན་སུམ་དུ་གཟིགས་ཤིང༌། ལྷའི་སྤྱན་གྱིས་སེམས་ཅན་རྣམས་ཀྱི་སྐྱེ་འཆིའི་རིམ་པ་སོགས་དང༌། ཤེས་རབ་ཀྱི་སྤྱན་གྱིས་བདག་མེད་ཕྲ་རགས་ཐམས་ཅད་དང༌།  སྤྱན་གྱིས་ཀུན་རྫོབ་པའི་རབ་དབྱེ་ཐམས་ཅད་དང༌། སངས་རྒྱས་ཀྱི་སྤྱན་གྱིས་ནི་བདེན་གཉིས་ཀྱིས་བསྡུས་པའི་ཆོས་ཐམས་ཅད་ཇི་ལྟ་བ་བཞིན་དུ་མངོན་སུམ་དུ་གཟིགས་པའོ། །",
            "type": "source",
            "mapping": []
        },
        {
            "content": "སྤྱིར་སྤྱན་ལྔས་ཡུལ་མཐོང་ཚུལ་ལ་རྒྱ་ཆེ་ཆུང་ཡོད་ཀྱང་འདིར་སངས་རྒྱས་དང་སྦྱར་ན། ཤའི་སྤྱན་གྱིས་ནི་འཇིག་རྟེན་ཁམས་ཀྱི་གཟུགས་ཕྲ་རགས་ཐམས་ཅད་མངོན་སུམ་དུ་གཟིགས་ཤིང༌། ལྷའི་སྤྱན་གྱིས་སེམས་ཅན་རྣམས་ཀྱི་སྐྱེ་འཆིའི་རིམ་པ་སོགས་དང༌། ཤེས་རབ་ཀྱི་སྤྱན་གྱིས་བདག་མེད་ཕྲ་རགས་ཐམས་ཅད་དང༌།  སྤྱན་གྱིས་ཀུན་རྫོབ་པའི་རབ་དབྱེ་ཐམས་ཅད་དང༌། སངས་རྒྱས་ཀྱི་སྤྱན་གྱིས་ནི་བདེན་གཉིས་ཀྱིས་བསྡུས་པའི་ཆོས་ཐམས་ཅད་ཇི་ལྟ་བ་བཞིན་དུ་མངོན་སུམ་དུ་གཟིགས་པའོ། །",
            "type": "source",
            "mapping": []
        },
        {
            "content": "སྤྱིར་སྤྱན་ལྔས་ཡུལ་མཐོང་ཚུལ་ལ་རྒྱ་ཆེ་ཆུང་ཡོད་ཀྱང་འདིར་སངས་རྒྱས་དང་སྦྱར་ན། ཤའི་སྤྱན་གྱིས་ནི་འཇིག་རྟེན་ཁམས་ཀྱི་གཟུགས་ཕྲ་རགས་ཐམས་ཅད་མངོན་སུམ་དུ་གཟིགས་ཤིང༌། ལྷའི་སྤྱན་གྱིས་སེམས་ཅན་རྣམས་ཀྱི་སྐྱེ་འཆིའི་རིམ་པ་སོགས་དང༌། ཤེས་རབ་ཀྱི་སྤྱན་གྱིས་བདག་མེད་ཕྲ་རགས་ཐམས་ཅད་དང༌།  སྤྱན་གྱིས་ཀུན་རྫོབ་པའི་རབ་དབྱེ་ཐམས་ཅད་དང༌། སངས་རྒྱས་ཀྱི་སྤྱན་གྱིས་ནི་བདེན་གཉིས་ཀྱིས་བསྡུས་པའི་ཆོས་ཐམས་ཅད་ཇི་ལྟ་བ་བཞིན་དུ་མངོན་སུམ་དུ་གཟིགས་པའོ། །",
            "type": "source",
            "mapping": []
        },
        {
            "content": "སྤྱིར་སྤྱན་ལྔས་ཡུལ་མཐོང་ཚུལ་ལ་རྒྱ་ཆེ་ཆུང་ཡོད་ཀྱང་འདིར་སངས་རྒྱས་དང་སྦྱར་ན། ཤའི་སྤྱན་གྱིས་ནི་འཇིག་རྟེན་ཁམས་ཀྱི་གཟུགས་ཕྲ་རགས་ཐམས་ཅད་མངོན་སུམ་དུ་གཟིགས་ཤིང༌། ལྷའི་སྤྱན་གྱིས་སེམས་ཅན་རྣམས་ཀྱི་སྐྱེ་འཆིའི་རིམ་པ་སོགས་དང༌། ཤེས་རབ་ཀྱི་སྤྱན་གྱིས་བདག་མེད་ཕྲ་རགས་ཐམས་ཅད་དང༌།  སྤྱན་གྱིས་ཀུན་རྫོབ་པའི་རབ་དབྱེ་ཐམས་ཅད་དང༌། སངས་རྒྱས་ཀྱི་སྤྱན་གྱིས་ནི་བདེན་གཉིས་ཀྱིས་བསྡུས་པའི་ཆོས་ཐམས་ཅད་ཇི་ལྟ་བ་བཞིན་དུ་མངོན་སུམ་དུ་གཟིགས་པའོ། །",
            "type": "source",
            "mapping": []
        },
        {
            "content": "སྤྱིར་སྤྱན་ལྔས་ཡུལ་མཐོང་ཚུལ་ལ་རྒྱ་ཆེ་ཆུང་ཡོད་ཀྱང་འདིར་སངས་རྒྱས་དང་སྦྱར་ན། ཤའི་སྤྱན་གྱིས་ནི་འཇིག་རྟེན་ཁམས་ཀྱི་གཟུགས་ཕྲ་རགས་ཐམས་ཅད་མངོན་སུམ་དུ་གཟིགས་ཤིང༌། ལྷའི་སྤྱན་གྱིས་སེམས་ཅན་རྣམས་ཀྱི་སྐྱེ་འཆིའི་རིམ་པ་སོགས་དང༌། ཤེས་རབ་ཀྱི་སྤྱན་གྱིས་བདག་མེད་ཕྲ་རགས་ཐམས་ཅད་དང༌།  སྤྱན་གྱིས་ཀུན་རྫོབ་པའི་རབ་དབྱེ་ཐམས་ཅད་དང༌། སངས་རྒྱས་ཀྱི་སྤྱན་གྱིས་ནི་བདེན་གཉིས་ཀྱིས་བསྡུས་པའི་ཆོས་ཐམས་ཅད་ཇི་ལྟ་བ་བཞིན་དུ་མངོན་སུམ་དུ་གཟིགས་པའོ། །",
            "type": "source",
            "mapping": []
        },
        {
            "content": "སྤྱིར་སྤྱན་ལྔས་ཡུལ་མཐོང་ཚུལ་ལ་རྒྱ་ཆེ་ཆུང་ཡོད་ཀྱང་འདིར་སངས་རྒྱས་དང་སྦྱར་ན། ཤའི་སྤྱན་གྱིས་ནི་འཇིག་རྟེན་ཁམས་ཀྱི་གཟུགས་ཕྲ་རགས་ཐམས་ཅད་མངོན་སུམ་དུ་གཟིགས་ཤིང༌། ལྷའི་སྤྱན་གྱིས་སེམས་ཅན་རྣམས་ཀྱི་སྐྱེ་འཆིའི་རིམ་པ་སོགས་དང༌། ཤེས་རབ་ཀྱི་སྤྱན་གྱིས་བདག་མེད་ཕྲ་རགས་ཐམས་ཅད་དང༌།  སྤྱན་གྱིས་ཀུན་རྫོབ་པའི་རབ་དབྱེ་ཐམས་ཅད་དང༌། སངས་རྒྱས་ཀྱི་སྤྱན་གྱིས་ནི་བདེན་གཉིས་ཀྱིས་བསྡུས་པའི་ཆོས་ཐམས་ཅད་ཇི་ལྟ་བ་བཞིན་དུ་མངོན་སུམ་དུ་གཟིགས་པའོ། །",
            "type": "source",
            "mapping": []
        },
        {
            "content": "སྤྱིར་སྤྱན་ལྔས་ཡུལ་མཐོང་ཚུལ་ལ་རྒྱ་ཆེ་ཆུང་ཡོད་ཀྱང་འདིར་སངས་རྒྱས་དང་སྦྱར་ན། ཤའི་སྤྱན་གྱིས་ནི་འཇིག་རྟེན་ཁམས་ཀྱི་གཟུགས་ཕྲ་རགས་ཐམས་ཅད་མངོན་སུམ་དུ་གཟིགས་ཤིང༌། ལྷའི་སྤྱན་གྱིས་སེམས་ཅན་རྣམས་ཀྱི་སྐྱེ་འཆིའི་རིམ་པ་སོགས་དང༌། ཤེས་རབ་ཀྱི་སྤྱན་གྱིས་བདག་མེད་ཕྲ་རགས་ཐམས་ཅད་དང༌།  སྤྱན་གྱིས་ཀུན་རྫོབ་པའི་རབ་དབྱེ་ཐམས་ཅད་དང༌། སངས་རྒྱས་ཀྱི་སྤྱན་གྱིས་ནི་བདེན་གཉིས་ཀྱིས་བསྡུས་པའི་ཆོས་ཐམས་ཅད་ཇི་ལྟ་བ་བཞིན་དུ་མངོན་སུམ་དུ་གཟིགས་པའོ། །",
            "type": "source",
            "mapping": []
        },
        {
            "content": "སྤྱིར་སྤྱན་ལྔས་ཡུལ་མཐོང་ཚུལ་ལ་རྒྱ་ཆེ་ཆུང་ཡོད་ཀྱང་འདིར་སངས་རྒྱས་དང་སྦྱར་ན། ཤའི་སྤྱན་གྱིས་ནི་འཇིག་རྟེན་ཁམས་ཀྱི་གཟུགས་ཕྲ་རགས་ཐམས་ཅད་མངོན་སུམ་དུ་གཟིགས་ཤིང༌། ལྷའི་སྤྱན་གྱིས་སེམས་ཅན་རྣམས་ཀྱི་སྐྱེ་འཆིའི་རིམ་པ་སོགས་དང༌། ཤེས་རབ་ཀྱི་སྤྱན་གྱིས་བདག་མེད་ཕྲ་རགས་ཐམས་ཅད་དང༌།  སྤྱན་གྱིས་ཀུན་རྫོབ་པའི་རབ་དབྱེ་ཐམས་ཅད་དང༌། སངས་རྒྱས་ཀྱི་སྤྱན་གྱིས་ནི་བདེན་གཉིས་ཀྱིས་བསྡུས་པའི་ཆོས་ཐམས་ཅད་ཇི་ལྟ་བ་བཞིན་དུ་མངོན་སུམ་དུ་གཟིགས་པའོ། །",
            "type": "source",
            "mapping": []
        },
        {
            "content": "དེ་བཞིན་གཤེགས་པ་ལ་སྤྱན་དེ་ལྟ་བུ་མངའ་བས་ཆོས་ཐམས་ཅད་གཟིགས་ཤིང༌། སེམས་ཅན་རྣམས་ཀྱི་སེམས་རྒྱུད་ཀྱང་གཟིགས་སོ་ཞེས་སྟོན་པ་ནི། བཅོམ་ལྡན་འདས་ཀྱིས་རབ་འབྱོར་ལ་དཔེར་ན་གངྒཱའི་ཀླུང་གི་བྱེ་མའི་གྲངས་མང་པོ་ཇི་སྙེད་ཡོད་པ་དེ་ཙམ་དུ། གངྒཱའི་ཀླུང་ཡང་གྲངས་དེ་སྙེད་ཁོ་ནར་གྱུར་ན་འཇིག་རྟེན་གྱི་ཁམས་དེ་དག་མང་ངམ་ཞེས་དྲིས་པ་ན།",
            "type": "source",
            "mapping": []
        },
        {
            "content": "དེ་བཞིན་གཤེགས་པ་ལ་སྤྱན་དེ་ལྟ་བུ་མངའ་བས་ཆོས་ཐམས་ཅད་གཟིགས་ཤིང༌། སེམས་ཅན་རྣམས་ཀྱི་སེམས་རྒྱུད་ཀྱང་གཟིགས་སོ་ཞེས་སྟོན་པ་ནི། བཅོམ་ལྡན་འདས་ཀྱིས་རབ་འབྱོར་ལ་དཔེར་ན་གངྒཱའི་ཀླུང་གི་བྱེ་མའི་གྲངས་མང་པོ་ཇི་སྙེད་ཡོད་པ་དེ་ཙམ་དུ། གངྒཱའི་ཀླུང་ཡང་གྲངས་དེ་སྙེད་ཁོ་ནར་གྱུར་ན་འཇིག་རྟེན་གྱི་ཁམས་དེ་དག་མང་ངམ་ཞེས་དྲིས་པ་ན།",
            "type": "source",
            "mapping": []
        },
        {
            "content": "ལན་དུ་རབ་འབྱོར་གྱིས་མང་ཞེས་ཞུས་པས། བཅོམ་ལྡན་འདས་ཀྱིས་འཇིག་རྟེན་གྱི་ཁམས་དེ་དག་ཐམས་ཅད་ན་ཡོད་པའི་སེམས་ཅན་དེ་དག་གི་བསམ་པ་སྣ་ཚོགས་པ་མི་འདྲ་བ་ཐ་དད་པའི་སེམས་ཀྱི་རྒྱུན་དང་རྣམ་པ་ངས་རབ་ཏུ་ཤེས་སོ།",
            "type": "source",
            "mapping": []
        },
        {
            "content": "ལན་དུ་རབ་འབྱོར་གྱིས་མང་ཞེས་ཞུས་པས། བཅོམ་ལྡན་འདས་ཀྱིས་འཇིག་རྟེན་གྱི་ཁམས་དེ་དག་ཐམས་ཅད་ན་ཡོད་པའི་སེམས་ཅན་དེ་དག་གི་བསམ་པ་སྣ་ཚོགས་པ་མི་འདྲ་བ་ཐ་དད་པའི་སེམས་ཀྱི་རྒྱུན་དང་རྣམ་པ་ངས་རབ་ཏུ་ཤེས་སོ།",
            "type": "source",
            "mapping": []
        },
        {
            "content": "ལན་དུ་རབ་འབྱོར་གྱིས་མང་ཞེས་ཞུས་པས། བཅོམ་ལྡན་འདས་ཀྱིས་འཇིག་རྟེན་གྱི་ཁམས་དེ་དག་ཐམས་ཅད་ན་ཡོད་པའི་སེམས་ཅན་དེ་དག་གི་བསམ་པ་སྣ་ཚོགས་པ་མི་འདྲ་བ་ཐ་དད་པའི་སེམས་ཀྱི་རྒྱུན་དང་རྣམ་པ་ངས་རབ་ཏུ་ཤེས་སོ།",
            "type": "source",
            "mapping": []
        },
        {
            "content": "དེ་ལྟར་ཡིན་ཀྱང་སེམས་ཅན་གྱི་སེམས་ཀྱི་རྒྱུན་ནི་དོན་དམ་པར་རྒྱུན་ཞེས་བྱ་བར་གྲུབ་པ་མེད་པར་ངས་བཤད་དེ། དོན་དམ་པར་མེད་པ་དེས་ན་ཐ་སྙད་དུ་སེམས་ཀྱི་རྒྱུན་ཞེས་བྱ་བར་བརྗོད་དོ། །འདིས་སྤྱན་ལྔ་དང་སྤྱན་ལྔའི་ཡུལ་རྣམས་ཀྱང་ཐ་སྙད་ཙམ་དུ་འཇོག་གི །དོན་དམ་པར་མ་གྲུབ་ཅེས་བསྟན་ཏོ། །",
            "type": "source",
            "mapping": []
        },
        {
            "content": "དེ་ལྟར་ཡིན་ཀྱང་སེམས་ཅན་གྱི་སེམས་ཀྱི་རྒྱུན་ནི་དོན་དམ་པར་རྒྱུན་ཞེས་བྱ་བར་གྲུབ་པ་མེད་པར་ངས་བཤད་དེ། དོན་དམ་པར་མེད་པ་དེས་ན་ཐ་སྙད་དུ་སེམས་ཀྱི་རྒྱུན་ཞེས་བྱ་བར་བརྗོད་དོ། །འདིས་སྤྱན་ལྔ་དང་སྤྱན་ལྔའི་ཡུལ་རྣམས་ཀྱང་ཐ་སྙད་ཙམ་དུ་འཇོག་གི །དོན་དམ་པར་མ་གྲུབ་ཅེས་བསྟན་ཏོ། །",
            "type": "source",
            "mapping": []
        },
        {
            "content": "འདས་པའི་སེམས་རྣམས་ནི་འདས་ཟིན་པའི་ཕྱིར་དོན་དམ་པར་དམིགས་སུ་མེད། མ་འོངས་པའི་སེམས་རྣམས་ཀྱང་ད་ལྟ་མ་སྐྱེས་ཤིང་མ་བྱུང་བའི་ཕྱིར་དོན་དམ་པར་མེད། ད་ལྟར་བྱུང་བའི་སེམས་རྣམས་ཀྱང་རང་དབང་གིས་མེད་པའི་ཕྱིར་དོན་དམ་པར་མེད་དོ། །",
            "type": "source",
            "mapping": []
        },
        {
            "content": "འདས་པའི་སེམས་རྣམས་ནི་འདས་ཟིན་པའི་ཕྱིར་དོན་དམ་པར་དམིགས་སུ་མེད། མ་འོངས་པའི་སེམས་རྣམས་ཀྱང་ད་ལྟ་མ་སྐྱེས་ཤིང་མ་བྱུང་བའི་ཕྱིར་དོན་དམ་པར་མེད། ད་ལྟར་བྱུང་བའི་སེམས་རྣམས་ཀྱང་རང་དབང་གིས་མེད་པའི་ཕྱིར་དོན་དམ་པར་མེད་དོ། །",
            "type": "source",
            "mapping": []
        },
        {
            "content": "འདས་པའི་སེམས་རྣམས་ནི་འདས་ཟིན་པའི་ཕྱིར་དོན་དམ་པར་དམིགས་སུ་མེད། མ་འོངས་པའི་སེམས་རྣམས་ཀྱང་ད་ལྟ་མ་སྐྱེས་ཤིང་མ་བྱུང་བའི་ཕྱིར་དོན་དམ་པར་མེད། ད་ལྟར་བྱུང་བའི་སེམས་རྣམས་ཀྱང་རང་དབང་གིས་མེད་པའི་ཕྱིར་དོན་དམ་པར་མེད་དོ། །",
            "type": "source",
            "mapping": []
        },
        {
            "content": "གལ་ཏེ་སེམས་ཀྱི་རྒྱུན་རང་བཞིན་གྱིས་མེད་ན། སེམས་ལ་བརྟེན་ནས་སྦྱིན་པ་བཏང་བ་སོགས་ལས་འབྲས་བུ་མི་འབྱུང་ངམ་སྙམ་པ་ལ་སེམས་ཀྱི་རྒྱུན་སོགས་རང་བཞིན་གྱིས་མེད་ཀྱང་ཐ་སྙད་དུ་སེམས་ལ་བརྟེན་ནས་འབྲས་བུ་འབྱིན་ནོ་ཞེས་སྟོན་པ་ནི།  བཅོམ་ལྡན་འདས་ཀྱི་རབ་འབྱོར་ལ་གང་གིས་སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་འདི་གསེར་དང་དངུལ་སོགས་སྔར་བཤད་པའི་རིན་པོ་ཆེ་སྣ་བདུན་གྱི་གང་བར་བྱས་ཏེ་གཞན་ལ་སྦྱིན་པ་བྱིན་ན། དེ་ལ་བསོད་ནམས་མང་དུ་བསྐྱེད་དམ་ཞེས་དྲིས་པ་ན།",
            "type": "source",
            "mapping": []
        },
        {
            "content": "གལ་ཏེ་སེམས་ཀྱི་རྒྱུན་རང་བཞིན་གྱིས་མེད་ན། སེམས་ལ་བརྟེན་ནས་སྦྱིན་པ་བཏང་བ་སོགས་ལས་འབྲས་བུ་མི་འབྱུང་ངམ་སྙམ་པ་ལ་སེམས་ཀྱི་རྒྱུན་སོགས་རང་བཞིན་གྱིས་མེད་ཀྱང་ཐ་སྙད་དུ་སེམས་ལ་བརྟེན་ནས་འབྲས་བུ་འབྱིན་ནོ་ཞེས་སྟོན་པ་ནི།  བཅོམ་ལྡན་འདས་ཀྱི་རབ་འབྱོར་ལ་གང་གིས་སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་འདི་གསེར་དང་དངུལ་སོགས་སྔར་བཤད་པའི་རིན་པོ་ཆེ་སྣ་བདུན་གྱི་གང་བར་བྱས་ཏེ་གཞན་ལ་སྦྱིན་པ་བྱིན་ན། དེ་ལ་བསོད་ནམས་མང་དུ་བསྐྱེད་དམ་ཞེས་དྲིས་པ་ན།",
            "type": "source",
            "mapping": []
        },
        {
            "content": "ལན་དུ་དེ་མང་ངོ་ཞེས་གསོལ་ནས། རབ་འབྱོར་ལ་དེ་དེ་བཞིན་ནོ་ཞེས་སོགས་བདེན་ཁ་བྱིན་ནོ། །",
            "type": "source",
            "mapping": []
        },
        {
            "content": "ལན་དུ་དེ་མང་ངོ་ཞེས་གསོལ་ནས། རབ་འབྱོར་ལ་དེ་དེ་བཞིན་ནོ་ཞེས་སོགས་བདེན་ཁ་བྱིན་ནོ། །",
            "type": "source",
            "mapping": []
        },
        {
            "content": "ལན་དུ་དེ་མང་ངོ་ཞེས་གསོལ་ནས། རབ་འབྱོར་ལ་དེ་དེ་བཞིན་ནོ་ཞེས་སོགས་བདེན་ཁ་བྱིན་ནོ། །",
            "type": "source",
            "mapping": []
        },
        {
            "content": "བསོད་ནམས་ཀྱི་ཕུང་པོ་དེ་དག་ནི་ཐ་སྙད་དུ་སྒྱུ་མ་ལྟར་ཚོགས་པ་ལས་བྱུང་བ་ཡིན་གྱི། དེ་ལྟ་བུ་ལ་མ་ལྟོས་པར་གལ་ཏེ་རང་གི་ངོ་བོ་ཉིད་ཀྱིས་གྲུབ་ན་བསོད་ནམས་ཀྱི་ཕུང་པོ་ཞེས་དེ་བཞིན་གཤེགས་པས་མི་གསུང་ངོ༌། །",
            "type": "source",
            "mapping": []
        },
        {
            "content": "བསོད་ནམས་ཀྱི་ཕུང་པོ་དེ་དག་ནི་ཐ་སྙད་དུ་སྒྱུ་མ་ལྟར་ཚོགས་པ་ལས་བྱུང་བ་ཡིན་གྱི། དེ་ལྟ་བུ་ལ་མ་ལྟོས་པར་གལ་ཏེ་རང་གི་ངོ་བོ་ཉིད་ཀྱིས་གྲུབ་ན་བསོད་ནམས་ཀྱི་ཕུང་པོ་ཞེས་དེ་བཞིན་གཤེགས་པས་མི་གསུང་ངོ༌། །",
            "type": "source",
            "mapping": []
        },
        {
            "content": "གལ་ཏེ་བསོད་ནམས་ཀྱི་ཕུང་པོ་བདེན་པར་མེད་ན་དེ་ལས་འཁྲུངས་པའི་སངས་རྒྱས་ཀྱི་གཟུགས་ཀྱི་སྐུ་ཡང་མེད་པར་འགྱུར་རོ་སྙམ་ན་དེ་མི་འགྱུར་ཞེས་སྟོན་པ་ནི། གཟུགས་ཀྱི་སྐུ་ཡོངས་སུ་གྲུབ་པ་འདི་ལ་དོན་དམ་པར་དེ་བཞིན་གཤེགས་པར་བལྟ་བ་སྟེ་བཟུང་ཞིང་འདོད་པར་བྱ་སྙམ་མམ་ཞེས་དྲིས་པ་ན།",
            "type": "source",
            "mapping": []
        },
        {
            "content": "གལ་ཏེ་བསོད་ནམས་ཀྱི་ཕུང་པོ་བདེན་པར་མེད་ན་དེ་ལས་འཁྲུངས་པའི་སངས་རྒྱས་ཀྱི་གཟུགས་ཀྱི་སྐུ་ཡང་མེད་པར་འགྱུར་རོ་སྙམ་ན་དེ་མི་འགྱུར་ཞེས་སྟོན་པ་ནི། གཟུགས་ཀྱི་སྐུ་ཡོངས་སུ་གྲུབ་པ་འདི་ལ་དོན་དམ་པར་དེ་བཞིན་གཤེགས་པར་བལྟ་བ་སྟེ་བཟུང་ཞིང་འདོད་པར་བྱ་སྙམ་མམ་ཞེས་དྲིས་པ་ན།",
            "type": "source",
            "mapping": []
        },
        {
            "content": "ལན་དུ་དེ་ནི་མ་ལགས་ཏེ། དེ་ལ་དེ་ལྟར་བལྟ་བར་མི་བགྱི་ལགས་སོ་ཞེས་གསོལ།",
            "type": "source",
            "mapping": []
        },
        {
            "content": "ལན་དུ་དེ་ནི་མ་ལགས་ཏེ། དེ་ལ་དེ་ལྟར་བལྟ་བར་མི་བགྱི་ལགས་སོ་ཞེས་གསོལ།",
            "type": "source",
            "mapping": []
        },
        {
            "content": "རྒྱུ་མཚན་ནི་གཟུགས་ཀྱི་སྐུ་ཡང་རྒྱུ་རྐྱེན་ཚོགས་པ་ལས་གྲུབ་ཀྱི། དོན་དམ་པར་གྲུབ་པ་མ་མཆིས་པ་བསོད་ནམས་ཀྱི་ཕུང་པོ་དང་འདྲ་སྟེ། ཐ་སྙད་དུ་གཟུགས་ཀྱི་སྐུར་གྲུབ་པ་ཞེས་བརྗོད་དོ། །",
            "type": "source",
            "mapping": []
        },
        {
            "content": "རྒྱུ་མཚན་ནི་གཟུགས་ཀྱི་སྐུ་ཡང་རྒྱུ་རྐྱེན་ཚོགས་པ་ལས་གྲུབ་ཀྱི། དོན་དམ་པར་གྲུབ་པ་མ་མཆིས་པ་བསོད་ནམས་ཀྱི་ཕུང་པོ་དང་འདྲ་སྟེ། ཐ་སྙད་དུ་གཟུགས་ཀྱི་སྐུར་གྲུབ་པ་ཞེས་བརྗོད་དོ། །",
            "type": "source",
            "mapping": []
        },
        {
            "content": "གལ་ཏེ་གཟུགས་ཀྱི་སྐུ་ཞིག་ཡོད་ན་དེའི་མཚན་དཔེ་རྣམས་བདེན་གྲུབ་ཏུ་ཡོད་སྙམ་ན་དེ་མེད་ཅེས་སྟོན་པ་ནི། མཚན་དཔེ་ཕུན་སུམ་ཚོགས་པས་དེ་བཞིན་གཤེགས་པར་བལྟ་བར་བྱ་སྙམ་མམ་ཞེས་དྲིས་པའི་ལན་དུ་དེ་ལྟར་བལྟ་བར་མི་བྱའོ། །",
            "type": "source",
            "mapping": []
        },
        {
            "content": "གལ་ཏེ་གཟུགས་ཀྱི་སྐུ་ཞིག་ཡོད་ན་དེའི་མཚན་དཔེ་རྣམས་བདེན་གྲུབ་ཏུ་ཡོད་སྙམ་ན་དེ་མེད་ཅེས་སྟོན་པ་ནི། མཚན་དཔེ་ཕུན་སུམ་ཚོགས་པས་དེ་བཞིན་གཤེགས་པར་བལྟ་བར་བྱ་སྙམ་མམ་ཞེས་དྲིས་པའི་ལན་དུ་དེ་ལྟར་བལྟ་བར་མི་བྱའོ། །",
            "type": "source",
            "mapping": []
        },
        {
            "content": "གལ་ཏེ་གཟུགས་ཀྱི་སྐུ་ཞིག་ཡོད་ན་དེའི་མཚན་དཔེ་རྣམས་བདེན་གྲུབ་ཏུ་ཡོད་སྙམ་ན་དེ་མེད་ཅེས་སྟོན་པ་ནི། མཚན་དཔེ་ཕུན་སུམ་ཚོགས་པས་དེ་བཞིན་གཤེགས་པར་བལྟ་བར་བྱ་སྙམ་མམ་ཞེས་དྲིས་པའི་ལན་དུ་དེ་ལྟར་བལྟ་བར་མི་བྱའོ། །",
            "type": "source",
            "mapping": []
        },
        {
            "content": "གལ་ཏེ་གཟུགས་ཀྱི་སྐུ་ཞིག་ཡོད་ན་དེའི་མཚན་དཔེ་རྣམས་བདེན་གྲུབ་ཏུ་ཡོད་སྙམ་ན་དེ་མེད་ཅེས་སྟོན་པ་ནི། མཚན་དཔེ་ཕུན་སུམ་ཚོགས་པས་དེ་བཞིན་གཤེགས་པར་བལྟ་བར་བྱ་སྙམ་མམ་ཞེས་དྲིས་པའི་ལན་དུ་དེ་ལྟར་བལྟ་བར་མི་བྱའོ། །",
            "type": "source",
            "mapping": []
        },
        {
            "content": "དེ་བཞིན་གཤེགས་པའི་སྐུ་ལ་མཚན་དཔེ་ཕུན་སུམ་ཚོགས་པ་བདེན་གྲུབ་ཏུ་ཡོད་པའི་སྒོ་ནས་དེ་བཞིན་གཤེགས་པར་བདེན་ཞེན་གྱིས་མི་བལྟ་སྟེ། མཚན་དཔེ་ཕུན་སུམ་ཚོགས་པ་དེ་དག་ནི་ཚོགས་ཤིང་འདུས་པའི་དངོས་པོ་སྒྱུ་མ་ལྟར་གྲུབ་པས་དོན་དམ་པར་མཚན་དཔེ་ཕུན་སུམ་ཚོགས་པར་གྲུབ་པ་མ་མཆིས་ཀྱང༌། ཐ་སྙད་དུ་དེ་སྐད་ཅེས་བརྗོད་དོ། །",
            "type": "source",
            "mapping": []
        },
        {
            "content": "དེ་བཞིན་གཤེགས་པའི་སྐུ་ལ་མཚན་དཔེ་ཕུན་སུམ་ཚོགས་པ་བདེན་གྲུབ་ཏུ་ཡོད་པའི་སྒོ་ནས་དེ་བཞིན་གཤེགས་པར་བདེན་ཞེན་གྱིས་མི་བལྟ་སྟེ། མཚན་དཔེ་ཕུན་སུམ་ཚོགས་པ་དེ་དག་ནི་ཚོགས་ཤིང་འདུས་པའི་དངོས་པོ་སྒྱུ་མ་ལྟར་གྲུབ་པས་དོན་དམ་པར་མཚན་དཔེ་ཕུན་སུམ་ཚོགས་པར་གྲུབ་པ་མ་མཆིས་ཀྱང༌། ཐ་སྙད་དུ་དེ་སྐད་ཅེས་བརྗོད་དོ། །",
            "type": "source",
            "mapping": []
        },
        {
            "content": "འདི་ལྟ་བུ་ཞིག་སྔར་ཡང་བྱུང་མོད། དེ་ནི་མོས་སྤྱོད་ཀྱིས་ནས་ཉམས་སུ་ལེན་པའི་ དབང་དུ་མཛད་ཅིང༌། འདིར་ནི་ལྷག་བསམ་དག་པ་འཕགས་པའི་ས་ནས་ཉམས་སུ་ལེན་པའི་དབང་དུ་མཛད་ཅེས་ཀ་མ་ཤཱི་ལས་གསུངས་སོ། །དེ་བཞིན་དུ་དེ་བཞིན་གཤེགས་པས་བསྟན་པའི་ཆོས་མེད་ཅེས་གསུངས་པའི་དོན་ཡང་གོང་དུ་བཤད་པ་ལྟར་རོ། །",
            "type": "source",
            "mapping": []
        },
        {
            "content": "འདི་ལྟ་བུ་ཞིག་སྔར་ཡང་བྱུང་མོད། དེ་ནི་མོས་སྤྱོད་ཀྱིས་ནས་ཉམས་སུ་ལེན་པའི་ དབང་དུ་མཛད་ཅིང༌། འདིར་ནི་ལྷག་བསམ་དག་པ་འཕགས་པའི་ས་ནས་ཉམས་སུ་ལེན་པའི་དབང་དུ་མཛད་ཅེས་ཀ་མ་ཤཱི་ལས་གསུངས་སོ། །དེ་བཞིན་དུ་དེ་བཞིན་གཤེགས་པས་བསྟན་པའི་ཆོས་མེད་ཅེས་གསུངས་པའི་དོན་ཡང་གོང་དུ་བཤད་པ་ལྟར་རོ། །",
            "type": "source",
            "mapping": []
        },
        {
            "content": "འདི་ལྟ་བུ་ཞིག་སྔར་ཡང་བྱུང་མོད། དེ་ནི་མོས་སྤྱོད་ཀྱིས་ནས་ཉམས་སུ་ལེན་པའི་ དབང་དུ་མཛད་ཅིང༌། འདིར་ནི་ལྷག་བསམ་དག་པ་འཕགས་པའི་ས་ནས་ཉམས་སུ་ལེན་པའི་དབང་དུ་མཛད་ཅེས་ཀ་མ་ཤཱི་ལས་གསུངས་སོ། །དེ་བཞིན་དུ་དེ་བཞིན་གཤེགས་པས་བསྟན་པའི་ཆོས་མེད་ཅེས་གསུངས་པའི་དོན་ཡང་གོང་དུ་བཤད་པ་ལྟར་རོ། །",
            "type": "source",
            "mapping": []
        },
        {
            "content": "གལ་ཏེ་དེ་བཞིན་གཤེགས་པས་དོན་དམ་པར་ཆོས་བསྟན་ཏོ་ཞེས་བདེན་ཞེན་གྱིས་དམ་བཅའ་ཞིང་ཟེར་ན། དེ་ནི་མེད་པ་ལ་ཡོད་པར་ཞེན་ཅིང་ལོག་པར་རྟོག་པའི་བདེན་འཛིན་གྱིས་ཟིན་པའམ་བཅིངས་པ་ཡིན་པས། དེ་བཞིན་གཤེགས་པ་ང་ལ་སྐུར་བ་བཏབ་པར་འགྱུར་རོ། །",
            "type": "source",
            "mapping": []
        },
        {
            "content": "རྒྱུ་མཚན་ནི་ཆོས་དང་ཆོས་བསྟན་པ་ཞེས་བྱ་བ་ནི་ཐ་སྙད་ཙམ་མ་གཏོགས་གང་ཡང་དོན་དམ་པར་མ་གྲུབ་པའི་ཕྱིར་རོ་ཞེས་པའི་དོན་ནི་སྔར་བཤད་ཟིན་ཅིང༌། འདིར་ལུང་གིས་བརྗོད་ན། མདོ་ལས། མིང་ནི་གང་དང་གང་གིས་ནི། །ཆོས་རྣམས་གང་དང་གང་བརྗོད་པ། །དེ་དང་དེ་ནི་ཡོད་མ་ཡིན། །དེ་ནི་ཆོས་རྣམས་ཆོས་ཉིད་དོ། །ཞེས་དང༌།རིན་པོ་ཆེ་མཐའི་མདོ་ལས་ཀྱང༌། འཇམ་དཔལ་གྱིས་བཅོམ་ལྡན་འདས་ལ་འདི་ན་གང་དང་གང་གིས་གང་དང་གང་བརྗོད་པའི་ཆོས་དེ་དང་དེ་ལ། ཆོས་དེ་དང་དེ་མ་མཆིས་ལགས་སོ། །གང་མ་མཆིས་པ་དེ་ནི་སྟོང་པ་ལགས་སོ། །ཞེས་དང༌། རྣམ་འགྲེལ་ལས་ཀྱང༌། སྒྲ་རྣམས་ཀྱི་ནི་བརྡར་བཏགས་སྟོན། །དེ་ནི་ཐ་སྙད་ཆེད་དུ་ བྱས། །དེ་ཚེ་རང་གི་མཚན་ཉིད་མེད། །ཅེས་གསུངས་པ་ལྟར་རོ། །",
            "type": "source",
            "mapping": []
        },
        {
            "content": "རྒྱུ་མཚན་ནི་ཆོས་དང་ཆོས་བསྟན་པ་ཞེས་བྱ་བ་ནི་ཐ་སྙད་ཙམ་མ་གཏོགས་གང་ཡང་དོན་དམ་པར་མ་གྲུབ་པའི་ཕྱིར་རོ་ཞེས་པའི་དོན་ནི་སྔར་བཤད་ཟིན་ཅིང༌། འདིར་ལུང་གིས་བརྗོད་ན། མདོ་ལས། མིང་ནི་གང་དང་གང་གིས་ནི། །ཆོས་རྣམས་གང་དང་གང་བརྗོད་པ། །དེ་དང་དེ་ནི་ཡོད་མ་ཡིན། །དེ་ནི་ཆོས་རྣམས་ཆོས་ཉིད་དོ། །ཞེས་དང༌།རིན་པོ་ཆེ་མཐའི་མདོ་ལས་ཀྱང༌། འཇམ་དཔལ་གྱིས་བཅོམ་ལྡན་འདས་ལ་འདི་ན་གང་དང་གང་གིས་གང་དང་གང་བརྗོད་པའི་ཆོས་དེ་དང་དེ་ལ། ཆོས་དེ་དང་དེ་མ་མཆིས་ལགས་སོ། །གང་མ་མཆིས་པ་དེ་ནི་སྟོང་པ་ལགས་སོ། །ཞེས་དང༌། རྣམ་འགྲེལ་ལས་ཀྱང༌། སྒྲ་རྣམས་ཀྱི་ནི་བརྡར་བཏགས་སྟོན། །དེ་ནི་ཐ་སྙད་ཆེད་དུ་ བྱས། །དེ་ཚེ་རང་གི་མཚན་ཉིད་མེད། །ཅེས་གསུངས་པ་ལྟར་རོ། །",
            "type": "source",
            "mapping": []
        },
        {
            "content": "དེ་ནས་རབ་འབྱོར་གྱིས་མ་འོངས་པ་ན་སེམས་ཅན་གང་དག་འདི་ལྟ་བུའི་ཆོས་ཟབ་མོ་བཤད་པ་འདི་ཐོས་ན་ཡིད་ཆེས་པར་འགྱུར་རམ་ཞེས་ཞུས་པ་འདི་ལྟ་བུ་ཞིག་གོང་དུ་ཡང་སོང་མོད། གཞི་དང་དགོས་པ་ཐ་དད་པའི་དབང་གིས་སོ། །བཅོམ་ལྡན་འདས་ཀྱིས་ཀྱང་དེའི་ལན་སོང་ཟིན་པ་ལ་དགོངས་ནས། སེམས་ཅན་དེ་དག་ནི་སེམས་ཅན་དུ་དོན་དམ་པར་གྲུབ་པ་ཡང་མ་ཡིན། ཐ་སྙད་དུ་སེམས་ཅན་མེད་པ་ཡང་མ་ཡིན་ནོ། །",
            "type": "source",
            "mapping": []
        },
        {
            "content": "དེ་ནས་རབ་འབྱོར་གྱིས་མ་འོངས་པ་ན་སེམས་ཅན་གང་དག་འདི་ལྟ་བུའི་ཆོས་ཟབ་མོ་བཤད་པ་འདི་ཐོས་ན་ཡིད་ཆེས་པར་འགྱུར་རམ་ཞེས་ཞུས་པ་འདི་ལྟ་བུ་ཞིག་གོང་དུ་ཡང་སོང་མོད། གཞི་དང་དགོས་པ་ཐ་དད་པའི་དབང་གིས་སོ། །བཅོམ་ལྡན་འདས་ཀྱིས་ཀྱང་དེའི་ལན་སོང་ཟིན་པ་ལ་དགོངས་ནས། སེམས་ཅན་དེ་དག་ནི་སེམས་ཅན་དུ་དོན་དམ་པར་གྲུབ་པ་ཡང་མ་ཡིན། ཐ་སྙད་དུ་སེམས་ཅན་མེད་པ་ཡང་མ་ཡིན་ནོ། །",
            "type": "source",
            "mapping": []
        },
        {
            "content": "རྒྱུ་མཚན་ནི་སེམས་ཅན་རྣམས་ཞེས་བྱ་བ་ནི་དེ་བཞིན་གཤེགས་པས་དོན་དམ་པར་སེམས་ཅན་མེད་པར་ གསུངས་པའི་ཕྱིར་ཏེ། ཀུན་རྫོབ་ཏུ་སེམས་ཅན་རྣམས་ཞེས་བྱའོ། །ཀུན་རྫོབ་ཏུ་སེམས་ཅན་འཇོག་ཚུལ་ནི། མདོ་ལས། ཇི་ལྟར་ཡན་ལག་ཚོགས་རྣམས་ལ། །བརྟེན་ནས་ཤིང་རྟར་བརྗོད་པ་ལྟར། །དེ་བཞིན་ཕུང་པོ་རྣམས་བརྟེན་ནས། །ཀུན་རྫོབ་སེམས་ཅན་ཞེས་བྱའོ། །ཞེས་འབྱུང་བ་ལྟར་རོ། ། སྔོན་བཞིན་དུ་སངས་རྒྱས་པའི་ཆོས་དེ་གང་ཡང་ཡོད་སྙམ་མམ་ཞེས་དྲིས་པའི་ལན་དུ་དེ་མེད་ཚུལ་ཞུས་པ་ན། དེ་དེ་བཞིན་ནོ་ཞེས་སོགས་གནང་སྟེ།",
            "type": "source",
            "mapping": []
        },
        {
            "content": "རྒྱུ་མཚན་ནི་སེམས་ཅན་རྣམས་ཞེས་བྱ་བ་ནི་དེ་བཞིན་གཤེགས་པས་དོན་དམ་པར་སེམས་ཅན་མེད་པར་ གསུངས་པའི་ཕྱིར་ཏེ། ཀུན་རྫོབ་ཏུ་སེམས་ཅན་རྣམས་ཞེས་བྱའོ། །ཀུན་རྫོབ་ཏུ་སེམས་ཅན་འཇོག་ཚུལ་ནི། མདོ་ལས། ཇི་ལྟར་ཡན་ལག་ཚོགས་རྣམས་ལ། །བརྟེན་ནས་ཤིང་རྟར་བརྗོད་པ་ལྟར། །དེ་བཞིན་ཕུང་པོ་རྣམས་བརྟེན་ནས། །ཀུན་རྫོབ་སེམས་ཅན་ཞེས་བྱའོ། །ཞེས་འབྱུང་བ་ལྟར་རོ། ། སྔོན་བཞིན་དུ་སངས་རྒྱས་པའི་ཆོས་དེ་གང་ཡང་ཡོད་སྙམ་མམ་ཞེས་དྲིས་པའི་ལན་དུ་དེ་མེད་ཚུལ་ཞུས་པ་ན། དེ་དེ་བཞིན་ནོ་ཞེས་སོགས་གནང་སྟེ།",
            "type": "source",
            "mapping": []
        },
        {
            "content": "རྒྱུ་མཚན་ནི་སེམས་ཅན་རྣམས་ཞེས་བྱ་བ་ནི་དེ་བཞིན་གཤེགས་པས་དོན་དམ་པར་སེམས་ཅན་མེད་པར་ གསུངས་པའི་ཕྱིར་ཏེ། ཀུན་རྫོབ་ཏུ་སེམས་ཅན་རྣམས་ཞེས་བྱའོ། །ཀུན་རྫོབ་ཏུ་སེམས་ཅན་འཇོག་ཚུལ་ནི། མདོ་ལས། ཇི་ལྟར་ཡན་ལག་ཚོགས་རྣམས་ལ། །བརྟེན་ནས་ཤིང་རྟར་བརྗོད་པ་ལྟར། །དེ་བཞིན་ཕུང་པོ་རྣམས་བརྟེན་ནས། །ཀུན་རྫོབ་སེམས་ཅན་ཞེས་བྱའོ། །ཞེས་འབྱུང་བ་ལྟར་རོ། ། སྔོན་བཞིན་དུ་སངས་རྒྱས་པའི་ཆོས་དེ་གང་ཡང་ཡོད་སྙམ་མམ་ཞེས་དྲིས་པའི་ལན་དུ་དེ་མེད་ཚུལ་ཞུས་པ་ན། དེ་དེ་བཞིན་ནོ་ཞེས་སོགས་གནང་སྟེ།",
            "type": "source",
            "mapping": []
        },
        {
            "content": "རྒྱུ་མཚན་ནི་སེམས་ཅན་རྣམས་ཞེས་བྱ་བ་ནི་དེ་བཞིན་གཤེགས་པས་དོན་དམ་པར་སེམས་ཅན་མེད་པར་ གསུངས་པའི་ཕྱིར་ཏེ། ཀུན་རྫོབ་ཏུ་སེམས་ཅན་རྣམས་ཞེས་བྱའོ། །ཀུན་རྫོབ་ཏུ་སེམས་ཅན་འཇོག་ཚུལ་ནི། མདོ་ལས། ཇི་ལྟར་ཡན་ལག་ཚོགས་རྣམས་ལ། །བརྟེན་ནས་ཤིང་རྟར་བརྗོད་པ་ལྟར། །དེ་བཞིན་ཕུང་པོ་རྣམས་བརྟེན་ནས། །ཀུན་རྫོབ་སེམས་ཅན་ཞེས་བྱའོ། །ཞེས་འབྱུང་བ་ལྟར་རོ། ། སྔོན་བཞིན་དུ་སངས་རྒྱས་པའི་ཆོས་དེ་གང་ཡང་ཡོད་སྙམ་མམ་ཞེས་དྲིས་པའི་ལན་དུ་དེ་མེད་ཚུལ་ཞུས་པ་ན། དེ་དེ་བཞིན་ནོ་ཞེས་སོགས་གནང་སྟེ།",
            "type": "source",
            "mapping": []
        },
        {
            "content": "རྒྱུ་མཚན་ནི་སེམས་ཅན་རྣམས་ཞེས་བྱ་བ་ནི་དེ་བཞིན་གཤེགས་པས་དོན་དམ་པར་སེམས་ཅན་མེད་པར་ གསུངས་པའི་ཕྱིར་ཏེ། ཀུན་རྫོབ་ཏུ་སེམས་ཅན་རྣམས་ཞེས་བྱའོ། །ཀུན་རྫོབ་ཏུ་སེམས་ཅན་འཇོག་ཚུལ་ནི། མདོ་ལས། ཇི་ལྟར་ཡན་ལག་ཚོགས་རྣམས་ལ། །བརྟེན་ནས་ཤིང་རྟར་བརྗོད་པ་ལྟར། །དེ་བཞིན་ཕུང་པོ་རྣམས་བརྟེན་ནས། །ཀུན་རྫོབ་སེམས་ཅན་ཞེས་བྱའོ། །ཞེས་འབྱུང་བ་ལྟར་རོ། ། སྔོན་བཞིན་དུ་སངས་རྒྱས་པའི་ཆོས་དེ་གང་ཡང་ཡོད་སྙམ་མམ་ཞེས་དྲིས་པའི་ལན་དུ་དེ་མེད་ཚུལ་ཞུས་པ་ན། དེ་དེ་བཞིན་ནོ་ཞེས་སོགས་གནང་སྟེ།",
            "type": "source",
            "mapping": []
        },
        {
            "content": "རྒྱུ་མཚན་ནི་སེམས་ཅན་རྣམས་ཞེས་བྱ་བ་ནི་དེ་བཞིན་གཤེགས་པས་དོན་དམ་པར་སེམས་ཅན་མེད་པར་ གསུངས་པའི་ཕྱིར་ཏེ། ཀུན་རྫོབ་ཏུ་སེམས་ཅན་རྣམས་ཞེས་བྱའོ། །ཀུན་རྫོབ་ཏུ་སེམས་ཅན་འཇོག་ཚུལ་ནི། མདོ་ལས། ཇི་ལྟར་ཡན་ལག་ཚོགས་རྣམས་ལ། །བརྟེན་ནས་ཤིང་རྟར་བརྗོད་པ་ལྟར། །དེ་བཞིན་ཕུང་པོ་རྣམས་བརྟེན་ནས། །ཀུན་རྫོབ་སེམས་ཅན་ཞེས་བྱའོ། །ཞེས་འབྱུང་བ་ལྟར་རོ། ། སྔོན་བཞིན་དུ་སངས་རྒྱས་པའི་ཆོས་དེ་གང་ཡང་ཡོད་སྙམ་མམ་ཞེས་དྲིས་པའི་ལན་དུ་དེ་མེད་ཚུལ་ཞུས་པ་ན། དེ་དེ་བཞིན་ནོ་ཞེས་སོགས་གནང་སྟེ།",
            "type": "source",
            "mapping": []
        },
        {
            "content": "དེ་ལ་དོན་དམ་པར་སངས་རྒྱས་པའི་ཆོས་ཅུང་ཟད་ཀྱང་དམིགས་སུ་མེད་དེ། ཐ་སྙད་དུ་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སངས་རྒྱས་པའོ་ཞེས་བརྗོད་དོ། །གོང་དུ་འདི་ལྟ་བུ་ཞིག་སོང་བ་ནི་སློབ་ལམ་གྱི་དབང་དུ་མཛད་ཅིང༌། འདི་ནི་སངས་རྒྱས་ཀྱིས་ཇི་ལྟ་བ་བཞིན་གཟིགས་པའི་རིག་ངོར་མེད་པ་ལ་དགོངས་སོ་ཞེས་ཀ་ཤཱིས་བཤད་དོ། །",
            "type": "source",
            "mapping": []
        },
        {
            "content": "དེ་ལ་དོན་དམ་པར་སངས་རྒྱས་པའི་ཆོས་ཅུང་ཟད་ཀྱང་དམིགས་སུ་མེད་དེ། ཐ་སྙད་དུ་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སངས་རྒྱས་པའོ་ཞེས་བརྗོད་དོ། །གོང་དུ་འདི་ལྟ་བུ་ཞིག་སོང་བ་ནི་སློབ་ལམ་གྱི་དབང་དུ་མཛད་ཅིང༌། འདི་ནི་སངས་རྒྱས་ཀྱིས་ཇི་ལྟ་བ་བཞིན་གཟིགས་པའི་རིག་ངོར་མེད་པ་ལ་དགོངས་སོ་ཞེས་ཀ་ཤཱིས་བཤད་དོ། །",
            "type": "source",
            "mapping": []
        },
        {
            "content": "ཡང་རབ་འབྱོར་ཆོས་གང་ཡིན་པ་དེ་ཐམས་ཅད་ནི་བདེན་པར་མ་གྲུབ་པར་མཚུངས་ཤིང་མཉམ་པ་སྟེ། དེ་ལྟ་བུའི་མཉམ་པ་དེའི་དབང་དུ་བྱས་པ་ལ་མི་མཉམ་པའི་ཆོས་གང་ཡང་མེད་པས་སོ། །",
            "type": "source",
            "mapping": []
        },
        {
            "content": "ཡང་རབ་འབྱོར་ཆོས་གང་ཡིན་པ་དེ་ཐམས་ཅད་ནི་བདེན་པར་མ་གྲུབ་པར་མཚུངས་ཤིང་མཉམ་པ་སྟེ། དེ་ལྟ་བུའི་མཉམ་པ་དེའི་དབང་དུ་བྱས་པ་ལ་མི་མཉམ་པའི་ཆོས་གང་ཡང་མེད་པས་སོ། །\n\nམཉམ་པ་དེ་ཡང་སེམས་ཅན་མེད་པ། སྲོག་མེད་པ། གང་ཟག་གི་བདག་མེད་པར་མཉམ་པ་སྟེ། དོན་དམ་པར་ཆོས་སུ་གྲུབ་པ་མེད་ཀྱང་ཐ་སྙད་དུ་སྦྱིན་སོགས་དགེ་བའི་ཆོས་དེ་དག་ཐམས་ཅད་ཀྱིས་དེ་བཞིན་གཤེགས་པ་སངས་རྒྱས་ཤིང༌།  སངས་རྒྱས་ཀྱི་ཐུགས་རྒྱུད་ཀྱི་དགེ་བའི་ཆོས་རྣམས་ལའང་སངས་རྒྱས་ཞེས་བྱའོ། ། སེམས་ཅན་མེད་པ་སོགས་གསུམ་གྱིས་སྒྲོ་འདོགས་ཀྱི་མཐའ་བཀག་ཅིང༌། དགེ་བའི་ཆོས་དེ་དག་ཅེས་སོགས་ཀྱིས་སྐུར་འདེབས་ཀྱི་མཐའ་བཀག་པའི་སྒོ་ནས་མཐའ་གཉིས་བསལ་ཏེ།",
            "type": "source",
            "mapping": []
        },
        {
            "content": "མཉམ་པ་དེ་ཡང་སེམས་ཅན་མེད་པ། སྲོག་མེད་པ། གང་ཟག་གི་བདག་མེད་པར་མཉམ་པ་སྟེ། དོན་དམ་པར་ཆོས་སུ་གྲུབ་པ་མེད་ཀྱང་ཐ་སྙད་དུ་སྦྱིན་སོགས་དགེ་བའི་ཆོས་དེ་དག་ཐམས་ཅད་ཀྱིས་དེ་བཞིན་གཤེགས་པ་སངས་རྒྱས་ཤིང༌།  སངས་རྒྱས་ཀྱི་ཐུགས་རྒྱུད་ཀྱི་དགེ་བའི་ཆོས་རྣམས་ལའང་སངས་རྒྱས་ཞེས་བྱའོ། ། སེམས་ཅན་མེད་པ་སོགས་གསུམ་གྱིས་སྒྲོ་འདོགས་ཀྱི་མཐའ་བཀག་ཅིང༌། དགེ་བའི་ཆོས་དེ་དག་ཅེས་སོགས་ཀྱིས་སྐུར་འདེབས་ཀྱི་མཐའ་བཀག་པའི་སྒོ་ནས་མཐའ་གཉིས་བསལ་ཏེ།",
            "type": "source",
            "mapping": []
        },
        {
            "content": "མཉམ་པ་དེ་ཡང་སེམས་ཅན་མེད་པ། སྲོག་མེད་པ། གང་ཟག་གི་བདག་མེད་པར་མཉམ་པ་སྟེ། དོན་དམ་པར་ཆོས་སུ་གྲུབ་པ་མེད་ཀྱང་ཐ་སྙད་དུ་སྦྱིན་སོགས་དགེ་བའི་ཆོས་དེ་དག་ཐམས་ཅད་ཀྱིས་དེ་བཞིན་གཤེགས་པ་སངས་རྒྱས་ཤིང༌།  སངས་རྒྱས་ཀྱི་ཐུགས་རྒྱུད་ཀྱི་དགེ་བའི་ཆོས་རྣམས་ལའང་སངས་རྒྱས་ཞེས་བྱའོ། ། སེམས་ཅན་མེད་པ་སོགས་གསུམ་གྱིས་སྒྲོ་འདོགས་ཀྱི་མཐའ་བཀག་ཅིང༌། དགེ་བའི་ཆོས་དེ་དག་ཅེས་སོགས་ཀྱིས་སྐུར་འདེབས་ཀྱི་མཐའ་བཀག་པའི་སྒོ་ནས་མཐའ་གཉིས་བསལ་ཏེ།",
            "type": "source",
            "mapping": []
        },
        {
            "content": "མཉམ་པ་དེ་ཡང་སེམས་ཅན་མེད་པ། སྲོག་མེད་པ། གང་ཟག་གི་བདག་མེད་པར་མཉམ་པ་སྟེ། དོན་དམ་པར་ཆོས་སུ་གྲུབ་པ་མེད་ཀྱང་ཐ་སྙད་དུ་སྦྱིན་སོགས་དགེ་བའི་ཆོས་དེ་དག་ཐམས་ཅད་ཀྱིས་དེ་བཞིན་གཤེགས་པ་སངས་རྒྱས་ཤིང༌།  སངས་རྒྱས་ཀྱི་ཐུགས་རྒྱུད་ཀྱི་དགེ་བའི་ཆོས་རྣམས་ལའང་སངས་རྒྱས་ཞེས་བྱའོ། ། སེམས་ཅན་མེད་པ་སོགས་གསུམ་གྱིས་སྒྲོ་འདོགས་ཀྱི་མཐའ་བཀག་ཅིང༌། དགེ་བའི་ཆོས་དེ་དག་ཅེས་སོགས་ཀྱིས་སྐུར་འདེབས་ཀྱི་མཐའ་བཀག་པའི་སྒོ་ནས་མཐའ་གཉིས་བསལ་ཏེ།",
            "type": "source",
            "mapping": []
        },
        {
            "content": "མཉམ་པ་དེ་ཡང་སེམས་ཅན་མེད་པ། སྲོག་མེད་པ། གང་ཟག་གི་བདག་མེད་པར་མཉམ་པ་སྟེ། དོན་དམ་པར་ཆོས་སུ་གྲུབ་པ་མེད་ཀྱང་ཐ་སྙད་དུ་སྦྱིན་སོགས་དགེ་བའི་ཆོས་དེ་དག་ཐམས་ཅད་ཀྱིས་དེ་བཞིན་གཤེགས་པ་སངས་རྒྱས་ཤིང༌།  སངས་རྒྱས་ཀྱི་ཐུགས་རྒྱུད་ཀྱི་དགེ་བའི་ཆོས་རྣམས་ལའང་སངས་རྒྱས་ཞེས་བྱའོ། ། སེམས་ཅན་མེད་པ་སོགས་གསུམ་གྱིས་སྒྲོ་འདོགས་ཀྱི་མཐའ་བཀག་ཅིང༌། དགེ་བའི་ཆོས་དེ་དག་ཅེས་སོགས་ཀྱིས་སྐུར་འདེབས་ཀྱི་མཐའ་བཀག་པའི་སྒོ་ནས་མཐའ་གཉིས་བསལ་ཏེ།",
            "type": "source",
            "mapping": []
        },
        {
            "content": "དོན་དམ་པར་ཆོས་རྣམས་མ་གྲུབ་ནའང་ཐ་སྙད་དུ་སེམས་ཅན་གང་ལ་ལ་ཞིག་གིས་སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་ན་རིའི་རྒྱལ་པོ་རི་རབ་ཇི་སྙེད་པ་དེ་ལྟ་བུའི་ཚད་ཀྱི་གསེར་ལ་སོགས་པའི་རིན་པོ་ཆེ་སྣ་བདུན་གྱི་ཕུང་པོ་རྣམས་བསྡུས་ཏེ།\n\n སྦྱིན་པ་བྱིན་པ་བས་ཀྱང༌། གང་ཟག་གང་གིས་གཞུང་འདི་ཡོངས་རྫོགས་ལྟ་ཅི། འབྲས་བུ་སངས་རྒྱས་ཐོབ་པའི་ཆེད་དུ་དམིགས་ནས། ཐ་ན་ཚིག་བཞི་པའི་ཚིགས་སུ་བཅད་པ་གཅིག་ཙམ་དང༌། དེའི་དོན་ལེགས་པར་བཟུང་ནས་གཞན་དག་ལ་ཡང་བསྟན་ན།སྔ་མ་སྦྱིན་པའི་བསོད་ནམས་དེས་ཕྱི་མ་འདི་ལ་ཆ་བརྒྱར་བགོས་པའི་གཅིག་གི་ཆར་ཡང་ཉེ་བར་མི་འགྲོ་བ་ནས་རྒྱུའི་བར་དུ་མི་བཟོད་དོ་ཞེས་པའི་དོན་ནི་སྔར་བཤད་པ་ལྟར་རོ། །",
            "type": "source",
            "mapping": []
        },
        {
            "content": "དེ་བཞིན་གཤེགས་པ་ལ་སེམས་ཅན་དུ་བདེན་ཞེན་མེད་ཅེས་སྟོན་པ་ནི།  རབ་འབྱོར་དེ་བཞིན་གཤེགས་པས་རྗེས་ཐོབ་ནའང་འདི་སྙམ་དུ་ངས་གདུལ་བྱའི་སེམས་ཅན་རྣམས་བདེན་འཛིན་གྱིས་བཅིངས་པ་ལས་དོན་དམ་པར་བཀྲོལ་བར་བྱའོ་ཞེས་ཐུགས་ལ་དགོངས་པ་ཡོད་དམ་སྙམ་ན། རབ་འབྱོར་ཁྱོད་དེ་ལྟར་མི་བལྟའོ། །",
            "type": "source",
            "mapping": []
        },
        {
            "content": "དེ་བཞིན་གཤེགས་པ་ལ་སེམས་ཅན་དུ་བདེན་ཞེན་མེད་ཅེས་སྟོན་པ་ནི།  རབ་འབྱོར་དེ་བཞིན་གཤེགས་པས་རྗེས་ཐོབ་ནའང་འདི་སྙམ་དུ་ངས་གདུལ་བྱའི་སེམས་ཅན་རྣམས་བདེན་འཛིན་གྱིས་བཅིངས་པ་ལས་དོན་དམ་པར་བཀྲོལ་བར་བྱའོ་ཞེས་ཐུགས་ལ་དགོངས་པ་ཡོད་དམ་སྙམ་ན། རབ་འབྱོར་ཁྱོད་དེ་ལྟར་མི་བལྟའོ། །",
            "type": "source",
            "mapping": []
        },
        {
            "content": "རྒྱུ་མཚན་ནི་དེ་བཞིན་གཤེགས་པས་དོན་དམ་པར་སེམས་ཅན་གང་བདེན་འཛིན་གྱིས་བཅིངས་པ་ལས་བཀྲོལ་ཏེ་ཐར་པར་བྱས་པའི་སེམས་ཅན་དེ་དག་གང་ཡང་མེད་པའི་ཕྱིར་རོ། །",
            "type": "source",
            "mapping": []
        },
        {
            "content": "གལ་ཏེ་དེ་ལྟ་བུའི་བློ་ཞིག་དེ་བཞིན་གཤེགས་པ་ལ་ཡོད་ན་ནི། དེ་ཉིད་དེ་བཞིན་གཤེགས་པའི་བདག་དང་སེམས་ཅན་དང་གང་ཟག་དང་སྲོག་ཏུ་བདེན་པར་འཛིན་པའི་སྐྱོན་དུ་འགྱུར་ན། དེ་ནི་མི་རིགས་ཏེ། དེ་བཞིན་གཤེགས་པ་ལ་བདག་ཏུ་འཛིན་ཅིང་ཞེན་པ་སོགས་མེད་པའི་ཕྱིར་ཏེ། དེས་བདག་ཏུ་འཛིན་པའི་མངོན་ཞེན་ཐམས་ཅད་སྤངས་པའི་ཕྱིར་རོ། །",
            "type": "source",
            "mapping": []
        },
        {
            "content": "གལ་ཏེ་དེ་ལྟ་བུའི་བློ་ཞིག་དེ་བཞིན་གཤེགས་པ་ལ་ཡོད་ན་ནི། དེ་ཉིད་དེ་བཞིན་གཤེགས་པའི་བདག་དང་སེམས་ཅན་དང་གང་ཟག་དང་སྲོག་ཏུ་བདེན་པར་འཛིན་པའི་སྐྱོན་དུ་འགྱུར་ན། དེ་ནི་མི་རིགས་ཏེ། དེ་བཞིན་གཤེགས་པ་ལ་བདག་ཏུ་འཛིན་ཅིང་ཞེན་པ་སོགས་མེད་པའི་ཕྱིར་ཏེ། དེས་བདག་ཏུ་འཛིན་པའི་མངོན་ཞེན་ཐམས་ཅད་སྤངས་པའི་ཕྱིར་རོ། །",
            "type": "source",
            "mapping": []
        },
        {
            "content": "རབ་འབྱོར་བདག་ཏུ་འཛིན་པའི་བདག་འཛིན་ཞེས་བྱ་བ་ནི། དེ་བཞིན་གཤེགས་པས་དེ་སྤངས་ཤིང་རང་ལ་དེ་ལྟ་བུའི་བདེན་ཞེན་མེད་པར་གསུངས་ཏེ། དེ་ལྟ་ནའང་བདེན་མེད་མི་ཤེས་པའི་བྱིས་པ་སོ་སོའི་སྐྱེ་བོ་རྣམས་ཀྱིས་ཆོས་ཀུན་ལ་བདག་ཏུ་ཞེན་ཅིང་བཟུང་ངོ༌། །",
            "type": "source",
            "mapping": []
        },
        {
            "content": "འདིར་དེ་ཁོ་ན་ཉིད་ཀྱི་དོན་མི་ཤེས་པའི་སོ་སྐྱེ་ལ་བྱིས་པའི་མིང་གིས་བཏགས་པ་སྟེ། ། འཕགས་པས་ནི་ཆོས་ཀྱི་དེ་ཁོ་ན་ཉིད་མངོན་སུམ་དུ་གཟིགས་པས་བྱིས་པ་ཞེས་མི་བྱ་བར་མཁས་པ་ཞེས་བྱ་ལ། དེ་ལྟ་བུའི་སོ་སྐྱེ་རྣམས་ཀྱིས་དེ་ལྟར་མི་ཤེས་པའི་ཕྱིར་བྱིས་པ་དང་འདྲ་བས་དེའི་མིང་གིས་བརྗོད་པའི་ཕྱིར་རོ། །",
            "type": "source",
            "mapping": []
        },
        {
            "content": "འདིར་དེ་ཁོ་ན་ཉིད་ཀྱི་དོན་མི་ཤེས་པའི་སོ་སྐྱེ་ལ་བྱིས་པའི་མིང་གིས་བཏགས་པ་སྟེ། ། འཕགས་པས་ནི་ཆོས་ཀྱི་དེ་ཁོ་ན་ཉིད་མངོན་སུམ་དུ་གཟིགས་པས་བྱིས་པ་ཞེས་མི་བྱ་བར་མཁས་པ་ཞེས་བྱ་ལ། དེ་ལྟ་བུའི་སོ་སྐྱེ་རྣམས་ཀྱིས་དེ་ལྟར་མི་ཤེས་པའི་ཕྱིར་བྱིས་པ་དང་འདྲ་བས་དེའི་མིང་གིས་བརྗོད་པའི་ཕྱིར་རོ། །",
            "type": "source",
            "mapping": []
        },
        {
            "content": "སོ་སོའི་སྐྱེ་བོའི་སྒྲ་དོན་ནི། །ལས་སྟོབས་ཀྱིས་འགྲོ་བ་སོ་སོ་ཐ་དད་པ་རྣམས་སུ་སྐྱེ་བས་ན་དེ་ལྟར་དུ་བཤད་དོ། ། ཡང་རབ་འབྱོར་ལ་མཚན་དཔེ་ཕུན་སུམ་ཚོགས་པ་ཡོད་པ་ཙམ་གྱིས་དེ་བཞིན་གཤེགས་པར་བལྟ་ཞིང་འདོད་པར་བྱ་སྙམ་མམ་ཞེས་དྲིས། འམ་དང་མམ་གཉིས་ནི་འགྱུར་ཁྱད་ཙམ་ཡིན་ཅིང་དོན་ལ་ཁྱད་མེད་དོ། །",
            "type": "source",
            "mapping": []
        },
        {
            "content": "སོ་སོའི་སྐྱེ་བོའི་སྒྲ་དོན་ནི། །ལས་སྟོབས་ཀྱིས་འགྲོ་བ་སོ་སོ་ཐ་དད་པ་རྣམས་སུ་སྐྱེ་བས་ན་དེ་ལྟར་དུ་བཤད་དོ། ། ཡང་རབ་འབྱོར་ལ་མཚན་དཔེ་ཕུན་སུམ་ཚོགས་པ་ཡོད་པ་ཙམ་གྱིས་དེ་བཞིན་གཤེགས་པར་བལྟ་ཞིང་འདོད་པར་བྱ་སྙམ་མམ་ཞེས་དྲིས། འམ་དང་མམ་གཉིས་ནི་འགྱུར་ཁྱད་ཙམ་ཡིན་ཅིང་དོན་ལ་ཁྱད་མེད་དོ། །",
            "type": "source",
            "mapping": []
        },
        {
            "content": "ལན་དུ་དེ་ནི་མ་ལགས་སོ་ཞེས་སོགས་ཞུས།",
            "type": "source",
            "mapping": []
        },
        {
            "content": "ལན་དུ་དེ་ནི་མ་ལགས་སོ་ཞེས་སོགས་ཞུས།",
            "type": "source",
            "mapping": []
        },
        {
            "content": "བཅོམ་ལྡན་འདས་ཀྱིས་དེ་དེ་བཞིན་ནོ། ཞེས་སོགས་གནང་སྟེ། མཚན་དཔེ་ཡོད་ཙམ་གྱི་སྐུ་ལ་དེ་བཞིན་གཤེགས་པར་བལྟ་བར་མི་བྱའོ། །",
            "type": "source",
            "mapping": []
        },
        {
            "content": "བཅོམ་ལྡན་འདས་ཀྱིས་དེ་དེ་བཞིན་ནོ། ཞེས་སོགས་གནང་སྟེ། མཚན་དཔེ་ཡོད་ཙམ་གྱི་སྐུ་ལ་དེ་བཞིན་གཤེགས་པར་བལྟ་བར་མི་བྱའོ། །",
            "type": "source",
            "mapping": []
        },
        {
            "content": "རབ་འབྱོར་གལ་ཏེ་དེ་ལྟར་བལྟ་བར་བྱེད་ན་ནི་འཁོར་ལོས་སྒྱུར་བའི་རྒྱལ་པོ་ལའང་མཚན་དཔེ་ཡོད་པས་དེ་ཉིད་དེ་བཞིན་གཤེགས་པར་འདོད་དགོས་པར་ཐལ་བར་འགྱུར་ན། དེ་མི་འདོད་པའི་ཕྱིར་ན་མཚན་ཕུན་སུམ་ཚོགས་པ་མངའ་བ་ཙམ་གྱིས་ནི་དེ་བཞིན་གཤེགས་པར་བལྟ་ཞིང་འདོད་པར་མི་བྱའོ།། །ཞེས་གསུངས་པ་དང༌། །",
            "type": "source",
            "mapping": []
        },
        {
            "content": "རབ་འབྱོར་གལ་ཏེ་དེ་ལྟར་བལྟ་བར་བྱེད་ན་ནི་འཁོར་ལོས་སྒྱུར་བའི་རྒྱལ་པོ་ལའང་མཚན་དཔེ་ཡོད་པས་དེ་ཉིད་དེ་བཞིན་གཤེགས་པར་འདོད་དགོས་པར་ཐལ་བར་འགྱུར་ན། དེ་མི་འདོད་པའི་ཕྱིར་ན་མཚན་ཕུན་སུམ་ཚོགས་པ་མངའ་བ་ཙམ་གྱིས་ནི་དེ་བཞིན་གཤེགས་པར་བལྟ་ཞིང་འདོད་པར་མི་བྱའོ།། །ཞེས་གསུངས་པ་དང༌། །",
            "type": "source",
            "mapping": []
        },
        {
            "content": "དེ་ནས་རབ་འབྱོར་གྱིས་བདག་གིས་བཅོམ་ལྡན་འདས་ཀྱིས་གསུངས་པའི་དོན་ཤེས་པ་ལྟར་ན་དེ་ལྟར་མི་བལྟའོ་ཞེས་ཞུས་སོ། །",
            "type": "source",
            "mapping": []
        },
        {
            "content": "དེ་ནས་རབ་འབྱོར་གྱིས་བདག་གིས་བཅོམ་ལྡན་འདས་ཀྱིས་གསུངས་པའི་དོན་ཤེས་པ་ལྟར་ན་དེ་ལྟར་མི་བལྟའོ་ཞེས་ཞུས་སོ། །",
            "type": "source",
            "mapping": []
        },
        {
            "content": "བཅོམ་ལྡན་འདས་ཀྱིས་ཚིགས་སུ་བཅད་དེ་བཀའ་བསྩལ་པ་ནི། གང་དག་ང་ལ་གཟུགས་སུ་མཐོང༌། །ཞེས་སོགས་གསུངས་ཏེ། །འདིའི་དོན་དབུ་མ་རྩ་བ་ཤེས་རབ་ཀྱི་འགྲེལ་པར་རྗེ་ཉིད་ཀྱིས་ལུང་དེ་དྲངས་ནས། དོན་འདི་ལྟར་བཤད་དེ། ཚིག་དེ་དག་གིས་ནི་གཟུགས་སྒྲ་ལ་སོགས་པའི་སྤྲོས་པའི་ཆོས་སུ་བདེན་པར་འཛིན་པས་ནི། །སངས་རྒྱས་ཀྱི་དེ་ཁོ་ན་ཉིད་ལ་ལོག་པར་ཞུགས་ཤིང་སྤོང་བ་ཡིན་པས། དེས་སངས་རྒྱས་ཀྱི་དེ་ཁོ་ན་ཉིད་མི་མཐོང་བས་སངས་རྒྱས་ཀྱི་དེ་ཁོ་ན་ཉིད་ནི་ཆོས་ཉིད་དུ་བལྟ་བར་བྱ་བ་དང་ཆོས་ཀྱི་སྐུའོ། །",
            "type": "source",
            "mapping": []
        },
        {
            "content": "བཅོམ་ལྡན་འདས་ཀྱིས་ཚིགས་སུ་བཅད་དེ་བཀའ་བསྩལ་པ་ནི། གང་དག་ང་ལ་གཟུགས་སུ་མཐོང༌། །ཞེས་སོགས་གསུངས་ཏེ། །འདིའི་དོན་དབུ་མ་རྩ་བ་ཤེས་རབ་ཀྱི་འགྲེལ་པར་རྗེ་ཉིད་ཀྱིས་ལུང་དེ་དྲངས་ནས། དོན་འདི་ལྟར་བཤད་དེ། ཚིག་དེ་དག་གིས་ནི་གཟུགས་སྒྲ་ལ་སོགས་པའི་སྤྲོས་པའི་ཆོས་སུ་བདེན་པར་འཛིན་པས་ནི། །སངས་རྒྱས་ཀྱི་དེ་ཁོ་ན་ཉིད་ལ་ལོག་པར་ཞུགས་ཤིང་སྤོང་བ་ཡིན་པས། དེས་སངས་རྒྱས་ཀྱི་དེ་ཁོ་ན་ཉིད་མི་མཐོང་བས་སངས་རྒྱས་ཀྱི་དེ་ཁོ་ན་ཉིད་ནི་ཆོས་ཉིད་དུ་བལྟ་བར་བྱ་བ་དང་ཆོས་ཀྱི་སྐུའོ། །",
            "type": "source",
            "mapping": []
        },
        {
            "content": "བཅོམ་ལྡན་འདས་ཀྱིས་ཚིགས་སུ་བཅད་དེ་བཀའ་བསྩལ་པ་ནི། གང་དག་ང་ལ་གཟུགས་སུ་མཐོང༌། །ཞེས་སོགས་གསུངས་ཏེ། །འདིའི་དོན་དབུ་མ་རྩ་བ་ཤེས་རབ་ཀྱི་འགྲེལ་པར་རྗེ་ཉིད་ཀྱིས་ལུང་དེ་དྲངས་ནས། དོན་འདི་ལྟར་བཤད་དེ། ཚིག་དེ་དག་གིས་ནི་གཟུགས་སྒྲ་ལ་སོགས་པའི་སྤྲོས་པའི་ཆོས་སུ་བདེན་པར་འཛིན་པས་ནི། །སངས་རྒྱས་ཀྱི་དེ་ཁོ་ན་ཉིད་ལ་ལོག་པར་ཞུགས་ཤིང་སྤོང་བ་ཡིན་པས། དེས་སངས་རྒྱས་ཀྱི་དེ་ཁོ་ན་ཉིད་མི་མཐོང་བས་སངས་རྒྱས་ཀྱི་དེ་ཁོ་ན་ཉིད་ནི་ཆོས་ཉིད་དུ་བལྟ་བར་བྱ་བ་དང་ཆོས་ཀྱི་སྐུའོ། །",
            "type": "source",
            "mapping": []
        },
        {
            "content": "ཆོས་ཀྱི་སྐུ་དེ་ནི་སྔར་ལྟར་བཟུང་བའི་ཚུལ་གྱིས་ཤེས་པར་བྱ་བ་མ་ཡིན་ཏེ། ཚུལ་དེས་ཤེས་པར་མི་ནུས་པའི་ཕྱིར་རོ་ཞེས་བསྟན་ཏེ་སྤྲོས་པས་བློ་མིག་ཉམས་པས་དེ་བཞིན་གཤེགས་པའི་དེ་ཉིད་མི་མཐོང་བའི་ཤེས་བྱེད་ཡིན་པའི་ཕྱིར་དང་ཞེས་གསུངས་པ་ལྟར་རོ། །",
            "type": "source",
            "mapping": []
        },
        {
            "content": "ཆོས་ཀྱི་སྐུ་དེ་ནི་སྔར་ལྟར་བཟུང་བའི་ཚུལ་གྱིས་ཤེས་པར་བྱ་བ་མ་ཡིན་ཏེ། ཚུལ་དེས་ཤེས་པར་མི་ནུས་པའི་ཕྱིར་རོ་ཞེས་བསྟན་ཏེ་སྤྲོས་པས་བློ་མིག་ཉམས་པས་དེ་བཞིན་གཤེགས་པའི་དེ་ཉིད་མི་མཐོང་བའི་ཤེས་བྱེད་ཡིན་པའི་ཕྱིར་དང་ཞེས་གསུངས་པ་ལྟར་རོ། །",
            "type": "source",
            "mapping": []
        },
        {
            "content": "ཚིག་དོན་ནི། །སེམས་ཅན་གང་དག་དེ་བཞིན་གཤེགས་པ་ངའི་མཚན་དཔེ་སོགས་མཐོང་ན་ང་ལ་གཟུགས་སུ་བདེན་ཞེན་གྱིས་ལྟ་ཞིག་མཐོང་བ་སྟེ་འཛིན་པ་དང༌།  སེམས་ཅན་གང་དག་ང་ལ་ངའི་མིང་སོགས་ཐོས་ཤིང་སྒྲར་བརྗོད་པའི་སྒོ་ནས་བདེན་པར་ཤེས་པ་སྟེ་ཞེན་ནས་འཛིན་པ་སོགས་མདོར་ན། དེ་བཞིན་གཤེགས་པ་ལ་མིང་དང་གཟུགས་ཀྱི་སྐུར་བདེན་པར་ཞེན་པའི་བདེན་འཛིན་གྱིས་བཅིངས་པ་དེ་དག་ནི། །དེ་བཞིན་གཤེགས་པའི་ཆོས་ཀྱི་སྐུ་ལྟ་བ་ལ་ལོག་པར་ཞུགས་པ་སྟེ། །སྐྱེ་བོ་དེ་དག་གིས་དེ་བཞིན་གཤེགས་པ་ངའི་ཆོས་ཀྱི་སྐུ་སྟོང་པ་ཉིད་མི་མཐོང་ངོ༌། །",
            "type": "source",
            "mapping": []
        },
        {
            "content": "ཚིག་དོན་ནི། །སེམས་ཅན་གང་དག་དེ་བཞིན་གཤེགས་པ་ངའི་མཚན་དཔེ་སོགས་མཐོང་ན་ང་ལ་གཟུགས་སུ་བདེན་ཞེན་གྱིས་ལྟ་ཞིག་མཐོང་བ་སྟེ་འཛིན་པ་དང༌།  སེམས་ཅན་གང་དག་ང་ལ་ངའི་མིང་སོགས་ཐོས་ཤིང་སྒྲར་བརྗོད་པའི་སྒོ་ནས་བདེན་པར་ཤེས་པ་སྟེ་ཞེན་ནས་འཛིན་པ་སོགས་མདོར་ན། དེ་བཞིན་གཤེགས་པ་ལ་མིང་དང་གཟུགས་ཀྱི་སྐུར་བདེན་པར་ཞེན་པའི་བདེན་འཛིན་གྱིས་བཅིངས་པ་དེ་དག་ནི། །དེ་བཞིན་གཤེགས་པའི་ཆོས་ཀྱི་སྐུ་ལྟ་བ་ལ་ལོག་པར་ཞུགས་པ་སྟེ། །སྐྱེ་བོ་དེ་དག་གིས་དེ་བཞིན་གཤེགས་པ་ངའི་ཆོས་ཀྱི་སྐུ་སྟོང་པ་ཉིད་མི་མཐོང་ངོ༌། །",
            "type": "source",
            "mapping": []
        },
        {
            "content": "མི་མཐོང་བའི་རྒྱུ་མཚན་ནི་སངས་རྒྱས་རྣམས་ཀྱི་ཆོས་ཀྱི་སྐུ་ངོ་བོ་ཉིད་ཀྱི་སྐུ་དེ་ནི་ཆོས་ཉིད་ཀྱི་སྐུར་ལྟ་དགོས་ཤིང༌། །འདྲེན་པ་སངས་རྒྱས་རྣམས་ཀྱི་ཆོས་ཀྱི་སྐུ་ཆོས་ཉིད་དོན་དམ་བདེན་པ་དེ་ནི། བདེན་འཛིན་གྱིས་བཅིངས་པའི་བློ་ཤེས་པར་བྱ་བ་མ་ཡིན་ཏེ། ཆོས་ཀྱི་སྐུ་དེ་ནི་བློ་དེས་རྣམ་པར་ཤེས་མི་ནུས་པའི་ཕྱིར་ཏེ། སངས་རྒྱས་ཀྱི་ཆོས་སྐུ་སྟོང་པ་ཉིད་ཤེས་པ་ལ་སྟོང་ཉིད་རྟོགས་དགོས་པའི་ཕྱིར་རོ། །དེས་མཚོན་ཏེ་ཆོས་གང་ལ་ཡང་བདེན་ཞེན་ཡོད་ན་ཆོས་དེའི་ཆོས་ཉིད་མི་མཐོང་བ་ནི་འདྲའོ། ། གཟུགས་སོགས་ཀུན་རྫོབ་པའི་ཆོས་གང་ཡིན་ཡང་མངོན་སུམ་དུ་རྟོགས་པ་དེའི་ཚེ་སྤྲོས་བཅས་ཀྱི་རྣམ་པར་ཤར་བའི་ཚུལ་གྱིས་རྟོགས་དགོས་ལ། །དེ་དག་གི་ཆོས་ཉིད་དོན་དམ་པའི་ཆོས་གང་མངོན་སུམ་དུ་རྟོགས་པ་དེའི་ཚེ་སྤྲོས་པ་རྣམ་པར་བཅད་པའི་ཚུལ་གྱིས་རྟོགས་དགོས་ཏེ། །བདེན་གཉིས་སོ་སོའི་མཐོང་ཚུལ་གྱི་ཁྱད་པར་འདི་ནི་རྟོགས་པར་དཀའ་བའི་གནས་སོ། །དེར་མ་ཟད། །ཆོས་གང་ཡིན་ཡང་དེ་བདེན་མེད་དུ་མངོན་སུམ་དུ་མ་རྟོགས་ཀྱང༌། །དོན་སྤྱིའི་ཚུལ་གྱིས་རྟོགས་པའི་བློ་དེའི་སྣང་ངོར་སྤྲོས་པ་འཆར་ཡང་ངེས་ངོར་སྤྲོས་པ་གཅོད་དགོས་སོ། །  དེའི་དོན་བསྡུ་བ་ནི། །དེ་ལྟར་ཆོས་སྐུའི་དབང་དུ་བྱས་ན་མཚན་དཔེ་ཕུན་སུམ་ཚོགས་པ་ཙམ་གྱིས་དེ་བཞིན་གཤེགས་པ་བླ་ན་མེད་པའི་བྱང་ཆུབ་ཏུ་སངས་རྒྱས་པ་མེད་དོ། །",
            "type": "source",
            "mapping": []
        },
        {
            "content": "དེ་ལ་ཆད་ལྟ་འགོག་པ་ནི། །རབ་འབྱོར་ཁྱོད་འདི་སྙམ་དུ་བྱང་ཆུབ་སེམས་དཔའི་ཐེག་པ་ལ་ཡང་དག་པར་ཞུགས་པ་རྣམས་ཀྱིས་གཟུགས་སོགས་ཀྱི་ཆོས་གང་ལ་ལ་ཞིག་དོན་དམ་པར་མ་གྲུབ་པར་རྟོགས་པ་ན། །ཆོས་དེ་རིགས་པས་རྣམ་པར་བཤིག་པའམ། །མེད་པར་བྱས་ཏེ་ཆད་པར་བཏགས་པའོ་སྙམ་དུ་སེམས་ཤིང་འཛིན་ན། །དེ་ལྟར་བལྟ་ཞིང་འདོད་པར་མི་བྱ་སྟེ། ། བྱང་ཆུབ་སེམས་དཔའ་དེ་རྣམས་ཀྱིས་ཆོས་གང་ཡང་རྣམ་པར་བཤིག་པའམ་ཆད་པར་བཏགས་པ་མེད་དེ། །དེ་ལྟར་རྟོགས་པ་དེའི་ཚེ་ཆོས་དེ་བདེན་མེད་དུ་རྟོགས་པ་ཡིན་གྱི། །ཆོས་དེ་མེད་པར་རྟོགས་པ་མ་ཡིན་པའི་ཕྱིར་རོ། དེ་ལྟར་རྟོགས་པའི་བློའི་ངེས་ངོ་ན་ཀུན་རྫོབ་པའི་ཆོས་དེ་དག་མེད་ཀྱང་བློ་དེས་དེ་དག་མེད་པར་རྟོགས་པ་མ་ཡིན་ཏེ། །བློ་དེའི་དོན་མེད་ཀྱང་སྤྱིར་ཡོད་པའི་ཕྱིར་ཏེ། །དཔེར་ན་བདེན་འཛིན་གྱིས་བཅིངས་པའི་བློ་ངོ་ན་བདེན་སྟོང་དུ་སྣང་བའི་བུམ་སོགས་མེད་ཀྱང་སྤྱིར་དེ་ཡོད་པ་བཞིན་ནོ། །",
            "type": "source",
            "mapping": []
        },
        {
            "content": "དེ་ལ་ཆད་ལྟ་འགོག་པ་ནི། །རབ་འབྱོར་ཁྱོད་འདི་སྙམ་དུ་བྱང་ཆུབ་སེམས་དཔའི་ཐེག་པ་ལ་ཡང་དག་པར་ཞུགས་པ་རྣམས་ཀྱིས་གཟུགས་སོགས་ཀྱི་ཆོས་གང་ལ་ལ་ཞིག་དོན་དམ་པར་མ་གྲུབ་པར་རྟོགས་པ་ན། །ཆོས་དེ་རིགས་པས་རྣམ་པར་བཤིག་པའམ། །མེད་པར་བྱས་ཏེ་ཆད་པར་བཏགས་པའོ་སྙམ་དུ་སེམས་ཤིང་འཛིན་ན། །དེ་ལྟར་བལྟ་ཞིང་འདོད་པར་མི་བྱ་སྟེ། ། བྱང་ཆུབ་སེམས་དཔའ་དེ་རྣམས་ཀྱིས་ཆོས་གང་ཡང་རྣམ་པར་བཤིག་པའམ་ཆད་པར་བཏགས་པ་མེད་དེ། །དེ་ལྟར་རྟོགས་པ་དེའི་ཚེ་ཆོས་དེ་བདེན་མེད་དུ་རྟོགས་པ་ཡིན་གྱི། །ཆོས་དེ་མེད་པར་རྟོགས་པ་མ་ཡིན་པའི་ཕྱིར་རོ། དེ་ལྟར་རྟོགས་པའི་བློའི་ངེས་ངོ་ན་ཀུན་རྫོབ་པའི་ཆོས་དེ་དག་མེད་ཀྱང་བློ་དེས་དེ་དག་མེད་པར་རྟོགས་པ་མ་ཡིན་ཏེ། །བློ་དེའི་དོན་མེད་ཀྱང་སྤྱིར་ཡོད་པའི་ཕྱིར་ཏེ། །དཔེར་ན་བདེན་འཛིན་གྱིས་བཅིངས་པའི་བློ་ངོ་ན་བདེན་སྟོང་དུ་སྣང་བའི་བུམ་སོགས་མེད་ཀྱང་སྤྱིར་དེ་ཡོད་པ་བཞིན་ནོ། །",
            "type": "source",
            "mapping": []
        },
        {
            "content": "ཡང་གང་ཟག་གང་གིས་འཇིག་རྟེན་གྱི་ཁམས་གངྒཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་དག་རིན་པོ་ཆེ་སྣ་བདུན་གྱིས་གང་བར་བྱས་ཏེ་སྦྱིན་པ་བྱིན་པའི་བསོད་ནམས་ལས། །བྱང་ཆུབ་སེམས་དཔའ་གང་གིས་ཆོས་ཀྱི་རྣམ་གྲངས་ཤེར་ཕྱིན་གྱི་གཞུང་འདི་ལ་བརྟེན་ནས་བདག་མེད་པའི་དོན་མངོན་སུམ་དུ་རྟོགས་ཤིང༌། །དོན་དམ་པར་སྐྱེ་བ་མེད་པ་སྟེ་མི་སྐྱེ་བའི་ཆོས་ལ་བཟོད་པ་ཆེན་པོ་ཐོབ་ན། གང་ཟག་དེ་ཉིད་ཀྱིས་བཟོད་པ་ཐོབ་པའི་གཞི་དེ་ལས་བསོད་ནམས་ཀྱི་ཕུང་པོ་ཆེས་གྲངས་མེད་དཔག་ཏུ་མེད་པ་བསྐྱེད་པར་འགྱུར་རོ། །མི་སྐྱེ་བའི་ཆོས་ལ་བཟོད་པ་ཐོབ་ཅེས་པའི་དོན་སྔར་བཤད་ཟིན་ཏོ། །",
            "type": "source",
            "mapping": []
        },
        {
            "content": "ཡང་རབ་འབྱོར་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱིས་བསོད་ནམས་ཀྱི་ཕུང་པོ་བདེན་ཞེན་གྱིས་ཡོངས་སུ་གཟུང་བར་མི་བྱའོ་ཞེས་གསུངས་པ་ན།  རབ་འབྱོར་གྱིས་བཅོམ་ལྡན་འདས་བྱང་ཆུབ་སེམས་དཔའ་བསོད་ནམས་ཀྱི་ཕུང་པོ་གཟུང་བར་མི་བགྱི་ལགས་སམ་ཞེས་ཐ་སྙད་དུ་བསོད་ནམས་མི་བཟུང་ངམ་སྙམ་པའི་དོགས་པ་བྱུང་བ་ལྟར་བཅོས་ནས་ཞུས་པ་ན།  བཅོམ་ལྡན་འདས་ཀྱིས་ཐ་སྙད་དུ་བསོད་ནམས་ཡོངས་སུ་གཟུང་བར་བྱ་དགོས་མོད་ཀྱི། །བསོད་ནམས་ལ་བདེན་ཞེན་གྱིས་ལྟ་བའི་ལོག་པར་མི་བཟུང་སྟེ། །དེས་ན་ཐ་སྙད་དུ་བསོད་ནམས་ཡོངས་སུ་གཟུང་བ་ཞེས་བྱའོ་ཞེས་གསུངས་ཏེ། །འདིའི་གཟུང་བར་མི་བྱའོ་ཞེས་པས་བསོད་ནམས་ཀྱི་ཕུང་པོ་ལ་བདེན་གྲུབ་ཏུ་ཞེན་པའི་རྟག་ལྟ་དང༌། །ཡོངས་སུ་བཟུང་མོད་ཀྱིས་ཞེས་ཆད་པར་ལྟ་བ་སེལ་ལོ། །",
            "type": "source",
            "mapping": []
        },
        {
            "content": "ཡང་རབ་འབྱོར་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱིས་བསོད་ནམས་ཀྱི་ཕུང་པོ་བདེན་ཞེན་གྱིས་ཡོངས་སུ་གཟུང་བར་མི་བྱའོ་ཞེས་གསུངས་པ་ན།  རབ་འབྱོར་གྱིས་བཅོམ་ལྡན་འདས་བྱང་ཆུབ་སེམས་དཔའ་བསོད་ནམས་ཀྱི་ཕུང་པོ་གཟུང་བར་མི་བགྱི་ལགས་སམ་ཞེས་ཐ་སྙད་དུ་བསོད་ནམས་མི་བཟུང་ངམ་སྙམ་པའི་དོགས་པ་བྱུང་བ་ལྟར་བཅོས་ནས་ཞུས་པ་ན།  བཅོམ་ལྡན་འདས་ཀྱིས་ཐ་སྙད་དུ་བསོད་ནམས་ཡོངས་སུ་གཟུང་བར་བྱ་དགོས་མོད་ཀྱི། །བསོད་ནམས་ལ་བདེན་ཞེན་གྱིས་ལྟ་བའི་ལོག་པར་མི་བཟུང་སྟེ། །དེས་ན་ཐ་སྙད་དུ་བསོད་ནམས་ཡོངས་སུ་གཟུང་བ་ཞེས་བྱའོ་ཞེས་གསུངས་ཏེ། །འདིའི་གཟུང་བར་མི་བྱའོ་ཞེས་པས་བསོད་ནམས་ཀྱི་ཕུང་པོ་ལ་བདེན་གྲུབ་ཏུ་ཞེན་པའི་རྟག་ལྟ་དང༌། །ཡོངས་སུ་བཟུང་མོད་ཀྱིས་ཞེས་ཆད་པར་ལྟ་བ་སེལ་ལོ། །",
            "type": "source",
            "mapping": []
        },
        {
            "content": "ཡང་རབ་འབྱོར་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱིས་བསོད་ནམས་ཀྱི་ཕུང་པོ་བདེན་ཞེན་གྱིས་ཡོངས་སུ་གཟུང་བར་མི་བྱའོ་ཞེས་གསུངས་པ་ན།  རབ་འབྱོར་གྱིས་བཅོམ་ལྡན་འདས་བྱང་ཆུབ་སེམས་དཔའ་བསོད་ནམས་ཀྱི་ཕུང་པོ་གཟུང་བར་མི་བགྱི་ལགས་སམ་ཞེས་ཐ་སྙད་དུ་བསོད་ནམས་མི་བཟུང་ངམ་སྙམ་པའི་དོགས་པ་བྱུང་བ་ལྟར་བཅོས་ནས་ཞུས་པ་ན།  བཅོམ་ལྡན་འདས་ཀྱིས་ཐ་སྙད་དུ་བསོད་ནམས་ཡོངས་སུ་གཟུང་བར་བྱ་དགོས་མོད་ཀྱི། །བསོད་ནམས་ལ་བདེན་ཞེན་གྱིས་ལྟ་བའི་ལོག་པར་མི་བཟུང་སྟེ། །དེས་ན་ཐ་སྙད་དུ་བསོད་ནམས་ཡོངས་སུ་གཟུང་བ་ཞེས་བྱའོ་ཞེས་གསུངས་ཏེ། །འདིའི་གཟུང་བར་མི་བྱའོ་ཞེས་པས་བསོད་ནམས་ཀྱི་ཕུང་པོ་ལ་བདེན་གྲུབ་ཏུ་ཞེན་པའི་རྟག་ལྟ་དང༌། །ཡོངས་སུ་བཟུང་མོད་ཀྱིས་ཞེས་ཆད་པར་ལྟ་བ་སེལ་ལོ། །",
            "type": "source",
            "mapping": []
        },
        {
            "content": "ཡང་རབ་འབྱོར་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱིས་བསོད་ནམས་ཀྱི་ཕུང་པོ་བདེན་ཞེན་གྱིས་ཡོངས་སུ་གཟུང་བར་མི་བྱའོ་ཞེས་གསུངས་པ་ན།  རབ་འབྱོར་གྱིས་བཅོམ་ལྡན་འདས་བྱང་ཆུབ་སེམས་དཔའ་བསོད་ནམས་ཀྱི་ཕུང་པོ་གཟུང་བར་མི་བགྱི་ལགས་སམ་ཞེས་ཐ་སྙད་དུ་བསོད་ནམས་མི་བཟུང་ངམ་སྙམ་པའི་དོགས་པ་བྱུང་བ་ལྟར་བཅོས་ནས་ཞུས་པ་ན།  བཅོམ་ལྡན་འདས་ཀྱིས་ཐ་སྙད་དུ་བསོད་ནམས་ཡོངས་སུ་གཟུང་བར་བྱ་དགོས་མོད་ཀྱི། །བསོད་ནམས་ལ་བདེན་ཞེན་གྱིས་ལྟ་བའི་ལོག་པར་མི་བཟུང་སྟེ། །དེས་ན་ཐ་སྙད་དུ་བསོད་ནམས་ཡོངས་སུ་གཟུང་བ་ཞེས་བྱའོ་ཞེས་གསུངས་ཏེ། །འདིའི་གཟུང་བར་མི་བྱའོ་ཞེས་པས་བསོད་ནམས་ཀྱི་ཕུང་པོ་ལ་བདེན་གྲུབ་ཏུ་ཞེན་པའི་རྟག་ལྟ་དང༌། །ཡོངས་སུ་བཟུང་མོད་ཀྱིས་ཞེས་ཆད་པར་ལྟ་བ་སེལ་ལོ། །",
            "type": "source",
            "mapping": []
        },
        {
            "content": "ཡང་རབ་འབྱོར་ལ་སེམས་ཅན་གང་ལ་ལ་ཞིག་བདེན་ཞེན་གྱིས་འདི་སྙམ་དུ། །དེ་བཞིན་གཤེགས་པ་ནི་ཕར་གཞན་དུ་བཞུད་པ་སྟེ་འགྲོ་བའམ། །ཚུར་བྱོན་ཏམ། །ཡར་བཞེངས་སམ། །སྟན་ལ་བཞུགས་སམ། །གཉིད་དུ་མནལ་བར་མཛད་དམ་ཞེས་ཟེར་ཞིང་འདྲི་ན། །འདྲི་བ་པོ་དེས་དེ་བཞིན་གཤེགས་པ་ངས་རང་ཉིད་འབྱོན་བཞུད་སོགས་དོན་དམ་པར་མེད་པར་བཤད་པའི་དོན་མི་ཤེས་སོ། །",
            "type": "source",
            "mapping": []
        },
        {
            "content": "རྒྱུ་མཚན་ཅིའི་ཕྱིར་ཞེ་ན། །རབ་འབྱོར་དེ་བཞིན་གཤེགས་པ་ནི་དོན་དམ་པ་ཕྱོགས་གར་ཡང་ཕར་མ་བཞུད། ཕྱོགས་གང་ནས་ཀྱང་ཚུར་མ་བྱོན་པའི་ཕྱིར་ཏེ། རྒྱུ་མཚན་དེ་བས་ན་ཐ་སྙད་དུ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཞེས་བྱའོ། །",
            "type": "source",
            "mapping": []
        },
        {
            "content": "རྒྱུ་མཚན་ཅིའི་ཕྱིར་ཞེ་ན། །རབ་འབྱོར་དེ་བཞིན་གཤེགས་པ་ནི་དོན་དམ་པ་ཕྱོགས་གར་ཡང་ཕར་མ་བཞུད། ཕྱོགས་གང་ནས་ཀྱང་ཚུར་མ་བྱོན་པའི་ཕྱིར་ཏེ། རྒྱུ་མཚན་དེ་བས་ན་ཐ་སྙད་དུ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཞེས་བྱའོ། །",
            "type": "source",
            "mapping": []
        },
        {
            "content": "ཡང་རབ་འབྱོར་ལ་སེམས་ཅན་གང་ལ་ལ་ཞིག་གིས་སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་ན་སའི་རྡུལ་ཇི་སྙེད་ཡོད་པ་དེ་ཐམས་ཅད་དཔེར་ན།རྡུལ་ཕྲ་རབ་ཀྱི་ཚོགས་བཞིན་དུ་ཤིན་ཏུ་ཆུང་བའི་གཟུགས་སུ་ཕྱེ་མར་བྱས་ན། ཕྱེ་མར་བྱས་པའི་ཚོགས་དེ་དག་མང་ངམ་ཞེས་དྲིས་པ་ན།",
            "type": "source",
            "mapping": []
        },
        {
            "content": "ལན་དུ་དེ་མང་ངོ་ཞེས་ཞུས་ཤིང་། གལ་ཏེ་རྡུལ་གྱི་ཚོགས་ཤིག་དོན་དམ་པར་མཆིས་པར་གྱུར་ན་ནི། བཅོམ་ལྡན་འདས་ཀྱིས་ཐ་སྙད་དུ་རྡུལ་ཕྲ་རབ་ཀྱི་ཚོགས་ཞེས་བཀའ་མི་སྩོལ་ཏེ། དེ་རྣམས་དོན་དམ་པར་ཡོད་ན་དེར་ཡོད་ཅེས་གསུངས་དགོས་པའི་ཕྱིར་རོ། །",
            "type": "source",
            "mapping": []
        },
        {
            "content": "ལན་དུ་དེ་མང་ངོ་ཞེས་ཞུས་ཤིང་། གལ་ཏེ་རྡུལ་གྱི་ཚོགས་ཤིག་དོན་དམ་པར་མཆིས་པར་གྱུར་ན་ནི། བཅོམ་ལྡན་འདས་ཀྱིས་ཐ་སྙད་དུ་རྡུལ་ཕྲ་རབ་ཀྱི་ཚོགས་ཞེས་བཀའ་མི་སྩོལ་ཏེ། དེ་རྣམས་དོན་དམ་པར་ཡོད་ན་དེར་ཡོད་ཅེས་གསུངས་དགོས་པའི་ཕྱིར་རོ། །",
            "type": "source",
            "mapping": []
        },
        {
            "content": "ལན་དུ་དེ་མང་ངོ་ཞེས་ཞུས་ཤིང་། གལ་ཏེ་རྡུལ་གྱི་ཚོགས་ཤིག་དོན་དམ་པར་མཆིས་པར་གྱུར་ན་ནི། བཅོམ་ལྡན་འདས་ཀྱིས་ཐ་སྙད་དུ་རྡུལ་ཕྲ་རབ་ཀྱི་ཚོགས་ཞེས་བཀའ་མི་སྩོལ་ཏེ། དེ་རྣམས་དོན་དམ་པར་ཡོད་ན་དེར་ཡོད་ཅེས་གསུངས་དགོས་པའི་ཕྱིར་རོ། །",
            "type": "source",
            "mapping": []
        },
        {
            "content": "དེ་རྣམས་དོན་དམ་པར་མེད་པའི་རང་བཞིན་རྡུལ་ཕྲ་རབ་ཀྱི་ཚོགས་ཞེས་གང་གསུངས་པ་དེ་ནི། དེ་རྣམས་དོན་དམ་པར་ཚོགས་སུ་གྲུབ་པ་མ་མཆིས་པར་དེ་བཞིན་གཤེགས་པས་མཁྱེན་ནས་གསུངས་པའི་སླད་དུ་སྟེ།  དེས་ན་ཐ་སྙད་དུ་རྡུལ་ཕྲ་རབ་ཀྱི་ཚོགས་ཞེས་བགྱིའོ། །",
            "type": "source",
            "mapping": []
        },
        {
            "content": "དེ་རྣམས་དོན་དམ་པར་མེད་པའི་རང་བཞིན་རྡུལ་ཕྲ་རབ་ཀྱི་ཚོགས་ཞེས་གང་གསུངས་པ་དེ་ནི། དེ་རྣམས་དོན་དམ་པར་ཚོགས་སུ་གྲུབ་པ་མ་མཆིས་པར་དེ་བཞིན་གཤེགས་པས་མཁྱེན་ནས་གསུངས་པའི་སླད་དུ་སྟེ།  དེས་ན་ཐ་སྙད་དུ་རྡུལ་ཕྲ་རབ་ཀྱི་ཚོགས་ཞེས་བགྱིའོ། །",
            "type": "source",
            "mapping": []
        },
        {
            "content": "རྡུལ་ཕྲ་རབ་རང་བཞིན་གྱིས་མ་གྲུབ་པར་བཤད་ནས་དེ་བསགས་པའི་རགས་པ་ཡང་རང་བཞིན་གྱིས་གྲུབ་པ་མེད་དོ་ཞེས་སྟོན་པ་ནི། སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་དེ་ཡང་དོན་དམ་པར་ཁམས་སུ་གྲུབ་པ་མེད་པར་དེ་བཞིན་གཤེགས་པས་གསུངས་ཏེ།  དེས་ན་ཐ་སྙད་ཙམ་དུ་མིང་གིས་སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་ཞེས་བྱའོ། །འདིས་སྣོད་བཅུད་གཉིས་ཀ་མཚོན་ནོ། ། གལ་ཏེ་དོན་དམ་པར་སྣོད་བཅུད་ཀྱི་འཇིག་རྟེན་གྱི་ཁམས་དེ་ལྟ་བུ་ཞིག་མཆིས་པར་གྱུར་ན་ནི། དེ་ཉིད་ཚོགས་ཤིང་འདུས་པ་ལ་མ་ལྟོས་པར་རགས་པ་རིལ་པོ་གཅིག་ཏུ་གྲུབ་ཅིང་འཛིན་དགོས་པར་འགྱུར་བའི་སླད་དུ་སྟེ།",
            "type": "source",
            "mapping": []
        },
        {
            "content": "རྡུལ་ཕྲ་རབ་རང་བཞིན་གྱིས་མ་གྲུབ་པར་བཤད་ནས་དེ་བསགས་པའི་རགས་པ་ཡང་རང་བཞིན་གྱིས་གྲུབ་པ་མེད་དོ་ཞེས་སྟོན་པ་ནི། སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་དེ་ཡང་དོན་དམ་པར་ཁམས་སུ་གྲུབ་པ་མེད་པར་དེ་བཞིན་གཤེགས་པས་གསུངས་ཏེ།  དེས་ན་ཐ་སྙད་ཙམ་དུ་མིང་གིས་སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་ཞེས་བྱའོ། །འདིས་སྣོད་བཅུད་གཉིས་ཀ་མཚོན་ནོ། ། གལ་ཏེ་དོན་དམ་པར་སྣོད་བཅུད་ཀྱི་འཇིག་རྟེན་གྱི་ཁམས་དེ་ལྟ་བུ་ཞིག་མཆིས་པར་གྱུར་ན་ནི། དེ་ཉིད་ཚོགས་ཤིང་འདུས་པ་ལ་མ་ལྟོས་པར་རགས་པ་རིལ་པོ་གཅིག་ཏུ་གྲུབ་ཅིང་འཛིན་དགོས་པར་འགྱུར་བའི་སླད་དུ་སྟེ།",
            "type": "source",
            "mapping": []
        },
        {
            "content": "རྡུལ་ཕྲ་རབ་རང་བཞིན་གྱིས་མ་གྲུབ་པར་བཤད་ནས་དེ་བསགས་པའི་རགས་པ་ཡང་རང་བཞིན་གྱིས་གྲུབ་པ་མེད་དོ་ཞེས་སྟོན་པ་ནི། སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་དེ་ཡང་དོན་དམ་པར་ཁམས་སུ་གྲུབ་པ་མེད་པར་དེ་བཞིན་གཤེགས་པས་གསུངས་ཏེ།  དེས་ན་ཐ་སྙད་ཙམ་དུ་མིང་གིས་སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་ཞེས་བྱའོ། །འདིས་སྣོད་བཅུད་གཉིས་ཀ་མཚོན་ནོ། ། གལ་ཏེ་དོན་དམ་པར་སྣོད་བཅུད་ཀྱི་འཇིག་རྟེན་གྱི་ཁམས་དེ་ལྟ་བུ་ཞིག་མཆིས་པར་གྱུར་ན་ནི། དེ་ཉིད་ཚོགས་ཤིང་འདུས་པ་ལ་མ་ལྟོས་པར་རགས་པ་རིལ་པོ་གཅིག་ཏུ་གྲུབ་ཅིང་འཛིན་དགོས་པར་འགྱུར་བའི་སླད་དུ་སྟེ།",
            "type": "source",
            "mapping": []
        },
        {
            "content": "དེ་ལྟར་གྲུབ་ན་དེ་བཞིན་གཤེགས་པས་ཀྱང་གཟིགས་དགོས་པར་འགྱུར་རོ། ། དེ་བཞིན་གཤེགས་པས་དེ་ལྟ་བུའི་སྣོད་བཅུད་ཀྱི་འཇིག་རྟེན་རྣམས་ཚོགས་ཤིང་མ་འདུས་པའི་རིལ་པོ་རགས་པ་ཆ་མེད་གཅིག་ཏུ་གྲུབ་པར་མ་གཟིགས་པས། འཇིག་རྟེན་ན་རིལ་བོར་རགས་པ་ལིང་པོ་ཆ་མེད་གཅིག་ཏུ་གྲུབ་པར་འཛིན་པ་གང་གསུངས་པའི་འཛིན་པ་དེ་ཡང་དོན་དམ་པར་འཛིན་པར་གྲུབ་པར་མ་མཆིས་སོ་ཞེས་པའི་སྔ་མ་གཟུང་བྱ་དང་། འདིས་འཛིན་པ་ཡང་དོན་དམ་པར་འགྲུབ་པར་སྟོན་པར་བཤད་དོ། ། ཕྱི་མ་འདིས་བཅུད་ཀྱི་འཇིག་རྟེན་སྟོན་པའི་དབང་དུ་བྱས་ན་བཅུད་ཀྱི་སེམས་ཅན་རྣམས་ཀྱི་ལུས་ནི་རྡུལ་ཕྲ་རབ་བསགས་པ་ལས་བྱུང་བའི་རགས་པ་ཡིན་ཏེ། དེ་རྡུལ་ཕྲ་མོ་ཚོགས་ཤིང་འདུས་པ་ལ་མ་ལྟོས་པར་ངོ་བོ་ཉིད་ཀྱིས་རགས་པ་རིལ་པོ་ཆ་མེད་གཅིག་ཏུ་འཛིན་པ་འགོག་པ་ཡིན་ནོ། །ཕྲ་རབ་བསགས་པའི་རགས་པ་རྣམས་ནི་ཚོགས་ཤིང་འདུས་པའི་རྫུན་པ་ཡིན་པར་ངེས་སླ་ཡང་། རྡུལ་ཕྲ་རབ་ནི་རྫུན་པར་ཅུང་ངེས་དཀའ་བའི་དབང་གིས་དེ་ཆ་མེད་དང་རྟག་པ་དང་དོན་དམ་བདེན་པར་འདོད་པ་ཡང་བྱུང་ངོ་། །",
            "type": "source",
            "mapping": []
        },
        {
            "content": "དེ་ལྟར་གྲུབ་ན་དེ་བཞིན་གཤེགས་པས་ཀྱང་གཟིགས་དགོས་པར་འགྱུར་རོ། ། དེ་བཞིན་གཤེགས་པས་དེ་ལྟ་བུའི་སྣོད་བཅུད་ཀྱི་འཇིག་རྟེན་རྣམས་ཚོགས་ཤིང་མ་འདུས་པའི་རིལ་པོ་རགས་པ་ཆ་མེད་གཅིག་ཏུ་གྲུབ་པར་མ་གཟིགས་པས། འཇིག་རྟེན་ན་རིལ་བོར་རགས་པ་ལིང་པོ་ཆ་མེད་གཅིག་ཏུ་གྲུབ་པར་འཛིན་པ་གང་གསུངས་པའི་འཛིན་པ་དེ་ཡང་དོན་དམ་པར་འཛིན་པར་གྲུབ་པར་མ་མཆིས་སོ་ཞེས་པའི་སྔ་མ་གཟུང་བྱ་དང་། འདིས་འཛིན་པ་ཡང་དོན་དམ་པར་འགྲུབ་པར་སྟོན་པར་བཤད་དོ། ། ཕྱི་མ་འདིས་བཅུད་ཀྱི་འཇིག་རྟེན་སྟོན་པའི་དབང་དུ་བྱས་ན་བཅུད་ཀྱི་སེམས་ཅན་རྣམས་ཀྱི་ལུས་ནི་རྡུལ་ཕྲ་རབ་བསགས་པ་ལས་བྱུང་བའི་རགས་པ་ཡིན་ཏེ། དེ་རྡུལ་ཕྲ་མོ་ཚོགས་ཤིང་འདུས་པ་ལ་མ་ལྟོས་པར་ངོ་བོ་ཉིད་ཀྱིས་རགས་པ་རིལ་པོ་ཆ་མེད་གཅིག་ཏུ་འཛིན་པ་འགོག་པ་ཡིན་ནོ། །ཕྲ་རབ་བསགས་པའི་རགས་པ་རྣམས་ནི་ཚོགས་ཤིང་འདུས་པའི་རྫུན་པ་ཡིན་པར་ངེས་སླ་ཡང་། རྡུལ་ཕྲ་རབ་ནི་རྫུན་པར་ཅུང་ངེས་དཀའ་བའི་དབང་གིས་དེ་ཆ་མེད་དང་རྟག་པ་དང་དོན་དམ་བདེན་པར་འདོད་པ་ཡང་བྱུང་ངོ་། །",
            "type": "source",
            "mapping": []
        },
        {
            "content": "དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་རབ་འབྱོར་ལ་རིལ་བོར་འཛིན་པ་དེ་ཉིད་ནི་འཇིག་རྟེན་གྱི་ཐ་སྙད་དུ་ཡོད་ཅིང་དོན་དམ་པར་མེད་ལ། གཟུང་བྱའི་ཆོས་དེ་ནི་དོན་དམ་པར་བརྗོད་དུ་མེད་པ་ཡིན་ན་ཡང་། བྱིས་པ་སོ་སོ་སྐྱེ་བོ་རྣམས་ཀྱིས་དེ་དོན་དམ་པར་བརྗོད་དུ་ཡོད་པར་ཞེན་ནས་བཟུང་ངོ་། །",
            "type": "source",
            "mapping": []
        },
        {
            "content": "དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་རབ་འབྱོར་ལ་རིལ་བོར་འཛིན་པ་དེ་ཉིད་ནི་འཇིག་རྟེན་གྱི་ཐ་སྙད་དུ་ཡོད་ཅིང་དོན་དམ་པར་མེད་ལ། གཟུང་བྱའི་ཆོས་དེ་ནི་དོན་དམ་པར་བརྗོད་དུ་མེད་པ་ཡིན་ན་ཡང་། བྱིས་པ་སོ་སོ་སྐྱེ་བོ་རྣམས་ཀྱིས་དེ་དོན་དམ་པར་བརྗོད་དུ་ཡོད་པར་ཞེན་ནས་བཟུང་ངོ་། །",
            "type": "source",
            "mapping": []
        },
        {
            "content": "དེ་ནས་རབ་འབྱོར་སེམས་ཅན་གང་ལ་ལ་ཞིག་འདི་སྐད་དུ་དེ་བཞིན་གཤེགས་པས་གང་ཟག་གི་བདག་ཏུ་ལྟ་བ་དང་། སེམས་ཅན་དང་སྲོག་དང་གང་ཟག་ཏུ་ལྟ་བར་རང་ལུགས་ལ་གསུངས་སོ་ཞེས་ཟེར་ན། དེ་ཡང་དག་པ་སྟེ་ལེགས་པར་སྨྲ་བས་སྨྲ་བ་ཡིན་ནམ་ཞེས་དྲིས་པ་ན། ལན་དུ་རབ་འབྱོར་གྱིས་དེ་མ་ལགས་སོ། །",
            "type": "source",
            "mapping": []
        },
        {
            "content": "དེ་ནས་རབ་འབྱོར་སེམས་ཅན་གང་ལ་ལ་ཞིག་འདི་སྐད་དུ་དེ་བཞིན་གཤེགས་པས་གང་ཟག་གི་བདག་ཏུ་ལྟ་བ་དང་། སེམས་ཅན་དང་སྲོག་དང་གང་ཟག་ཏུ་ལྟ་བར་རང་ལུགས་ལ་གསུངས་སོ་ཞེས་ཟེར་ན། དེ་ཡང་དག་པ་སྟེ་ལེགས་པར་སྨྲ་བས་སྨྲ་བ་ཡིན་ནམ་ཞེས་དྲིས་པ་ན། ལན་དུ་རབ་འབྱོར་གྱིས་དེ་མ་ལགས་སོ། །",
            "type": "source",
            "mapping": []
        },
        {
            "content": "དེ་ནས་རབ་འབྱོར་སེམས་ཅན་གང་ལ་ལ་ཞིག་འདི་སྐད་དུ་དེ་བཞིན་གཤེགས་པས་གང་ཟག་གི་བདག་ཏུ་ལྟ་བ་དང་། སེམས་ཅན་དང་སྲོག་དང་གང་ཟག་ཏུ་ལྟ་བར་རང་ལུགས་ལ་གསུངས་སོ་ཞེས་ཟེར་ན། དེ་ཡང་དག་པ་སྟེ་ལེགས་པར་སྨྲ་བས་སྨྲ་བ་ཡིན་ནམ་ཞེས་དྲིས་པ་ན། ལན་དུ་རབ་འབྱོར་གྱིས་དེ་མ་ལགས་སོ། །",
            "type": "source",
            "mapping": []
        },
        {
            "content": "དེ་ནས་རབ་འབྱོར་སེམས་ཅན་གང་ལ་ལ་ཞིག་འདི་སྐད་དུ་དེ་བཞིན་གཤེགས་པས་གང་ཟག་གི་བདག་ཏུ་ལྟ་བ་དང་། སེམས་ཅན་དང་སྲོག་དང་གང་ཟག་ཏུ་ལྟ་བར་རང་ལུགས་ལ་གསུངས་སོ་ཞེས་ཟེར་ན། དེ་ཡང་དག་པ་སྟེ་ལེགས་པར་སྨྲ་བས་སྨྲ་བ་ཡིན་ནམ་ཞེས་དྲིས་པ་ན། ལན་དུ་རབ་འབྱོར་གྱིས་དེ་མ་ལགས་སོ། །",
            "type": "source",
            "mapping": []
        },
        {
            "content": "རྒྱུ་མཚན་དེ་ཅིའི་སླད་དུ་ཞེ་ན། དེ་བཞིན་གཤེགས་པས་གཞན་གྱིས་བདག་ཏུ་ལྟ་བ་སོགས་སུ་གང་གསུངས་པ་དེ་ནི། བདག་ཏུ་ལྟ་བ་སོགས་རྣམ་པར་བཤིག་པ་དང་། ལྟ་བ་དེ་དག་གི་ཞེན་ཡུལ་མེད་པ་དང་ལྟ་བ་དེ་ཡང་དོན་དམ་པར་མ་མཆིས་པར་དེ་བཞིན་གཤེགས་པས་གསུངས་པའི་སླད་དུ་སྟེ། དེས་ན་ཐ་སྙད་དུ་བདག་ཏུ་ལྟ་བ་སོགས་ཞེས་བགྱིའོ། །",
            "type": "source",
            "mapping": []
        },
        {
            "content": "རྒྱུ་མཚན་དེ་ཅིའི་སླད་དུ་ཞེ་ན། དེ་བཞིན་གཤེགས་པས་གཞན་གྱིས་བདག་ཏུ་ལྟ་བ་སོགས་སུ་གང་གསུངས་པ་དེ་ནི། བདག་ཏུ་ལྟ་བ་སོགས་རྣམ་པར་བཤིག་པ་དང་། ལྟ་བ་དེ་དག་གི་ཞེན་ཡུལ་མེད་པ་དང་ལྟ་བ་དེ་ཡང་དོན་དམ་པར་མ་མཆིས་པར་དེ་བཞིན་གཤེགས་པས་གསུངས་པའི་སླད་དུ་སྟེ། དེས་ན་ཐ་སྙད་དུ་བདག་ཏུ་ལྟ་བ་སོགས་ཞེས་བགྱིའོ། །",
            "type": "source",
            "mapping": []
        },
        {
            "content": "དེ་ནས་མཇུག་སྡུད་པར་བཞེད་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་རབ་འབྱོར་འདི་ལ་བྱང་ཆུབ་སེམས་དཔའི་ཐེག་པ་ལ་ཡང་དག་པར་ཞུགས་པས། ཇི་སྐད་བཤད་པ་འདི་ལྟར་ཆོས་ཐམས་ཅད་ལ་སྦྱར་ནས་ཤེས་པ་དང་བལྟ་བ་དང་མོས་པར་བྱ་ཞེས་པའི་ཤེས་པ་ནི་ཐོས་པའི་ཤེས་རབ། ལྟ་བ་ནི་བསམ་པའི་ཤེས་རབ། མོས་པ་ནི་བསྒོམས་པའི་ཤེས་རབ་བསྐྱེད་པར་བྱ་ཞེས་པའོ། །",
            "type": "source",
            "mapping": []
        },
        {
            "content": "དེ་ནས་མཇུག་སྡུད་པར་བཞེད་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་རབ་འབྱོར་འདི་ལ་བྱང་ཆུབ་སེམས་དཔའི་ཐེག་པ་ལ་ཡང་དག་པར་ཞུགས་པས། ཇི་སྐད་བཤད་པ་འདི་ལྟར་ཆོས་ཐམས་ཅད་ལ་སྦྱར་ནས་ཤེས་པ་དང་བལྟ་བ་དང་མོས་པར་བྱ་ཞེས་པའི་ཤེས་པ་ནི་ཐོས་པའི་ཤེས་རབ། ལྟ་བ་ནི་བསམ་པའི་ཤེས་རབ། མོས་པ་ནི་བསྒོམས་པའི་ཤེས་རབ་བསྐྱེད་པར་བྱ་ཞེས་པའོ། །",
            "type": "source",
            "mapping": []
        },
        {
            "content": "རྒྱུ་མཚན་དེ་ཅིའི་ཕྱིར་ཞེ་ན། རབ་འབྱོར་ཆོས་སུ་འདུ་ཤེས་ཞེས་བྱ་བ་ནི། འདུ་ཤེས་པའི་ཡུལ་དང་འདུ་ཤེས་པ་ཉིད་ཀྱང་དོན་དམ་པར་འདུ་ཤེས་མེད་པར་དེ་བཞིན་གཤེགས་པས་གསུངས་པའི་ཕྱིར་ཏེ། དེས་ན་ཐ་སྙད་དུ་ཆོས་སུ་འདུ་ཤེས་ཞེས་བགྱིའོ། །",
            "type": "source",
            "mapping": []
        },
        {
            "content": "རྒྱུ་མཚན་དེ་ཅིའི་ཕྱིར་ཞེ་ན། རབ་འབྱོར་ཆོས་སུ་འདུ་ཤེས་ཞེས་བྱ་བ་ནི། འདུ་ཤེས་པའི་ཡུལ་དང་འདུ་ཤེས་པ་ཉིད་ཀྱང་དོན་དམ་པར་འདུ་ཤེས་མེད་པར་དེ་བཞིན་གཤེགས་པས་གསུངས་པའི་ཕྱིར་ཏེ། དེས་ན་ཐ་སྙད་དུ་ཆོས་སུ་འདུ་ཤེས་ཞེས་བགྱིའོ། །",
            "type": "source",
            "mapping": []
        },
        {
            "content": "དེ་ལྟར་གལ་ཆེ་བ་ལ་དགོངས་ཏེ་ཕན་ཡོན་བསྟན་པའི་སྒོ་ནས་མཇུག་བསྡུ་བ་ནི། རབ་འབྱོར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་གང་གིས་འཇིག་རྟེན་གྱི་ཁམས་དཔག་ཏུ་མེད་པ་དང་གསེར་དངུལ་མུ་ཏིག་སོགས་རིན་པོ་ཆེ་སྣ་བདུན་གྱིས་གང་བར་བྱས་ཏེ་སྦྱིན་པ་བྱིན་པ་བས་ཀྱང་། རིགས་ཀྱི་བུའམ། རིགས་ཀྱི་བུ་མོ་གང་གིས་གཞུང་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་འདི་རྫོགས་པར་ལྟ་ཞོག །ཐ་ན་ཟབ་མོ་སྟོན་པའི་ཚིག་རྐང་པ་བཞི་པའི་ཚིགས་སུ་བཅད་པ་ཙམ་བྲིས་ནས་བློ་ལ་འཛིན་ཏམ། གླེགས་བམ་ཀློག་གམ། གླེགས་བམ་ཡོངས་རྫོགས་ལག་ཏུ་འཆང་ངམ། དེའི་ཚིག་དོན་རྣམས་ཀུན་ཆུབ་པ་སྟེ་ཤེས་པར་བྱེད་དམ། རང་གིས་ཚིག་དོན་ཤེས་པ་ལྟར་སེམས་ཅན་གཞན་དག་ལ་ཡང་རྒྱ་ཆེར་ཡང་དག་པར་རབ་ཏུ་སྟོན་པར་བྱེད་ན། གང་ཟག་དེ་ཉིད་དེ་ལྟ་བུ་བྱས་པའི་གཞི་དེ་ལས་བསོད་ནམས་ཏེ་དོན་ལ་ཕན་ཡོན་ཆེས་མང་དུ་གྲངས་མེད་དཔག་ཏུ་མེད་པ་བསྐྱེད་དོ། །",
            "type": "source",
            "mapping": []
        },
        {
            "content": "གཞུང་འདི་སྟོན་ཚུལ་ཇི་ལྟར་བྱ་བ་ནི། ཇི་ལྟར་ཡང་དག་པར་རབ་ཏུ་སྟོན་ཅེ་ན། དེ་ཡང་བརྗོད་ཅིང་སྟོན་པ་དང་གོ་བ་རྣམས་ནི་ཐ་སྙད་ཙམ་དུ་འཇོག་ཅིང་། དོན་དམ་པར་བརྗོད་བྱ་རྗོད་བྱེད་སོགས་མེད་པས་དོན་ཇི་ལྟར་ཡང་དག་པར་རམ་དོན་དམ་པར་རམ་རབ་ཏུ་མི་སྟོན་ཀྱང་ཐ་སྙད་དུ་སྟོན་པ་དེ་བཞིན་དུ།  འདིར་ཡང་ཐ་སྙད་ཙམ་དུ་ཚིག་དང་དོན་ཕྱིན་ཅི་མ་ལོག་པར་ཡང་དག་པར་རབ་ཏུ་སྟོན་ཏེ། རྒྱུ་མཚན་དེས་ན། ཡང་དག་པར་རབ་ཏུ་སྟོན་པ་ཞེས་བྱའོ། །",
            "type": "source",
            "mapping": []
        },
        {
            "content": "གཞུང་འདི་སྟོན་ཚུལ་ཇི་ལྟར་བྱ་བ་ནི། ཇི་ལྟར་ཡང་དག་པར་རབ་ཏུ་སྟོན་ཅེ་ན། དེ་ཡང་བརྗོད་ཅིང་སྟོན་པ་དང་གོ་བ་རྣམས་ནི་ཐ་སྙད་ཙམ་དུ་འཇོག་ཅིང་། དོན་དམ་པར་བརྗོད་བྱ་རྗོད་བྱེད་སོགས་མེད་པས་དོན་ཇི་ལྟར་ཡང་དག་པར་རམ་དོན་དམ་པར་རམ་རབ་ཏུ་མི་སྟོན་ཀྱང་ཐ་སྙད་དུ་སྟོན་པ་དེ་བཞིན་དུ།  འདིར་ཡང་ཐ་སྙད་ཙམ་དུ་ཚིག་དང་དོན་ཕྱིན་ཅི་མ་ལོག་པར་ཡང་དག་པར་རབ་ཏུ་སྟོན་ཏེ། རྒྱུ་མཚན་དེས་ན། ཡང་དག་པར་རབ་ཏུ་སྟོན་པ་ཞེས་བྱའོ། །",
            "type": "source",
            "mapping": []
        },
        {
            "content": "དེ་ནས་འདུས་བྱས་ཀྱི་ཆོས་རྣམས་རང་བཞིན་མེད་ཅིང་མི་རྟག་པར་བསྟན་ནས་མཇུག་བསྡུ་བ་ནི། སྐར་མ་རབ་རིབ་མར་མེ་དང་། །ཞེས་གསུངས་ཏེ། གཟུགས་ལ་སོགས་པའི་ཕུང་པོ་ལྔ་སོགས་ལ་མཚོན་ན། དཔེར་ཇི་ལྟར་ན།སྐར་མ་རྣམས་ནི་མཚན་མོར་སྣང་ཞིང་། ཉིན་མོར་མི་སྣང་བ་དེ་བཞིན་དུ་ཕུང་སོགས་ཀྱི་འདུས་བྱས་རྣམས་ནི་མ་རིག་པའི་མུན་པ་ཡོད་ན་དོན་དམ་པར་སྣང་གི ། བདེན་མེད་རྟོགས་པའི་ཡེ་ཤེས་ཀྱི་ཉི་མ་ཤར་བ་ན་དོན་དམ་པར་མི་སྣང་བས་སྐར་མ་བཞིན་དུ་བལྟའོ། །རྡུལ་སོགས་རབ་རིབ་ཀྱིས་མིག་བསྒྲིབས་པའི་ཚེ་དོན་ཇི་ལྟ་བ་བཞིན་དུ་མི་སྣང་བར་གཞན་དུ་མཐོང་བ་ལྟར་མ་རིག་པའི་རབ་རིབ་ཀྱིས་བློ་མིག་བསྒྲིབས་པའི་ངོར་འདུས་བྱས་རྣམས་ཀྱང་དོན་གཞན་དུ་སྣང་ངོ་། །མར་མེ་ནི་སྡོང་བུ་ལ་བརྟེན་ནས་མྱུར་དུ་སྐྱེ་ཞིང་རྡོ་རྗེ་གཅོད་པའི་འགྲེལ་པ་ཐར་པར་བགྲོད་པའི་ལམ་བཟང་།འཇིག་པ་དེ་བཞིན་དུ་འདུས་བྱས་རྣམས་ནི་རང་རང་གི་རྒྱུ་རྐྱེན་ལ་བརྟེན་ནས་མྱུར་དུ་སྐྱེ་འཇིག་བྱེད་དོ། །སྒྱུ་མ་ནི་དོན་གཞན་དུ་སྣང་བ་ལྟར་འདུས་བྱས་རྣམས་ནི་བློ་འཁྲུལ་བའི་ངོར་བདེན་པར་སྣང་ངོ་། །ཟིལ་བ་ནི་མྱུར་དུ་འཇིག་པ་ལྟར་འདུས་བྱས་རྣམས་ནི་རང་གི་དུས་གཉིས་པར་མི་སྡོད་པར་མྱུར་དུ་འཇིག་གོ །ཆུ་བུར་ནི་ཆུ་འཁྲུགས་པ་སོགས་ལས་གློ་བུར་དུ་འབྱུང་ཞིང་འཇིག་པ་ལྟར་འདུས་བྱས་རྣམས་ནི་རྐྱེན་ཚོགས་ན་གློ་བུར་དུ་འབྱུང་ཞིང་འཇིག་གོ །རྨི་ལམ་ནི་གཉིད་ཀྱིས་བསླད་པའི་ཚེ་འཁྲུལ་སྣང་ཡིན་པ་ལྟར་འདུས་བྱས་རྣམས་ནི་མ་རིག་པས་བསླད་པའི་ངོར་བདེན་སྣང་དུ་འཆར་རོ། །གློག་ནི་མྱུར་དུ་འབྱུང་ཞིང་འཇིག་པ་ལྟར་འདུས་བྱས་རྣམས་ནི་རྐྱེན་ཚོགས་ན་མྱུར་དུ་འབྱུང་ཞིང་འཇུག་གོ །སྤྲིན་ནི་ཀླུ་སོགས་ཀྱི་བསམ་པའི་དབང་གིས་མཁའ་ལ་སྐྱེ་ཞིང་འཇིག་པ་ལྟར་འདུས་བྱས་རྣམས་ནི། ཐུན་མོང་དང་ཐུན་མོང་མ་ཡིན་པའི་ལས་དབང་གིས་སྐྱེ་འཇིག་བྱེད་པར་འགྱུར་ཞེས་པའི་དཔེ་རྣམས་ཀྱིས་ཀྱང་འདུས་བྱས་ཐམས་ཅད་བདེན་མེད་དུ་བཤད་དོ། ། དེ་དག་ནི་འདུས་བྱས་རྣམས་ལ་ཐུན་མོང་དུ་སྦྱར་ནས་བཤད་པ་སྟེ། མདོ་ལས་ནི། གཟུགས་ནི་དབུ་བ་བརྡོས་པ་འདྲ། །ཚོར་བ་ཆུ་ཡི་ཆུ་བུར་བཞིན། །འདུ་ཤེས་སྨིག་རྒྱུ་ལྟ་བུ་སྟེ། །འདུ་བྱེད་རྣམས་ནི་ཆུ་ཤིང་བཞིན། །རྣམ་པར་ཤེས་པ་སྒྱུ་མ་ལྟར། །ཉི་མའི་གཉེན་གྱིས་བཀའ་བསྩལ་ཏོ། །ཞེས་བཤད་ཅེས་མགོན་པོ་ཀླུ་སྒྲུབ་གསུང་ངོ་། ། སློབ་དཔོན་ཀཱ་མ་ལ་ཤཱི་ལས་ནི་ཕྱི་མ་གསུམ་དུས་གསུམ་དང་སྦྱར་ནས་སྔ་མ་ལས་མི་འདྲ་བར་བཤད་ཀྱང་མི་འགལ་ལོ། ། མདོར་ན་འདུས་བྱས་ཐམས་ཅད་ཀྱང་གོང་དུ་བཤད་པའི་དཔེ་དགུ་པོ་དེ་ལྟར་མི་རྟག་པ་དང་རང་བཞིན་མེད་པར་བལྟ་བོ་ཞེས་སོ། །འདིས་ཀྱང་གང་ཟག་དང་ཆོས་ཀྱི་བདག་མེད་པ་གཉིས་ཀ་བསྟན་པར་བཟུང་ངོ་། །",
            "type": "source",
            "mapping": []
        },
        {
            "content": "མཇུག་གི་རིམ་པ།གསུམ་པ་མཇུག་གི་རིམ་པ་ནི།  བཅོམ་ལྡན་འདས་ཀྱིས་དེ་སྐད་ཅེས་བཀའ་བསྩལ་ནས། དེ་ལ་གནས་བརྟན་རབ་འབྱོར་དང་། དེ་ལས་གཞན་པའི་དགེ་སློང་སྟོང་ཉིས་བརྒྱ་ལྔ་བཅུ་པོ་དེ་དག་དང་།བྱང་ཆུབ་སེམས་དཔའ་དེ་དག་དང་། དགེ་སློང་ཕ་དང་། དགེ་སློང་མ་དང་། དགེ་བསྙེན་ཕ་དང་། དགེ་བསྙེན་མའི་འཁོར་རྣམ་པ་བཞི་པོ་དང་། གཞན་ཡང་ལྷ་དང་མི་དང་ལྷ་མ་ཡིན་དང་དྲི་ཟར་བཅས་པའི་འཇིག་རྟེན་གྱི་སེམས་ཅན་རྣམས་ཡི་རང་ཞིང་དགའ་སྟེ།  བཅོམ་ལྡན་འདས་ཀྱིས་ཇི་སྐད་གསུངས་པ་ལ་མངོན་པར་བསྟོད་དོ་ཞེས་སོ། །",
            "type": "source",
            "mapping": []
        },
        {
            "content": "མཇུག་གི་རིམ་པ།གསུམ་པ་མཇུག་གི་རིམ་པ་ནི།  བཅོམ་ལྡན་འདས་ཀྱིས་དེ་སྐད་ཅེས་བཀའ་བསྩལ་ནས། དེ་ལ་གནས་བརྟན་རབ་འབྱོར་དང་། དེ་ལས་གཞན་པའི་དགེ་སློང་སྟོང་ཉིས་བརྒྱ་ལྔ་བཅུ་པོ་དེ་དག་དང་།བྱང་ཆུབ་སེམས་དཔའ་དེ་དག་དང་། དགེ་སློང་ཕ་དང་། དགེ་སློང་མ་དང་། དགེ་བསྙེན་ཕ་དང་། དགེ་བསྙེན་མའི་འཁོར་རྣམ་པ་བཞི་པོ་དང་། གཞན་ཡང་ལྷ་དང་མི་དང་ལྷ་མ་ཡིན་དང་དྲི་ཟར་བཅས་པའི་འཇིག་རྟེན་གྱི་སེམས་ཅན་རྣམས་ཡི་རང་ཞིང་དགའ་སྟེ།  བཅོམ་ལྡན་འདས་ཀྱིས་ཇི་སྐད་གསུངས་པ་ལ་མངོན་པར་བསྟོད་དོ་ཞེས་སོ། །",
            "type": "source",
            "mapping": []
        },
        {
            "content": "",
            "type": "source",
            "mapping": []
        },
        {
            "content": "",
            "type": "source",
            "mapping": []
        },
        {
            "content": "",
            "type": "source",
            "mapping": []
        },
        {
            "content": "",
            "type": "source",
            "mapping": []
        }
    ]
}