[
    {
        "segment_content": "༄༅། །འཕགས་པ་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་རྡོ་རྗེ་གཅོད་པ་ཞེས་བྱ་བ་བཞུགས་སོ། །\n",
        "id": "47f74134-0975-4ea7-99a9-fa77c445a314"
    },
    {
        "segment_content": "རྒྱ་གར་སྐད་དུ། ཨརྱཱ་བཛྲ་ཙྪེད་ཀ་པྲཛྙཱ་པ་ར་མི་ཏཱ་ནཱ་མ་མ་ཧཱ་ཡ་ན་སཱུ་ཏྲ། \n",
        "id": "1b0689b1-73ff-47dd-abf2-82293707aa3b"
    },
    {
        "segment_content": "བོད་སྐད་དུ། འཕགས་པ་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་རྡོ་རྗེ་གཅོད་པ་ཞེས་བྱ་བ་ཐེག་པ་ཆེན་པོའི་མདོ།\n",
        "id": "e82374f0-6873-4042-9511-f226932053d6"
    },
    {
        "segment_content": "སངས་རྒྱས་དང་བྱང་ཆུབ་སེམས་དཔའ་ཐམས་ཅད་ལ་ཕྱག་འཚལ་ལོ། །\n",
        "id": "eda352ec-7b42-4466-aeab-d5d7de85b9d0"
    },
    {
        "segment_content": "འདི་སྐད་བདག་གིས་ཐོས་པ་དུས་གཅིག་ན། \n",
        "id": "bab9a71a-3c2a-4ee0-82a4-6df71c5ad694"
    },
    {
        "segment_content": "བཅོམ་ལྡན་འདས་མཉན་ཡོད་ན་རྒྱལ་བུ་རྒྱལ་བྱེད་ཀྱི་ཚལ་མགོན་མེད་ཟས་སྦྱིན་གྱི་ཀུན་དགའ་ར་བ་ན། དགེ་སློང་སྟོང་ཉིས་བརྒྱ་ལྔ་བཅུའི་དགེ་སློང་གི་དགེ་འདུན་ཆེན་པོ་དང༌། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རབ་ཏུ་མང་པོ་དག་དང་ཐབས་གཅིག་ཏུ་བཞུགས་སོ། །\n",
        "id": "defe6304-b272-40fe-ade8-d1784d534480"
    },
    {
        "segment_content": "དེ་ནས་བཅོམ་ལྡན་འདས་སྔ་དྲོའི་དུས་ཀྱི་ཚེ། ཤམ་ཐབས་དང་ཆོས་གོས་སྐུ་ལ་གསོལ་ཏེ། ལྷུང་བཟེད་བསྣམས་ནས་མཉན་ཡོད་ཀྱི་གྲོང་ཁྱེར་ཆེན་པོར་བསོད་སྙོམས་ཀྱི་ཕྱིར་གཤེགས་སོ། །\n",
        "id": "80613014-778a-43cd-a33f-e3efe472ebfc"
    },
    {
        "segment_content": "དེ་ནས་བཅོམ་ལྡན་འདས་མཉན་ཡོད་ཀྱི་གྲོང་ཁྱེར་ཆེན་པོར་བསོད་སྙོམས་ཀྱི་ཕྱིར་གཤེགས་ནས་ཞལ་ཟས་གསོལ་ཏེ་ཟས་ཀྱི་བྱ་བ་མཛད་དེ། \n",
        "id": "62335b3c-828e-41c8-9093-5b9f43d8a1b9"
    },
    {
        "segment_content": "ཟས་ཕྱི་མའི་བསོད་སྙོམས་སྤངས་ནས་ལྷུང་བཟེད་དང་ཆོས་གོས་བཞག་ནས། ཞབས་བསིལ་ཏེ་གདན་བཤམས་པ་ལ་སྐྱིལ་མོ་ཀྲུང་བཅས་ནས་སྐུ་དྲང་པོར་བསྲང་སྟེ། དྲན་པ་མངོན་དུ་བཞག་ནས་བཞུགས་སོ། །\n",
        "id": "8565c85e-655a-4b92-8e42-bddbdfd4f5c3"
    },
    {
        "segment_content": "དེ་ནས་དགེ་སློང་མང་པོས་བཅོམ་ལྡན་འདས་ག་ལ་བ་དེར་དོང་སྟེ་ལྷགས་ནས། \n",
        "id": "974b1b06-863e-40f1-9865-7571fab66fec"
    },
    {
        "segment_content": "བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་ལ་མགོ་བོས་ཕྱག་འཚལ་ཏེ་ལན་གསུམ་བསྐོར་བ་བྱས་ནས་ཕྱོགས་གཅིག་ཏུ་འཁོད་དོ། །\n",
        "id": "0eef0ec5-43f2-452e-a53d-6a78ede4f4af"
    },
    {
        "segment_content": "ཡང་དེའི་ཚེ་ཚེ་དང་ལྡན་པ་རབ་འབྱོར་འཁོར་དེ་ཉིད་དུ་འདུས་པར་གྱུར་ཏེ་འདུག་གོ །\n",
        "id": "ff50a41f-a97a-4d22-b0d0-b05d124efede"
    },
    {
        "segment_content": "དེ་ནས་ཚེ་དང་ལྡན་པ་རབ་འབྱོར་སྟན་ལས་ལངས་ཏེ་བླ་གོས་ཕྲག་པ་གཅིག་ཏུ་གཟར་ནས་པུས་མོ་གཡས་པའི་ལྷ་ང་ས་ལ་བཙུགས་ཏེ། བཅོམ་ལྡན་འདས་ག་ལ་བ་དེར་ལོགས་སུ་ཐལ་མོ་སྦྱར་བ་བཏུད་ནས། \n",
        "id": "c38082e3-a8ac-47b8-b876-a0338283c138"
    },
    {
        "segment_content": "བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །\n",
        "id": "b9327fef-da3a-4b83-8fbf-8c4b40a6cec0"
    },
    {
        "segment_content": "བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཀྱིས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་ལ་ཕན་གདགས་པའི་དམ་པ་ཇི་སྙེད་པས་ཕན་གདགས་པ་དང༌། དེ་བཞིན་གཤེགས་པས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་ལ་ཡོངས་སུ་གཏད་པའི་དམ་པ་ཇི་སྙེད་པས་ཡོངས་སུ་གཏད་པ་ནི། བཅོམ་ལྡན་འདས་ངོ་མཚར་ལགས་སོ། ། བདེ་བར་གཤེགས་པ་ངོ་མཚར་ལགས་སོ། །\n",
        "id": "d18c384f-137a-479d-815e-9b8665a1784b"
    },
    {
        "segment_content": "བཅོམ་ལྡན་འདས་བྱང་ཆུབ་སེམས་དཔའི་ཐེག་པ་ལ་ཡང་དག་པར་ཞུགས་པས་ཇི་ལྟར་གནས་པར་བགྱི། \n",
        "id": "83dd3a02-7bb6-45f0-b5b1-fddce88391cf"
    },
    {
        "segment_content": "ཇི་ལྟར་བསྒྲུབ་པར་བགྱི། \n",
        "id": "88d0653f-9895-4467-8bd0-05158ef595e4"
    },
    {
        "segment_content": "ཇི་ལྟར་སེམས་རབ་ཏུ་གཟུང་བར་བགྱི། \n",
        "id": "141d53b5-a44a-4d6f-a945-78349de58353"
    },
    {
        "segment_content": "དེ་སྐད་ཅེས་གསོལ་པ་དང༌། \n",
        "id": "de18f27c-3bc1-43a8-b883-9529e8104b4f"
    },
    {
        "segment_content": "བཅོམ་ལྡན་འདས་ཀྱིས་ཚེ་དང་ལྡན་པ་རབ་འབྱོར་ལ་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ། །\n",
        "id": "9e67ed37-fbea-466d-9e6e-e0ef43a8785e"
    },
    {
        "segment_content": "རབ་འབྱོར་ལེགས་སོ་ལེགས་སོ། །\n",
        "id": "a73e032a-1ca4-4a8d-a084-380db7cf93ab"
    },
    {
        "segment_content": "རབ་འབྱོར་དེ་དེ་བཞིན་ནོ། །དེ་དེ་བཞིན་ཏེ།\n",
        "id": "291c490d-8b78-4342-a87c-0e89a93de29e"
    },
    {
        "segment_content": "དེ་བཞིན་གཤེགས་པས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་ལ་ཕན་གདགས་པའི་དམ་པས་ཕན་གདགས་སོ། །\n",
        "id": "5a44abf4-fb28-4e65-8d16-9ef9a7bd252b"
    },
    {
        "segment_content": "དེ་བཞིན་གཤེགས་པས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་ལ་ཡོངས་སུ་གཏད་པའི་དམ་པས་ཡོངས་སུ་གཏད་དོ། །\n",
        "id": "9bc6ff09-912a-4990-8292-20e75a1c3223"
    },
    {
        "segment_content": "རབ་འབྱོར་དེའི་ཕྱིར་ཉོན་ལ་ལེགས་པར་རབ་ཏུ་ཡིད་ལ་ཟུངས་ཤིག་དང༌།\n",
        "id": "f8edab27-04b8-4215-9b36-54273d5225b9"
    },
    {
        "segment_content": "བྱང་ཆུབ་སེམས་དཔའི་ཐེག་པ་ལ་ཡང་དག་པར་བཞུགས་པས་ཇི་ལྟར་གནས་པར་བྱ་བ་དང༌། ཇི་ལྟར་བསྒྲུབ་པར་བྱ་བ་དང༌།  ཇི་ལྟར་སེམས་རབ་ཏུ་གཟུང་བར་བྱ་བ་ངས་ཁྱོད་ལ་བཤད་དོ། །\n",
        "id": "35b36758-f5eb-42be-87cd-d977040dd080"
    },
    {
        "segment_content": "བཅོམ་ལྡན་འདས་དེ་དེ་བཞིན་ནོ། །ཞེས་གསོལ་ནས། \n",
        "id": "bba01fb1-a7e3-4a8c-a883-c43fe9466266"
    },
    {
        "segment_content": "ཚེ་དང་ལྡན་པ་རབ་འབྱོར་བཅོམ་ལྡན་འདས་ཀྱི་ལྟར་མཉན་པ་དང༌། བཅོམ་ལྡན་འདས་ཀྱིས་ཚེ་དང་ལྡན་པ་རབ་འབྱོར་ལ་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ། །\n",
        "id": "58646845-9b32-4f5f-88b7-0c123503b796"
    },
    {
        "segment_content": "རབ་འབྱོར་འདི་ལ་བྱང་ཆུབ་སེམས་དཔའི་ཐེག་པ་ལ་ཡང་དག་པར་ཞུགས་པས། འདི་སྙམ་དུ་བདག་གིས་སེམས་ཅན་ཇི་ཙམ་སེམས་ཅན་དུ་བསྡུ་བས་བསྡུས་པ། སྒོ་ང་ལས་སྐྱེས་པའམ། མངལ་ལས་སྐྱེས་པའམ། དྲོད་གཤེར་ལས་སྐྱེས་པའམ། རྫུས་ཏེ་སྐྱེས་པའམ། གཟུགས་ཅན་ནམ། གཟུགས་ཅན་མ་ཡིན་པའམ། འདུ་ཤེས་ཅན་ནམ། འདུ་ཤེས་མེད་འདུ་ཤེས་མེད་མིན་ནམ། སེམས་ཅན་གྱི་ཁམས་ཇི་ཙམ་སེམས་ཅན་དུ་གདགས་པའི་བརྟགས་པ་དེ་དག་ཐམས་ཅད་ཕུང་པོ་ལྷག་མ་མེད་པའི་མྱ་ངན་ལས་འདས་པའི་དབྱིངས་སུ་ཡོངས་སུ་མྱ་ངན་ལས་འདའོ། །\n",
        "id": "fd43a090-956d-4f38-92b4-873f353cb4be"
    },
    {
        "segment_content": "དེ་ལྟར་སེམས་ཅན་ཚད་མེད་པ་ཡོངས་སུ་མྱ་ངན་ལས་འདས་ཀྱང༌། སེམས་ཅན་གང་ཡང་ཡོངས་སུ་མྱ་ངན་ལས་འདས་པར་འགྱུར་བ་མེད་དོ་སྙམ་དུ་སེམས་བསྐྱེད་པར་བྱའོ། །\n",
        "id": "89ecfcd1-a048-4e2e-9b10-932ecfa8387c"
    },
    {
        "segment_content": "དེ་ཅིའི་ཕྱིར་ཞེ་ན། དེ་བྱང་ཆུབ་སེམས་དཔའ་ཞེས་མི་བྱ་བའི་ཕྱིར་རོ། །\n",
        "id": "c900d1e4-4b50-4e41-b706-df2adad32aac"
    },
    {
        "segment_content": "དེ་ཅིའི་ཕྱིར་ཞེ་ན། རབ་འབྱོར་གང་སེམས་ཅན་དུ་འདུ་ཤེས་འཇུག་གམ། སྲོག་ཏུ་འདུ་ཤེས་འཇུག་གམ། གང་ཟག་ཏུ་འདུ་ཤེས་འཇུག་ན། དེ་བྱང་ཆུབ་སེམས་དཔའ་ཞེས་མི་བྱ་བའི་ཕྱིར་རོ། །\n",
        "id": "8581f34d-f31b-4175-b8ce-c8ad34e3301a"
    },
    {
        "segment_content": "ཡང་རབ་འབྱོར་བྱང་ཆུབ་སེམས་དཔའ་དངོས་པོ་ལ་མི་གནས་པར་སྦྱིན་པ་སྦྱིན་པར་བྱའོ། །\n",
        "id": "fc146e38-32fe-442b-b0e9-e4c9e378f42a"
    },
    {
        "segment_content": "ཅི་ལ་ཡང་མི་གནས་པར་སྦྱིན་པ་སྦྱིན་པར་བྱའོ། །\n",
        "id": "4bc936d3-ec97-4a01-979c-2212802137cd"
    },
    {
        "segment_content": "གཟུགས་ལ་ཡང་མི་གནས་པར་སྦྱིན་པ་སྦྱིན་པར་བྱའོ། །\n",
        "id": "b9e20a27-e2e1-41ea-90b1-e0511d2074f7"
    },
    {
        "segment_content": "དེ་བཞིན་དུ་སྒྲ་དང༌། དྲི་དང་། རོ་དང༌། རེག་བྱ་དང༌། ཆོས་ལ་ཡང་མི་གནས་པར་སྦྱིན་པ་སྦྱིན་པར་བྱའོ། །\n",
        "id": "2fdfa3b1-21ea-4c43-9955-5e47ba0b0e7b"
    },
    {
        "segment_content": "རབ་འབྱོར་ཅི་ནས་ཀྱང་མཚན་མར་འདུ་ཤེས་པ་ལ་ཡང་མི་གནས་པར་དེ་ལྟར་བྱང་ཆུབ་སེམས་དཔས་སྦྱིན་པ་སྦྱིན་ནོ། །\n",
        "id": "a651285e-c479-4451-8c68-c30dd7f29b85"
    },
    {
        "segment_content": "དེ་ཅིའི་ཕྱིར་ཞེ་ན། རབ་འབྱོར་བྱང་ཆུབ་སེམས་དཔའ་གང་མི་གནས་པར་སྦྱིན་པ་སྦྱིན་པ་དེའི་བསོད་ནམས་ཀྱི་ཕུང་པོ་ནི། རབ་འབྱོར་ཚད་གཟུང་བར་སླ་བ་མ་ཡིན་པའི་ཕྱིར་རོ། །\n",
        "id": "20023ad6-c7e0-45bd-bfa5-900d5edf848a"
    },
    {
        "segment_content": "རབ་འབྱོར་འདི་ཇི་སྙམ་དུ་སེམས། ཤར་ཕྱོགས་ཀྱི་ནམ་མཁའི་ཚད་གཟུང་བར་སླ་སྙམ་མམ། \n",
        "id": "7d67f00d-9911-45ff-9007-ffac4072fa8d"
    },
    {
        "segment_content": "རབ་འབྱོར་གྱིས་གསོལ་པ། བཅོམ་ལྡན་འདས་དེ་ནི་མ་ལགས་སོ། །\n",
        "id": "17c6c344-d20a-4c6b-aaf1-f1c2d14dda1e"
    },
    {
        "segment_content": "བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། རབ་འབྱོར་དེ་བཞིན་དུ་ལྷོ་དང༌། ནུབ་དང༌། བྱང་དང༌། སྟེང་དང༌། འོག་གི་ཕྱོགས་དང༌། ཕྱོགས་མཚམས་དང༌། ཕྱོགས་བཅུའི་ནམ་མཁའི་ཚད་གཟུང་བར་སླའམ། \n",
        "id": "33fd6124-8c96-4e04-ae21-7c0fd38b91e8"
    },
    {
        "segment_content": "རབ་འབྱོར་གྱིས་གསོལ་པ། བཅོམ་ལྡན་འདས་དེ་ནི་མ་ལགས་སོ། །\n",
        "id": "17fef7d7-2dd0-4896-a3c8-f52a79431d93"
    },
    {
        "segment_content": "བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། རབ་འབྱོར་དེ་བཞིན་དུ་བྱང་ཆུབ་སེམས་དཔའ་གང་ལ་ཡང་མི་གནས་པར་སྦྱིན་པ་སྦྱིན་པ་དེའི་བསོད་ནམས་ཀྱི་ཕུང་པོ་ནི། རབ་འབྱོར་ཚད་གཟུང་བར་སླ་བ་མ་ཡིན་པའི་ཕྱིར་རོ། །\n",
        "id": "6600d2d0-3fc1-43bc-9614-b0d49d14ffd9"
    },
    {
        "segment_content": "རབ་འབྱོར་འདི་ཇི་སྙམ་དུ་སེམས། མཚན་ཕུན་སུམ་ཚོགས་པས་དེ་བཞིན་གཤེགས་པར་བལྟ་བར་བྱ་སྙམ་མམ། \n",
        "id": "bd2def6e-5c59-48ef-87c3-c9fbbc082b63"
    },
    {
        "segment_content": "རབ་འབྱོར་གྱིས་གསོལ་པ། བཅོམ་ལྡན་འདས་དེ་ནི་མ་ལགས་སོ། །\n",
        "id": "564c635a-2d3d-4172-b0f9-392515ed9449"
    },
    {
        "segment_content": "མཚན་ཕུན་སུམ་ཚོགས་པས་དེ་བཞིན་གཤེགས་པར་བལྟ་བར་མི་བགྱི་ལགས་སོ། །\n",
        "id": "302ff66a-146a-4fbc-b641-a542161077b3"
    },
    {
        "segment_content": "དེ་ཅིའི་སླད་དུ་ཞེ་ན། དེ་བཞིན་གཤེགས་པས་མཚན་ཕུན་སུམ་ཚོགས་པ་ཞེས་གང་གསུངས་པ་དེ་ཉིད། མཚན་ཕུན་སུམ་ཚོགས་པ་མ་མཆིས་པའི་སླད་དུའོ། ། \n",
        "id": "ff7f98f1-ad39-44b0-9989-3ca258834246"
    },
    {
        "segment_content": "དེ་སྐད་ཅེས་གསོལ་པ་དང༌། བཅོམ་ལྡན་འདས་ཀྱིས་ཚེ་དང་ལྡན་པ་རབ་འབྱོར་ལ་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ། ། \n",
        "id": "fa4ec585-0536-455f-b0b0-02db8ab5226a"
    },
    {
        "segment_content": "རབ་འབྱོར་ཇི་ཙམ་དུ་མཚན་ཕུན་སུམ་ཚོགས་པ་དེ་ཙམ་དུ་བརྫུན་ནོ། །\n",
        "id": "6dad1f6e-3133-47e8-8b5b-f26752a2bad4"
    },
    {
        "segment_content": "ཇི་ཙམ་དུ་མཚན་ཕུན་སུམ་ཚོགས་པ་མེད་པ་དེ་ཙམ་དུ་མི་བརྫུན་ཏེ། \n",
        "id": "063bc70b-d45f-4229-af5e-c151dcb123e3"
    },
    {
        "segment_content": "དེ་ལྟར་ན་དེ་བཞིན་གཤེགས་པ་ལ་མཚན་དང་མཚན་མ་མེད་པར་བལྟའོ། །\n",
        "id": "bf706134-967a-48e3-b415-8ba8049a7374"
    },
    {
        "segment_content": "དེ་སྐད་ཅེས་བཀའ་སྩལ་པ་དང༌། བཅོམ་ལྡན་འདས་ལ་ཚེ་དང་ལྡན་པ་རབ་འབྱོར་གྱིས་འདི་སྐད་ཅེས་གསོལ་ཏོ། །\n",
        "id": "d6ebe6b5-e750-4805-a651-e9d3ff66f4a2"
    },
    {
        "segment_content": "བཅོམ་ལྡན་འདས་མ་འོངས་པའི་དུས་ལྔ་བརྒྱའི་ཐ་མ་ལ། དམ་པའི་ཆོས་རབ་ཏུ་རྣམ་པར་འཇིག་པར་འགྱུར་བ་ན་སེམས་ཅན་གང་ལ་ལ་དག་འདི་ལྟ་བུའི་མདོ་སྡེའི་ཚིག་བཤད་པ་དག་ལ་ཡང་དག་པར་འདུ་ཤེས་བསྐྱེད་པར་འགྱུར་བ་འབྱུང་བ་ལྟ་མཆིས་ལགས་སམ།\n",
        "id": "5b3d16d2-f64e-42dd-bd4b-6b4b2e64cb42"
    },
    {
        "segment_content": "བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། རབ་འབྱོར་གང་ཁྱོད་འདི་སྐད་དུ་མ་འོངས་པའི་དུས་ལྔ་བརྒྱའི་ཐ་མ་ལ། དམ་པའི་ཆོས་རབ་ཏུ་རྣམ་པར་འཇིག་པར་འགྱུར་བ་ན། སེམས་ཅན་གང་ལ་ལ་དག་འདི་ལྟ་བུའི་མདོ་སྡེའི་ཚིག་བཤད་པ་དག་ལ་ཡང་དག་པར་འདུ་ཤེས་བསྐྱེད་པར་འགྱུར་བ་འབྱུང་བ་ལྟ་མཆིས་ལགས་སམ་ཞེས་ཁྱོད་དེ་སྐད་མ་ཟེར་ཅིག །\n",
        "id": "34c4d733-b38b-4352-871b-c76c49af067f"
    },
    {
        "segment_content": "རབ་འབྱོར་མ་འོངས་པའི་དུས་ལྔ་བརྒྱའི་ཐ་མ་ལ་དམ་པའི་ཆོས་རབ་ཏུ་རྣམ་པར་འཇིག་པར་འགྱུར་བ་ན། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཚུལ་ཁྲིམས་དང་ལྡན་པ། ཡོན་ཏན་དང་ལྡན་པ། ཤེས་རབ་དང་ལྡན་པ་དག་འབྱུང་སྟེ།\n",
        "id": "be8d3456-013e-4c25-8707-90492a0298d0"
    },
    {
        "segment_content": "རབ་འབྱོར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དེ་དག་ཀྱང་སངས་རྒྱས་གཅིག་ལ་བསྙེན་བཀུར་བྱས་པ་མ་ཡིན། \n",
        "id": "a2259326-cb51-4c36-bba6-ca1946f06dc8"
    },
    {
        "segment_content": "སངས་རྒྱས་གཅིག་ལ་དགེ་བའི་རྩ་བ་བསྐྱེད་པ་མ་ཡིན་གྱི།\n",
        "id": "42c2cad9-4f71-4697-9be9-d47ae530d7fa"
    },
    {
        "segment_content": "རབ་འབྱོར་སངས་རྒྱས་འབུམ་ཕྲག་དུ་མ་ལ་བསྙེན་བཀུར་བྱས་ཤིང་སངས་རྒྱས་འབུམ་ཕྲག་དུ་མ་ལ་དགེ་བའི་རྩ་བ་དག་བསྐྱེད་པའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དེ་དག་འབྱུང་ངོ་། །\n",
        "id": "6ca5c202-7365-43fb-af1e-97d3cc0b7e95"
    },
    {
        "segment_content": "རབ་འབྱོར་གང་དག་འདི་ལྟ་བུའི་མདོ་སྡེའི་བཤད་པ་དག་ལ་སེམས་དད་པ་གཅིག་ཙམ་རྙེད་པར་འགྱུར་བ་དེ་དག་ནི། དེ་བཞིན་གཤེགས་པས་མཁྱེན་ཏོ། །\n",
        "id": "ae686937-9380-423b-ba1d-a857d458617c"
    },
    {
        "segment_content": "རབ་འབྱོར་དེ་དག་ནི་དེ་བཞིན་གཤེགས་པས་གཟིགས་ཏེ། \n",
        "id": "24073080-3c01-44c2-9f21-d277a959bc20"
    },
    {
        "segment_content": "རབ་འབྱོར་སེམས་ཅན་དེ་དག་ཐམས་ཅད་ནི་བསོད་ནམས་ཀྱི་ཕུང་པོ་དཔག་ཏུ་མེད་པ་བསྐྱེད་ཅིང་ཡོངས་སུ་སྡུད་པར་འགྱུར་རོ། །\n",
        "id": "ac4f41a1-4eec-4a59-9628-ae88dd7c5d00"
    },
    {
        "segment_content": "དེ་ཅིའི་ཕྱིར་ཞེ་ན། རབ་འབྱོར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དེ་དག་ནི། བདག་ཏུ་འདུ་ཤེས་འཇུག་པར་མི་འགྱུར་ཞིང༌། \n",
        "id": "ec3697a9-ce60-42a9-931f-d04629953ce2"
    },
    {
        "segment_content": "སེམས་ཅན་དུ་འདུ་ཤེས་པ་མ་ཡིན། སྲོག་ཏུ་འདུ་ཤེས་པ་མ་ཡིན། གང་ཟག་ཏུ་འདུ་ཤེས་འཇུག་པར་མི་འགྱུར་བའི་ཕྱིར་རོ། །\n",
        "id": "60c1d572-fba4-4f28-8d72-9c6c8c55881c"
    },
    {
        "segment_content": "རབ་འབྱོར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དེ་དག་ཀྱང་ཆོས་སུ་འདུ་ཤེས་པ་དང༌། ཆོས་མེད་པར་ཡང་འདུ་ཤེས་མི་འཇུག་སྟེ། \n",
        "id": "bdeed269-4429-4203-99b2-225c9b7be8d0"
    },
    {
        "segment_content": "དེ་དག་ནི་འདུ་ཤེས་མེད་པར་ཡང་འཇུག་པར་མི་འགྱུར་རོ། །\n",
        "id": "b7a39b18-3598-4d96-8e7e-dc091d74b335"
    },
    {
        "segment_content": "དེ་ཅིའི་ཕྱིར་ཞེ་ན། རབ་འབྱོར་གལ་ཏེ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དེ་དག་ནི། ཆོས་སུ་འདུ་ཤེས་འཇུག་ན་ཡང་དེ་ཉིད་དེ་དག་གིས་བདག་ཏུ་འཛིན་པར་འགྱུར་ཞིང༌།\n",
        "id": "befae19d-0ab9-4e47-8c6a-20e7021a8e5e"
    },
    {
        "segment_content": "སེམས་ཅན་དུ་འཛིན་པ་དང༌། སྲོག་ཏུ་འཛིན་པ་དང༌། གང་ཟག་ཏུ་འཛིན་པར་འགྱུར་བའི་ཕྱིར་རོ། །\n",
        "id": "801c30fd-dace-42b2-abd0-d9675ef42d36"
    },
    {
        "segment_content": "གལ་ཏེ་ཆོས་བདག་མེད་པར་འདུ་ཤེས་འཇུག་ན་ཡང་དེ་ཉིད་དེ་དག་གིས་བདག་ཏུ་འཛིན་པར་འགྱུར་ཞིང༌།\n",
        "id": "f4f95c87-c4b1-4de5-95c4-f4d77d1343bc"
    },
    {
        "segment_content": "སེམས་ཅན་དུ་འཛིན་པ་དང༌། སྲོག་ཏུ་འཛིན་པ་དང༌། གང་ཟག་ཏུ་འཛིན་པར་འགྱུར་བའི་ཕྱིར་རོ། །\n",
        "id": "f5dc7f49-9962-4f19-a8ee-8c4b1287f599"
    },
    {
        "segment_content": "དེ་ཅིའི་ཕྱིར་ཞེ་ན། རབ་འབྱོར་བྱང་ཆུབ་སེམས་དཔས་ཆོས་ཀྱང་ལོག་པར་གཟུང་བར་མི་བྱ་སྟེ། ཆོས་མ་ཡིན་པ་ཡང་མི་གཟུང་བའི་ཕྱིར་རོ། །\n",
        "id": "453f221c-c047-4da7-b0c5-bd9111f0c4be"
    },
    {
        "segment_content": "དེ་བས་ན་དེ་ལས་དགོངས་ཏེ་དེ་བཞིན་གཤེགས་པས་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་གཟིངས་ལྟ་བུར་ཤེས་པ་རྣམས་ཀྱིས་ཆོས་རྣམས་ཀྱང་སྤང་བར་བྱ་ན། ཆོས་མ་ཡིན་པ་རྣམས་ལྟ་ཅི་སྨོས། ཞེས་གསུངས་སོ། །\n",
        "id": "e4a7c10d-f048-4291-99ca-927ce0fda146"
    },
    {
        "segment_content": "གཞན་ཡང་བཅོམ་ལྡན་འདས་ཀྱིས་ཚེ་དང་ལྡན་པ་རབ་འབྱོར་ལ་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ། །\n",
        "id": "66cd373c-8216-4c17-a409-39683927b742"
    },
    {
        "segment_content": "རབ་འབྱོར་འདི་ཇི་སྙམ་དུ་སེམས། \n",
        "id": "0ba2534b-5a47-45d8-af8f-c7d71390daf9"
    },
    {
        "segment_content": "དེ་བཞིན་གཤེགས་པའི་གང་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་པའི་ཆོས་དེ་གང་ཡང་ཡོད་སྙམ་མམ། \n",
        "id": "8098bdf1-a1e8-422c-9de7-fbd14134cd31"
    },
    {
        "segment_content": "དེ་བཞིན་གཤེགས་པས་ཆོས་དེ་གང་ཡང་བསྟན་སྙམ་མམ། \n",
        "id": "70aeb126-2404-4f7d-b1c6-f6ddbf3bb3a5"
    },
    {
        "segment_content": "དེ་སྐད་ཅེས་བཀའ་སྩལ་པ་དང༌། བཅོམ་ལྡན་འདས་ལ་ཚེ་དང་ལྡན་པ་རབ་འབྱོར་གྱིས་འདི་སྐད་ཅེས་གསོལ་ཏོ། །\n",
        "id": "e1539dea-1c44-43be-94dc-5a1e09d66805"
    },
    {
        "segment_content": "བཅོམ་ལྡན་འདས་བདག་གིས་བཅོམ་ལྡན་འདས་ཀྱིས་གསུངས་པའི་དོན་འཚལ་བ་ལྟར་ན། དེ་བཞིན་གཤེགས་པས་གང་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་པའི་ཆོས་དེ་གང་ཡང་མ་མཆིས་ལགས་སོ། །\n",
        "id": "3d93c843-cb69-493e-b526-499021f00aa3"
    },
    {
        "segment_content": "དེ་བཞིན་གཤེགས་པས་བསྟན་པའི་ཆོས་དེ་གང་ཡང་མ་མཆིས་ལགས་སོ། །\n",
        "id": "8a902f68-a5ab-49e2-ae75-a1427e9ea54e"
    },
    {
        "segment_content": "དེ་ཅིའི་སླད་དུ་ཞེ་ན། དེ་བཞིན་གཤེགས་པས་ཆོས་དེ་གང་ཡང་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་པའམ། བསྟན་པ་དེ་ནི་གཟུང་དུ་མ་མཆིས་བརྗོད་དུ་མ་མཆིས་ཏེ། \n",
        "id": "c23c474e-7bd9-4641-bdad-980f8ca04c91"
    },
    {
        "segment_content": "དེ་ནི་ཆོས་ཀྱང་མ་ལགས་ཆོས་མ་མཆིས་པ་ཡང་མ་ལགས་པའི་སླད་དུའོ། །\n",
        "id": "40be2ca1-63b6-4e28-8c88-8a86556eed40"
    },
    {
        "segment_content": "དེ་ཅིའི་སླད་དུ་ཞེ་ན། འཕགས་པའི་གང་ཟག་རྣམས་ནི་འདུས་མ་བྱས་ཀྱིས་རབ་ཏུ་བྱེ་བའི་སླད་དུའོ། །\n",
        "id": "03c08ddb-6ea3-4708-b605-8490b8da07a4"
    },
    {
        "segment_content": "བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། རབ་འབྱོར་འདི་ཇི་སྙམ་དུ་སེམས། \n",
        "id": "64025b49-f4c7-4c81-98bb-cde82f07f110"
    },
    {
        "segment_content": "རིགས་ཀྱི་བུའམ་རིགས་ཀྱི་བུ་མོ་གང་ལ་ལ་ཞིག་གིས་སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་འདི་རིན་པོ་ཆེ་སྣ་བདུན་གྱིས་རབ་ཏུ་གང་བར་བྱས་ཏེ་སྦྱིན་པ་བྱིན་ན། རིགས་ཀྱི་བུའམ་རིགས་ཀྱི་བུ་མོ་དེ་གཞི་དེ་ལས་བསོད་ནམས་ཀྱི་ཕུང་པོ་མང་དུ་བསྐྱེད་སྙམ་མམ།\n",
        "id": "d2bf7849-0ef0-4d44-a327-6a600d048d23"
    },
    {
        "segment_content": "རབ་འབྱོར་གྱིས་གསོལ་པ། བཅོམ་ལྡན་འདས་མང་ལགས་སོ། །\n",
        "id": "b48b1f8e-51af-4b58-9f9e-01949a625776"
    },
    {
        "segment_content": "བདེ་བར་གཤེགས་པ་མང་ལགས་སོ། །\n",
        "id": "9d9a1686-33b4-415c-86c1-29f2fde815aa"
    },
    {
        "segment_content": "རིགས་ཀྱི་བུའམ་རིགས་ཀྱི་བུ་མོ་དེ་དེའི་གཞི་དེ་ལས་བསོད་ནམས་ཀྱི་ཕུང་པོ་མང་དུ་བསྐྱེད་དོ། །\n",
        "id": "97ad1369-70e1-41c7-9926-d2241a78429a"
    },
    {
        "segment_content": "དེ་ཅིའི་སླད་དུ་ཞེ་ན། བསོད་ནམས་ཀྱི་ཕུང་པོ་དེ་ཉིད་ཕུང་པོ་མ་མཆིས་པའི་སླད་དུ་སྟེ། \n",
        "id": "7555fa5c-b101-41f1-9108-942a5e9d0ea9"
    },
    {
        "segment_content": "དེ་བས་ན་དེ་བཞིན་གཤེགས་པས་བསོད་ནམས་ཀྱི་ཕུང་པོ་བསོད་ནམས་ཀྱི་ཕུང་པོ་ཞེས་གསུངས་སོ། །\n",
        "id": "31595f02-c5b4-42ba-9e53-0df338cb1a19"
    },
    {
        "segment_content": "བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། རབ་འབྱོར་རིགས་ཀྱི་བུའམ་རིགས་ཀྱི་བུ་མོ་གང་གིས་སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་འདི་རིན་པོ་ཆེ་སྣ་བདུན་གྱིས་རབ་ཏུ་གང་བར་བྱས་ཏེ་སྦྱིན་པ་བྱིན་པ་བས། གང་གིས་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་ལས་ཐ་ན་ཚིག་བཞི་པའི་ཚིགས་སུ་བཅད་པ་ཙམ་བཟུང་ནས་གཞན་དག་ལ་འཆད་ཅིང་ཡང་དག་པར་རབ་ཏུ་སྟོན་ན། གཞི་དེ་ལས་བསོད་ནམས་ཀྱི་ཕུང་པོ་ཆེས་མང་དུ་གྲངས་མེད་དཔག་ཏུ་མེད་པ་བསྐྱེད་དོ། །\n",
        "id": "c6c75835-61d4-4360-9af7-fdcc6f4b5478"
    },
    {
        "segment_content": "དེ་ཅིའི་ཕྱིར་ཞེ་ན། རབ་འབྱོར་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རྣམས་ཀྱི་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ནི་འདི་ལས་བྱུང་སྟེ། \n",
        "id": "002a6b55-eb0d-4ab8-8fee-40c3485283d3"
    },
    {
        "segment_content": "སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ཀྱང་འདི་ལས་སྐྱེས་པའི་ཕྱིར་རོ། །\n",
        "id": "d743b12e-d306-435a-8fcf-5b342c417620"
    },
    {
        "segment_content": "དེ་ཅིའི་ཕྱིར་ཞེ་ན། རབ་འབྱོར་སངས་རྒྱས་ཀྱི་ཆོས་རྣམས་སངས་རྒྱས་ཀྱི་ཆོས་རྣམས་ཞེས་བྱ་བ་ནི། སངས་རྒྱས་ཀྱི་ཆོས་དེ་དག་མེད་པར་དེ་བཞིན་གཤེགས་པའི་གསུངས་པའི་ཕྱིར་ཏེ། \n",
        "id": "45622e35-f80b-499e-aac3-2fea7d87f3a9"
    },
    {
        "segment_content": "དེས་ན་སངས་རྒྱས་ཀྱི་ཆོས་རྣམས་ཞེས་བྱའོ། །\n",
        "id": "0b52da15-07b1-49fc-aeb1-1e8e2bccd166"
    },
    {
        "segment_content": "རབ་འབྱོར་འདི་ཇི་སྙམ་དུ་སེམས། \n",
        "id": "fadeaa64-f531-48fc-b83b-14da3847658e"
    },
    {
        "segment_content": "རྒྱུན་དུ་ཞུགས་པ་འདི་སྙམ་དུ་བདག་གིས་རྒྱུན་དུ་ཞུགས་པའི་འབྲས་བུ་ཐོབ་བོ་སྙམ་དུ་སེམས་སྙམ་མམ། \n",
        "id": "8dcdcde3-b61c-466b-b936-175ece6ff44d"
    },
    {
        "segment_content": "རབ་འབྱོར་གྱིས་གསོལ་པ། བཅོམ་ལྡན་འདས་དེ་ནི་མ་ལགས་སོ། །\n",
        "id": "2e7e3c2f-c68b-44d8-be14-4fe369d5266a"
    },
    {
        "segment_content": "དེ་ཅིའི་སླད་དུ་ཞེ་ན། བཅོམ་ལྡན་འདས་དེ་ནི་ཅི་ལ་ཡང་ཞུགས་པ་མ་མཆིས་པའི་སླད་དུ་སྟེ། \n",
        "id": "7bf704c4-03a6-4090-a65d-c0f1334e1f71"
    },
    {
        "segment_content": "དེས་ན་རྒྱུན་དུ་ཞུགས་པ་ཞེས་བགྱིའོ། །\n",
        "id": "5daba3bc-fea7-4229-aef8-b5c6ceca94c1"
    },
    {
        "segment_content": "གཟུགས་ལ་ཡང་མ་ཞུགས། སྒྲ་ལ་ཡང་མ་ལགས། དྲི་ལ་ཡང་མ་ལགས། རོ་ལ་ཡང་མ་ལགས། རེག་བྱ་ལ་ཡང་མ་ལགས། ཆོས་རྣམས་ལ་ཡང་མ་ཞུགས་ཏེ།\n",
        "id": "7d474ece-5bf3-4b7a-9580-7192593efce4"
    },
    {
        "segment_content": "དེས་ན་རྒྱུན་དུ་ཞུགས་པ་ཞེས་བགྱིའོ། །\n",
        "id": "6cfc1798-64d8-44ed-89eb-75c8446f56f3"
    },
    {
        "segment_content": "དེ་ཅིའི་སླད་དུ་ཞེ་ན། བཅོམ་ལྡན་འདས་གལ་ཏེ་རྒྱུན་དུ་ཞུགས་པ་འདི་སྙམ་དུ་བདག་གིས་རྒྱུན་དུ་ཞུགས་པའི་འབྲས་བུ་ཐོབ་བོ་སྙམ་དུ་སེམས་པར་གྱུར་ན། དེ་ཉིད་དེའི་བདག་ཏུ་འཛིན་པར་འགྱུར་ལགས་སོ། །\n",
        "id": "c1b8f7c7-0ead-4ba2-b416-9f5558d9f158"
    },
    {
        "segment_content": "སེམས་ཅན་དུ་འཛིན་པ་དང༌། སྲོག་ཏུ་འཛིན་པ་དང༌། གང་ཟག་ཏུ་འཛིན་པར་འགྱུར་ལགས་སོ། །\n",
        "id": "0d02d3b9-0621-4367-b5f9-7ed8a310decc"
    },
    {
        "segment_content": "བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། རབ་འབྱོར་འདི་ཇི་སྙམ་དུ་སེམས། \n",
        "id": "de740f3a-1353-4ac8-9219-8a594051875b"
    },
    {
        "segment_content": "ལན་ཅིག་ཕྱིར་འོང་བ་འདི་སྙམ་དུ་བདག་གིས་ལན་ཅིག་ཕྱིར་འོང་བའི་འབྲས་བུ་ཐོབ་བོ་སྙམ་དུ་སེམས་སྙམ།\n",
        "id": "d39e1d42-1628-42d2-a6f2-2323375684d0"
    },
    {
        "segment_content": "རབ་འབྱོར་གྱིས་གསོལ་པ། བཅོམ་ལྡན་འདས་དེ་ནི་མ་ལགས་སོ། །\n",
        "id": "3ab29d3d-aecb-4e94-985b-48b8004cc58c"
    },
    {
        "segment_content": "དེ་ཅིའི་ཕྱིར་ཞེ་ན། གང་ལན་ཅིག་ཕྱིར་འོང་བ་ཉིད་དུ་ཞུགས་པའི་ཆོས་དེ་གང་ཡང་མ་མཆིས་པའི་སླད་དུ་སྟེ། \n",
        "id": "7e8a0b4b-477a-41ce-9061-e35604b19543"
    },
    {
        "segment_content": "དེས་ན་ལན་ཅིག་ཕྱིར་འོང་བ་ཞེས་བགྱིའོ། །\n",
        "id": "54572112-93d2-4063-a715-f95eaad20e10"
    },
    {
        "segment_content": "བཅོམ་ལྡན་འདས་གལ་ཏེ་ལན་ཅིག་ཕྱིར་འོང་བ་འདི་སྙམ་དུ་བདག་གིས་ལན་ཅིག་ཕྱིར་འོང་བའི་འབྲས་བུ་ཐོབ་བོ་སྙམ་དུ་སེམས་པར་གྱུར་ན། དེ་ཉིད་དེའི་བདག་ཏུ་འཛིན་པར་འགྱུར་ལགས་སོ། །\n",
        "id": "6ae1b470-b0b5-4d69-a00d-e4b7833a98e8"
    },
    {
        "segment_content": "སེམས་ཅན་དུ་འཛིན་པ་དང༌སྲོག་ཏུ་འཛིན་པ་དང༌། གང་ཟག་ཏུ་འཛིན་པར་འགྱུར་ལགས་སོ། །\n",
        "id": "a3bc918d-ba8b-414a-935c-7a4ba85942cf"
    },
    {
        "segment_content": "བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། རབ་འབྱོར་འདི་ཇི་སྙམ་དུ་སེམས་\n",
        "id": "e62345f0-239e-470e-9b9c-8d650e49339c"
    },
    {
        "segment_content": "ཕྱིར་མི་འོང་བ་འདི་སྙམ་དུ་བདག་གིས་ཕྱིར་མི་འོང་བའི་འབྲས་བུ་ཐོབ་བོ་སྙམ་དུ་སེམས་སྙམ་མམ། \n",
        "id": "e45648a4-35e2-4047-beda-17db2ab9169f"
    },
    {
        "segment_content": "རབ་འབྱོར་གྱིས་གསོལ་པ། བཅོམ་ལྡན་འདས་དེ་ནི་མ་ལགས་སོ། །\n",
        "id": "29ebdd34-bd3a-46de-8418-0711c41e6fd4"
    },
    {
        "segment_content": "དེ་ཅིའི་སླད་དུ་ཞེ་ན། གང་ཕྱིར་མི་འོང་བ་ཉིད་དུ་ཞུགས་པའི་ཆོས་དེ་གང་ཡང་མ་མཆིས་པའི་སླད་དུ་སྟེ། \n",
        "id": "f1b169a1-abb5-49f6-b5ef-7b34e44d1c68"
    },
    {
        "segment_content": "དེའི་ཕྱིར་ཕྱིར་མི་འོང་བ་ཞེས་བགྱིའོ། །\n",
        "id": "50f8ac50-719e-4938-8470-3719270c01a8"
    },
    {
        "segment_content": "བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ་རབ་འབྱོར་འདི་ཇི་སྙམ་དུ་སེམས། \n",
        "id": "c4faedb9-5cec-4087-a3db-df6e6e610c33"
    },
    {
        "segment_content": "དགྲ་བཅོམ་པ་འདི་སྙམ་དུ་བདག་གིས་དགྲ་བཅོམ་པ་ཉིད་ཐོབ་བོ་སྙམ་དུ་སེམས་སྙམ་མམ། \n",
        "id": "fedf3cc5-e7bd-4475-9ed4-433a48ed7c05"
    },
    {
        "segment_content": "རབ་འབྱོར་གྱིས་གསོལ་པ། བཅོམ་ལྡན་འདས་དེ་ནི་མ་ལགས་སོ། །\n",
        "id": "69b602b1-03ef-4522-8db3-a33d9f5e5cea"
    },
    {
        "segment_content": "དེ་ཅིའི་སླད་དུ་ཞེ་ན། གང་དག་དགྲ་བཅོམ་པ་ཞེས་བགྱི་བའི་ཆོས་དེ་གང་ཡང་མ་མཆིས་པའི་སླད་དུའོ། །\n",
        "id": "f05a5a4c-5508-4052-a280-19f38193c0e7"
    },
    {
        "segment_content": "བཅོམ་ལྡན་འདས་གལ་ཏེ་དགྲ་བཅོམ་པ་འདི་སྙམ་དུ་བདག་གིས་དགྲ་བཅོམ་པ་ཉིད་ཐོབ་བོ་སྙམ་དུ་སེམས་པར་གྱུར་ན། དེ་ཉིད་དེའི་བདག་ཏུ་འཛིན་པར་འགྱུར་ལགས་སོ། །\n",
        "id": "ffd213c0-3d08-4966-828c-31673f3fd689"
    },
    {
        "segment_content": "སེམས་ཅན་དུ་འཛིན་པ་དང༌། སྲོག་ཏུ་འཛིན་པ་དང༌། གང་ཟག་ཏུ་འཛིན་པར་འགྱུར་ལགས་སོ། །\n",
        "id": "6cbde108-5e58-4c0e-91ff-4c82cb4d6e3a"
    },
    {
        "segment_content": "བཅོམ་ལྡན་འདས་བདག་ནི་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཀྱིས་ཉོན་མོངས་པ་མེད་པར་གནས་པ་རྣམས་ཀྱི་མཆོག་ཏུ་བསྟན་ཏེ།\n",
        "id": "f6925d82-afb5-43ed-ac0f-02ecefe832da"
    },
    {
        "segment_content": "བཅོམ་ལྡན་འདས་བདག་འདོད་ཆགས་དང་བྲལ་བ་དགྲ་བཅོམ་པ་ལགས་ཀྱང༌། བཅོམ་ལྡན་འདས་བདག་འདི་སྙམ་དུ་བདག་ནི་དགྲ་བཅོམ་པའོ་སྙམ་དུ་མི་སེམས་ལགས་སོ། །\n",
        "id": "765cb54d-e488-4d2b-9ea7-4ad4745ff2ff"
    },
    {
        "segment_content": "བཅོམ་ལྡན་འདས་གལ་ཏེ་འདི་སྙམ་དུ་བདག་གིས་དགྲ་བཅོམ་པ་ཉིད་ཐོབ་བོ་སྙམ་དུ་སེམས་པར་གྱུར་ན། དེ་བཞིན་གཤེགས་པས་བདག་ལ་རིགས་ཀྱི་བུ་རབ་འབྱོར་ནི་ཉོན་མོངས་པ་མེད་པར་གནས་པ་རྣམས་ཀྱི་མཆོག་ཡིན་ཏེ། \n",
        "id": "87ecb663-712b-4e87-9281-ac8127ee1ece"
    },
    {
        "segment_content": "ཅི་ལ་ཡང་མི་གནས་པས་ན་ཉོན་མོངས་པ་མེད་པར་གནས་པ་ཞེས་ལུང་མི་སྟོན་ལགས་སོ། །\n",
        "id": "710f65c2-20b2-46a8-9224-b8a373e77934"
    },
    {
        "segment_content": "བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། རབ་འབྱོར་འདི་ཇི་སྙམ་དུ་སེམས། \n",
        "id": "ddc4b7cf-09e7-4ece-8e50-936199e3bdf1"
    },
    {
        "segment_content": "དེ་བཞིན་གཤེགས་པས་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་མར་མེ་མཛད་ལས་གང་བླངས་པའི་ཆོས་དེ་གང་ཡང་ཡོད་སྙམ་མམ།\n",
        "id": "85191a39-1646-4864-8990-e97c05cdc57c"
    },
    {
        "segment_content": "རབ་འབྱོར་གྱིས་གསོལ་པ། བཅོམ་ལྡན་འདས་དེ་ནི་མ་ལགས་སོ། །\n",
        "id": "3b4784a3-1288-4e04-9cc4-281e844f7e22"
    },
    {
        "segment_content": "དེ་བཞིན་གཤེགས་པས་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་མར་མེ་མཛད་ལས་གང་བླངས་པའི་ཆོས་དེ་གང་ཡང་ཡོང་ཡེ་མ་མཆིས་ལགས་སོ། །\n",
        "id": "0474ec82-bf6a-4dd6-9a0d-e65a4659d98f"
    },
    {
        "segment_content": "བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། རབ་འབྱོར་བྱང་ཆུབ་སེམས་དཔའ་གང་ལ་ལ་ཞིག་འདི་སྐད་དུ་བདག་གིས་ཞིང་བཀོད་པ་རྣམས་སྒྲུབ་བོ་ཞེས་ཟེར་ན་དེ་ནི་མི་བདེན་པར་སྨྲའོ། །\n",
        "id": "7e8ee7f8-2566-42fd-a7fa-5f3f77176ed2"
    },
    {
        "segment_content": "དེ་ཅིའི་ཕྱིར་ཞེ་ན། རབ་འབྱོར་ཞིང་བཀོད་པ་རྣམས་ཞིང་བཀོད་པ་རྣམས་ཞེས་བྱ་བ་ནི། བཀོད་པ་དེ་དག་མེད་པར་དེ་བཞིན་གཤེགས་པར་གསུངས་པའི་ཕྱིར་ཏེ། \n",
        "id": "7d928437-6b7a-4bb0-a796-774fdc1d3ff9"
    },
    {
        "segment_content": "དེས་ན་ཞིང་བཀོད་པ་རྣམས་ཞེས་བྱའོ། །\n",
        "id": "3dba7ce8-3f28-49f2-a703-203e914523bc"
    },
    {
        "segment_content": "རབ་འབྱོར་དེ་ལྟ་བས་ན། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་འདི་ལྟར་མི་གནས་པར་སེམས་པ་བསྐྱེད་པར་བྱ་སྟེ། \n",
        "id": "be0fe447-1ffd-4d5c-9790-60d6ee9fb5e8"
    },
    {
        "segment_content": "ཅི་ལ་ཡང་མི་གནས་པར་སེམས་བསྐྱེད་པར་བྱའོ། །\n",
        "id": "6b9027bb-b54e-4e6b-bb17-0d991ef8c27e"
    },
    {
        "segment_content": "གཟུགས་ལ་ཡང་མི་གནས་པར་སེམས་བསྐྱེད་པར་བྱའོ། །\n",
        "id": "423eb981-93e5-4c9c-bdf0-4159aea2fc0f"
    },
    {
        "segment_content": "སྒྲ་དང་དྲི་དང་རོ་དང་རེག་བྱ་དང་ཆོས་ལ་ཡང་མི་གནས་པར་སེམས་བསྐྱེད་པར་བྱའོ། །\n",
        "id": "d78d5150-ab8a-4dc6-a617-b6d6f10a4c7b"
    },
    {
        "segment_content": "རབ་འབྱོར་འདི་ལྟ་སྟེ་དཔེར་ན། སྐྱེས་བུ་ཞིག་ལུས་འདི་ལྟ་བུར་གྱུར་ཏེ། འདི་ལྟ་སྟེ་རིའི་རྒྱལ་པོ་རི་རབ་ཙམ་དུ་གྱུར་ན། རབ་འབྱོར་འདི་ཇི་སྙམ་དུ་སེམས། ལུས་དེ་ཆེ་བ་ཡིན་སྙམ་མམ། \n",
        "id": "e356456f-4e64-4b84-892e-3ad8b4763da8"
    },
    {
        "segment_content": "རབ་འབྱོར་གྱིས་གསོལ་པ། བཅོམ་ལྡན་འདས་ལུས་དེ་ཆེ་བ་ལགས་སོ། །\n",
        "id": "38c6c9ed-deef-42e2-8459-cd3fbeb2432f"
    },
    {
        "segment_content": "བདེ་བར་གཤེགས་པ་ལུས་དེ་ཆེ་བ་ལགས་སོ། །\n",
        "id": "213c3841-6d67-49a7-bf0a-f7b5527122ce"
    },
    {
        "segment_content": "དེ་ཅིའི་སླད་དུ་ཞེ་ན། དེ་བཞིན་གཤེགས་པས་དེ་དངོས་པོ་མ་མཆིས་པར་གསུངས་པའི་སླད་དུ་སྟེ། \n",
        "id": "6acee520-f898-4e87-8d41-be752d5b2679"
    },
    {
        "segment_content": "དེས་ན་ལུས་དེ་ཆེ་བ་ཞེས་བགྱིའོ། །\n",
        "id": "cc288201-30f2-4db6-bfb8-64a89bffcf8c"
    },
    {
        "segment_content": "དེ་དངོས་པོ་མ་མཆིས་པས་དེས་ན་ལུས་ཞེས་བྱའོ། །\n",
        "id": "0d646879-b22b-4ced-ac60-f5309825f46a"
    },
    {
        "segment_content": "བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། རབ་འབྱོར་འདི་ཇི་སྙམ་དུ་སེམས། \n",
        "id": "adc2c216-c927-451c-a93f-1e4bd823437a"
    },
    {
        "segment_content": "གང་གཱའི་ཀླུང་གི་བྱེ་མ་ཇི་སྙེད་པ་གང་གཱའི་ཀླུང་ཡང་དེ་སྙེད་ཁོ་ནར་གྱུར་ན་དེ་དག་གི་བྱེ་མ་གང་ཡིན་པ་དེ་དག་མང་བ་ཡིན་སྙམ་མམ། \n",
        "id": "78c344f3-fa51-497f-8919-dbb91e29b398"
    },
    {
        "segment_content": "རབ་འབྱོར་གྱིས་གསོལ་པ། བཅོམ་ལྡན་འདས་གང་གཱའི་ཀླུང་དེ་དག་ཉིད་ཀྱང་མང་ལགས་ན། དེ་དག་གིས་བྱེ་མ་ལྟ་སྨོས་ཀྱང་ཅི་འཚལ། \n",
        "id": "ae3a8d09-31ce-45c5-92d2-b5aa2200785e"
    },
    {
        "segment_content": "བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། རབ་འབྱོར་ཁྱོད་མོས་པར་བྱའོ། །\n",
        "id": "f0db7151-04ea-4e4e-947f-589e7fd819d6"
    },
    {
        "segment_content": "ཁྱོད་ཀྱིས་ཁོང་དུ་ཆུད་པར་བྱའོ། །\n",
        "id": "f3d1eadc-c1e5-4bc0-a44d-4a599c5044f2"
    },
    {
        "segment_content": "གང་གཱའི་ཀླུང་དེ་དག་གི་བྱེ་མ་ཇི་སྙེད་པ་དེ་སྙེད་ཀྱི་འཇིག་རྟེན་གྱི་ཁམས་ན་སྐྱེས་པའམ། བུད་མེད་ལ་ལ་ཞིག་གིས་རིན་པོ་ཆེ་སྣ་བདུན་གྱིས་རབ་ཏུ་གང་བར་བྱས་ཏེ། \n",
        "id": "1d6d359b-9c0c-4dde-a4f4-a1c0864d6f9f"
    },
    {
        "segment_content": "དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རྣམས་ལ་སྦྱིན་པ་བྱིན་ན། རབ་འབྱོར་འདི་ཇི་སྙམ་དུ་སེམས། སྐྱེས་པའམ་བུད་མེད་དེ་གཞི་དེ་ལས་བསོད་ནམས་མང་དུ་བསྐྱེད་སྙམ་མམ། \n",
        "id": "762241d8-6316-4ace-a92f-ccdda34e4beb"
    },
    {
        "segment_content": "རབ་འབྱོར་གྱིས་གསོལ་པ། བཅོམ་ལྡན་འདས་མང་ལགས་སོ། །\n",
        "id": "6843bcb7-0fa4-4b70-ab69-ac756e734407"
    },
    {
        "segment_content": "བདེ་བར་གཤེགས་པ་མང་ལགས་སོ། །\n",
        "id": "4619c48a-5e38-4b3f-98aa-448c2c09b4d7"
    },
    {
        "segment_content": "སྐྱེས་པའམ་བུད་མེད་དེ་གཞི་དེ་ལས་བསོད་ནམས་མང་དུ་བསྐྱེད་པ་ལགས་སོ། །\n",
        "id": "8d3df2cd-9718-4f1e-b1e6-1fd5ced96394"
    },
    {
        "segment_content": "བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། རབ་འབྱོར་གང་གིས་འཇིག་རྟེན་གྱིས་ཁམས་དེ་སྙེད་རིན་པོ་ཆེ་སྣ་བདུན་གྱིས་རབ་ཏུ་གང་བར་བྱས་ཏེ། \n",
        "id": "93795b9b-e742-41ed-85fe-005f949b0598"
    },
    {
        "segment_content": "དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རྣམས་ལ་སྦྱིན་པ་བྱིན་པ་བས། གང་གིས་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་ལས་ཐ་ན་ཚིག་བཞི་པའི་ཚིགས་སུ་བཅད་པ་ཙམ་བཟུང་ནས། གཞན་དག་ལ་ཡང་དག་པར་རབ་ཏུ་བཤད་དེ་ཡང་དག་པར་རབ་ཏུ་བསྟན་ན། དེ་ཉིད་གཞི་དེ་ལས་བསོད་ནམས་ཆེས་མང་དུ་གྲངས་མེད་དཔག་ཏུ་མེད་པ་བསྐྱེད་དོ། །\n",
        "id": "ef60064a-6610-43d5-bd47-e3067e6e239a"
    },
    {
        "segment_content": "ཡང་རབ་འབྱོར་ས་ཕྱོགས་གང་ན་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་ལས་ཐ་ན་ཚིག་བཞི་པའི་ཚིགས་སུ་བཅད་པ་ཙམ་འདོན་ཏམ་སྟོན་པའི་ས་ཕྱོགས་དེ་ནི་ལྷ་དང་མི་དང་ལྷ་མ་ཡིན་དུ་བཅས་པའི་འཇིག་རྟེན་གྱི་མཆོད་རྟེན་དུ་གྱུར་པ་ཡིན་ན་སུ་ཞིག་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་ལེན་པ་དང༌། འབྲི་བ་དང༌། འཛིན་པ་དང་། འཆང་བ་དང༌། ཀློག་པ་དང༌། ཀུན་ཆུབ་པར་བྱེད་པ་དང༌། ཚུལ་བཞིན་དུ་ཡིད་ལ་བྱེད་པ་དེ་ངོ་མཚར་རབ་དང་ལྡན་པར་གྱུར་པ་ལྟ་ཅི་སྨོས་ཏེ་\n",
        "id": "3a00eff1-55e0-4f1b-8cc8-6db906fdc33e"
    },
    {
        "segment_content": "ས་ཕྱོགས་དེ་ན་སྟོན་པའམ། བླ་མ་ལྟ་བུ་གང་ཡང་རུང་བར་གནས་སོ། །\n",
        "id": "ab00c096-5dd8-4682-b3df-a330aa02c9f9"
    },
    {
        "segment_content": "དེ་སྐད་ཅེས་བཀའ་སྩལ་པ་དང༌། བཅོམ་ལྡན་འདས་ལ་ཚེ་དང་ལྡན་པ་རབ་འབྱོར་གྱིས་འདི་སྐད་ཅེས་གསོལ་ཏོ། །\n",
        "id": "fc10a0d5-bf15-4620-af3c-992e14ec16d7"
    },
    {
        "segment_content": "བཅོམ་ལྡན་འདས་ཆོས་ཀྱི་རྣམ་གྲངས་འདིའི་མིང་ཅི་ལགས། \n",
        "id": "892618b9-d018-4838-8996-e6547d728b71"
    },
    {
        "segment_content": "འདི་ཇི་ལྟར་གཟུང་བར་བགྱི། \n",
        "id": "330a99f9-9c1d-4488-b44f-cbe162296888"
    },
    {
        "segment_content": "དེ་སྐད་ཅེས་གསོལ་པ་དང༌། བཅོམ་ལྡན་འདས་ཀྱིས་ཚེ་དང་ལྡན་པ་རབ་འབྱོར་ལ་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ། །\n",
        "id": "32951194-9774-4157-9b9b-4dd97337e6b7"
    },
    {
        "segment_content": "རབ་འབྱོར་ཆོས་ཀྱི་རྣམ་གྲངས་འདིའི་མིང་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཞེས་བྱ་སྟེ་\n",
        "id": "0a82b36d-02cf-4aca-b20f-d41b3f7df14c"
    },
    {
        "segment_content": "འདི་དེ་ལྟར་ཟུངས་ཤིག །\n",
        "id": "428fd98a-7dfa-42d7-b6c5-e4211eb39786"
    },
    {
        "segment_content": "དེ་ཅིའི་ཕྱིར་ཞེ་ན། རབ་འབྱོར་དེ་བཞིན་གཤེགས་པས་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་གང་གསུངས་པ་དེ་ཉིད་ཕ་རོལ་ཏུ་ཕྱིན་པ་མེད་པའི་ཕྱིར་ཏེ། \n",
        "id": "89fc0df4-248e-400a-925e-cf15184b6a2c"
    },
    {
        "segment_content": "དེས་ན་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཞེས་བྱའོ། །\n",
        "id": "04096dbd-f947-429a-b7f0-865c413d5e86"
    },
    {
        "segment_content": "རབ་འབྱོར་འདི་ཇི་སྙམ་དུ་སེམས། \n",
        "id": "28ae73ee-9ff6-42b7-a7cd-a9973ed848c6"
    },
    {
        "segment_content": "དེ་བཞིན་གཤེགས་པས་གསུངས་པའི་ཆོས་དེ་གང་ཡང་ཡོད་སྙམ་མམ། \n",
        "id": "4a825a7d-a1c7-4bfd-b7d6-e8fedc768648"
    },
    {
        "segment_content": "རབ་འབྱོར་གྱིས་གསོལ་པ། བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པས་གང་གསུངས་པའི་ཆོས་དེ་གང་ཡང་མ་མཆིས་ལགས་སོ། །\n",
        "id": "cd529767-9ee4-4cf2-ba1e-707e44d96649"
    },
    {
        "segment_content": "བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། རབ་འབྱོར་འདི་ཇི་སྙམ་དུ་སེམས། \n",
        "id": "fe6d712d-91c8-4090-95d4-d444975542ba"
    },
    {
        "segment_content": "སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་ན་སའི་རྡུལ་ཇི་སྙེད་ཡོད་པ་དེ་མང་བ་ཡིན་སྙམ་མམ།\n",
        "id": "3de13ab0-407d-42e3-865f-5c2549df3e07"
    },
    {
        "segment_content": "རབ་འབྱོར་གྱིས་གསོལ་པ། བཅོམ་ལྡན་འདས་སའི་རྡུལ་དེ་མང་ལགས་སོ། །\n",
        "id": "f30556e3-f4b1-408d-af9a-3454e3e8869f"
    },
    {
        "segment_content": "བདེ་བར་གཤེགས་པ་མང་ལགས་སོ། །\n",
        "id": "87586a0b-5293-498d-83b6-58ae89d7d7c6"
    },
    {
        "segment_content": "དེ་ཅིའི་སླད་དུ་ཞེ་ན། བཅོམ་ལྡན་འདས་སའི་རྡུལ་གང་ལགས་པ་དེ་རྡུལ་མ་མཆིས་པར་དེ་བཞིན་གཤེགས་པས་གསུངས་པའི་སླད་དུ་སྟེ། \n",
        "id": "536c688d-c2fa-4c1a-94d9-f0633dfa0ac7"
    },
    {
        "segment_content": "དེས་ན་སའི་རྡུལ་ཞེས་བགྱིའོ། །\n",
        "id": "10945c1e-3d6e-425a-9559-2d4149a058b5"
    },
    {
        "segment_content": "འཇིག་རྟེན་གྱི་ཁམས་གང་ལགས་པ་དེ་དག་ཁམས་མ་མཆིས་པར་དེ་བཞིན་གཤེགས་པས་གསུངས་པའི་སླད་དུ་སྟེ། \n",
        "id": "e6f66b1e-0070-4f4a-8807-9e7024c8593d"
    },
    {
        "segment_content": "དེས་ན་འཇིག་རྟེན་གྱི་ཁམས་ཞེས་བགྱིའོ། །\n",
        "id": "e58d916e-6a31-4fcf-a8f1-b2379a14c732"
    },
    {
        "segment_content": "བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། རབ་འབྱོར་འདི་ཇི་སྙམ་དུ་སེམས།\n",
        "id": "9c44b9f7-665c-4288-a043-1f0b97f7f200"
    },
    {
        "segment_content": "སྐྱེས་བུ་ཆེན་པོའི་མཚན་སུམ་ཅུ་རྩ་གཉིས་པོ་དེ་དག་གིས་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་སུ་བལྟ་བར་བྱ་སྙམ་མམ།\n",
        "id": "f70a85bf-301c-4770-913f-35748269b8f0"
    },
    {
        "segment_content": "རབ་འབྱོར་གྱིས་གསོལ་པ། བཅོམ་ལྡན་འདས་དེ་ནི་མ་ལགས་སོ། །\n",
        "id": "ce847128-52ea-43ba-a8be-4c0f34071061"
    },
    {
        "segment_content": "དེ་ཅིའི་སླད་དུ་ཞེ་ན། སྐྱེས་བུ་ཆེན་པོའི་མཚན་སུམ་ཅུ་རྩ་གཉིས་གང་དག་དེ་བཞིན་གཤེགས་པས་གསུངས་པ་དེ་དག་མཚན་མ་མཆིས་པར་དེ་བཞིན་གཤེགས་པས་གསུངས་པའི་སླད་དུ་སྟེ།\n",
        "id": "481e8e05-7436-445f-8fa1-7bc1f0242793"
    },
    {
        "segment_content": "དེས་ན་སྐྱེས་བུ་ཆེན་པོའི་མཚན་སུམ་ཅུ་རྩ་གཉིས་རྣམས་ཞེས་བགྱིའོ། །\n",
        "id": "23addc44-e8c8-4431-82fb-9b83d4794499"
    },
    {
        "segment_content": "བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། རབ་འབྱོར་སྐྱེས་པའམ། བུད་མེད་གང་ལ་ལ་ཞིག་གིས་ལུས་གང་གཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་ཡོངས་སུ་གཏོང་བ་བས། གང་གིས་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་ལས་ཐ་ན་ཚིག་བཞི་པའི་ཚིགས་སུ་བཅད་པ་ཙམ་བཟུང་སྟེ་གཞན་དག་ལ་ཡང་དག་པར་བསྟན་ན། དེ་ཉིད་གཞི་དེ་ལས་བསོད་ནམས་ཆེས་མང་དུ་གྲངས་མེད་དཔག་ཏུ་མེད་པ་བསྐྱེད་དོ། །\n",
        "id": "d00fd635-7873-4136-8534-cb0a50eaa7de"
    },
    {
        "segment_content": "དེ་ནས་ཚེ་དང་ལྡན་པ་རབ་འབྱོར་ཆོས་ཀྱི་ཤུགས་ཀྱིས་མཆི་མ་ཕྱུང་སྟེ། \n",
        "id": "d55302e1-d93b-4476-a1be-af1cc9faaaed"
    },
    {
        "segment_content": "དེས་མཆི་མ་ཕྱིས་ནས་བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །\n",
        "id": "f186effe-cf0a-4736-9405-eca97a34e10f"
    },
    {
        "segment_content": "ཆོས་ཀྱི་རྣམ་གྲངས་འདི་དེ་བཞིན་གཤེགས་པ་ཇི་སྙེད་པས་གསུངས་པ་ནི། བཅོམ་ལྡན་འདས་ངོ་མཚར་ལགས་སོ། །བདེ་བར་གཤེགས་པ་ངོ་མཚར་ལགས་སོ། །\n",
        "id": "03c517a3-e17a-44df-bc57-acdc4b07647d"
    },
    {
        "segment_content": "བཅོམ་ལྡན་འདས་བདག་གིས་ཡེ་ཤེས་སྐྱེས་ཚུན་ཆད་བདག་གིས་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་སྔོན་ནམ་ཡང་མ་ཐོས་ལགས་སོ། །\n",
        "id": "08f11f43-cb3a-46d2-af4a-3ff3e4d1f6d7"
    },
    {
        "segment_content": "དེ་ཅིའི་སླད་དུ་ཞེ་ན། བཅོམ་ལྡན་འདས་མདོ་སྡེ་བཤད་པ་འདི་ལ་གང་དག་ཡང་དག་པར་འདུ་ཤེས་བསྐྱེད་པར་འགྱུར་བའི་སེམས་ཅན་དེ་དག་ནི་ངོ་མཚར་རབ་དང་ལྡན་པར་འགྱུར་ལགས་སོ། །\n",
        "id": "d7dfcd3a-4686-4fa1-8aaa-5a565e2b57d8"
    },
    {
        "segment_content": "དེ་ཅིའི་སླད་དུ་ཞེ་ན། བཅོམ་ལྡན་འདས་ཡང་དག་པར་འདུ་ཤེས་པ་གང་ལགས་པ་དེ་ཉིད་འདུ་ཤེས་མ་མཆིས་པའི་སླད་དུ་སྟེ། \n",
        "id": "53ae3058-216e-43c7-9a44-621e29ee22e8"
    },
    {
        "segment_content": "དེས་ན་ཡང་དག་པར་འདུ་ཤེས་ཞེས་དེ་བཞིན་གཤེགས་པས་གསུངས་སོ། །\n",
        "id": "6549bf84-25d7-4f4d-8608-396584b1f8ae"
    },
    {
        "segment_content": "བཅོམ་ལྡན་འདས་བདག་ནི་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་བཤད་པ་ལ་རྟོག་ཅིང་མོས་པ་ནི། བདག་ལ་ངོ་མཚར་མ་ལགས་ཀྱི།\n",
        "id": "098ea4d2-668f-4503-8db1-9ed83dac85b7"
    },
    {
        "segment_content": "བཅོམ་ལྡན་འདས་སླད་མའི་ཚེ་སླད་མའི་དུས་ལྔ་བརྒྱའི་ཐ་མ་ལ་སེམས་ཅན་གང་དག་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་ལེན་པ་དང༌། འབྲི་བ་དང་། འཛིན་པ་དང༌། འཆང་བ་དང༌། ཀློག་པ་དང༌། ཀུན་ཆུབ་པར་བྱེད་པ་དེ་དག་ནི་ངོ་མཚར་རབ་དང་ལྡན་པར་འགྱུར་ལགས་སོ། །\n",
        "id": "17a54840-7522-4dcb-9b0f-f31a840d31a0"
    },
    {
        "segment_content": "ཡང་བཅོམ་ལྡན་འདས་དེ་དག་ནི་བདག་ཏུ་འདུ་ཤེས་འཇུག་པར་མི་འགྱུར་ཞིང༌།\n",
        "id": "2232ea29-f0ab-4181-8fe2-ac935a11cb19"
    },
    {
        "segment_content": "སེམས་ཅན་དུ་འདུ་ཤེས་པ་དང༌། སྲོག་ཏུ་འདུ་ཤེས་པ་དང༌། གང་ཟག་ཏུ་འདུ་ཤེས་འཇུག་པར་མི་འགྱུར་ལགས་སོ། །\n",
        "id": "1de8fa68-c600-452e-aff5-e3d91f271b40"
    },
    {
        "segment_content": "དེ་ཅིའི་སླད་དུ་ཞེ་ན། བཅོམ་ལྡན་འདས་བདག་ཏུ་འདུ་ཤེས་པ་དང༌། སེམས་ཅན་དུ་འདུ་ཤེས་པ་དང༌། སྲོག་ཏུ་འདུ་ཤེས་པ་དང༌། གང་ཟག་ཏུ་འདུ་ཤེས་པ་གང་ལགས་པ་དེ་ཉིད་འདུ་ཤེས་ཐམས་ཅད་དང་བྲལ་བའི་སླད་དུའོ།།\n",
        "id": "04e5cf4e-0494-4be0-86fe-e52399476b57"
    },
    {
        "segment_content": "དེ་ཅིའི་སླད་དུ་ཞེ་ན། སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ནི་འདུ་ཤེས་ཐམས་ཅད་དང་བྲལ་བའི་སླད་དུའོ།།\n",
        "id": "374fa205-4fc8-4820-85d3-52933042b3ad"
    },
    {
        "segment_content": "དེ་སྐད་ཅེས་གསོལ་པ་དང༌། བཅོམ་ལྡན་འདས་ཀྱིས་ཚེ་དང་ལྡན་པ་རབ་འབྱོར་ལ་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ། །\n",
        "id": "411b774f-689a-4374-bc0b-5503d75f0620"
    },
    {
        "segment_content": "རབ་འབྱོར་དེ་དེ་བཞིན་ནོ། །དེ་དེ་བཞིན་ཏེ། \n",
        "id": "19653875-e089-4116-885d-81b67a7b97d9"
    },
    {
        "segment_content": "སེམས་ཅན་གང་དག་མདོ་སྡེ་འདི་བཤད་པ་ལ་མི་སྐྲག་ཅིང་མི་དངངས་ལ་ཀུན་ཏུ་དངངས་པར་མི་འགྱུར་བ་དེ་དག་ནི་ངོ་མཚར་རབ་དང་ལྡན་པར་འགྱུར་རོ། །\n",
        "id": "e9bd1362-92bb-4327-b275-399d5ab6dd5b"
    },
    {
        "segment_content": "དེ་ཅིའི་ཕྱིར་ཞེ་ན། རབ་འབྱོར་ཕ་རོལ་ཏུ་ཕྱིན་པ་དམ་པ་འདི་ནི་དེ་བཞིན་གཤེགས་པས་གསུངས་ཏེ།\n",
        "id": "a21cd8b8-8575-476a-b2e7-b571258f2c3f"
    },
    {
        "segment_content": "ཕ་རོལ་ཏུ་ཕྱིན་པ་དམ་པ་གང་དག་དེ་བཞིན་གཤེགས་པས་གསུངས་པ་དེ་སངས་རྒྱས་བཅོམ་ལྡན་འདས་དཔག་ཏུ་མེད་པ་ཚད་མེད་པ་རྣམས་ཀྱིས་ཀྱང་གསུངས་པའི་ཕྱིར་ཏེ། \n",
        "id": "5bd5bba0-09ed-4dfe-9feb-9b9b4707490b"
    },
    {
        "segment_content": "དེས་ན་ཕ་རོལ་ཏུ་ཕྱིན་པ་དམ་པ་ཞེས་བྱའོ། །\n",
        "id": "23d5e3ae-490b-4163-9b16-2eb53f9c864a"
    },
    {
        "segment_content": "ཡང་རབ་འབྱོར་དེ་བཞིན་གཤེགས་པས་བཟོད་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་གང་ཡིན་པ་དེ་ཉིད་ཕ་རོལ་ཏུ་ཕྱིན་པ་མེད་དོ། །\n",
        "id": "5d02d959-e24d-46a8-abad-384e6b831b3a"
    },
    {
        "segment_content": "དེ་ཅིའི་ཕྱིར་ཞེ་ན། རབ་འབྱོར་གང་གི་ཚེ་ཀ་ལིང་ཀའི་རྒྱལ་པོས། ངའི་ཡན་ལག་དང་ཉིང་ལག་རྣམས་བཅད་པར་གྱུར་པ་དེའི་ཚེ་ང་ལ་བདག་ཏུ་འདུ་ཤེས་སམ། སེམས་ཅན་དུ་འདུ་ཤེས་སམ། སྲོག་ཏུ་འདུ་ཤེས་སམ། གང་ཟག་ཏུ་འདུ་ཤེས་ཀྱང་མ་བྱུང་ཞིང༌།\n",
        "id": "3fc0a4b2-037c-412d-aeeb-f2e618af3f33"
    },
    {
        "segment_content": "ང་ལ་འདུ་ཤེས་ཅི་ཡང་མེད་ལ་འདུ་ཤེས་མེད་པར་གྱུར་པ་ཡང་མ་ཡིན་པའི་ཕྱིར་རོ། །\n",
        "id": "c80e6750-d220-4400-b239-e87c398926cc"
    },
    {
        "segment_content": "དེ་ཅིའི་ཕྱིར་ཞེ་ན། རབ་འབྱོར་གལ་ཏེ་དེའི་ཚེ་ང་ལ་བདག་ཏུ་འདུ་ཤེས་བྱུང་ན། དེའི་ཚེ་གནོད་སེམས་ཀྱི་འདུ་ཤེས་ཀྱང་འབྱུང་ལ།\n",
        "id": "cfe07565-caae-495d-9b78-ff8a3f814bdb"
    },
    {
        "segment_content": "སེམས་ཅན་དུ་འདུ་ཤེས་པ་དང༌། སྲོག་ཏུ་འདུ་ཤེས་པ་དང༌། གང་ཟག་ཏུ་འདུ་ཤེས་བྱུང་ན། དེའི་ཚེ་གནོད་སེམས་ཀྱི་འདུ་ཤེས་ཀྱང་འབྱུང་བའི་ཕྱིར་རོ། །\n",
        "id": "e39e7683-55b1-479d-8f81-fcc93a1b573c"
    },
    {
        "segment_content": "རབ་འབྱོར་ངས་མངོན་པར་ཤེས་ཏེ། འདས་པའི་དུས་ན། ང་ཚེ་རབས་ལྔ་བརྒྱར་བཟོད་པ་སྨྲ་བ་ཞེས་བྱ་བའི་དྲང་སྲོང་དུ་གྱུར་པ་དེའི་ཚེ་ན་ཡང༌། ང་ལ་བདག་ཏུ་འདུ་ཤེས་མ་བྱུང༌།\n",
        "id": "a5e03ee8-5772-47cd-88f4-7afec11a86a8"
    },
    {
        "segment_content": "སེམས་ཅན་དུ་འདུ་ཤེས་དང༌། སྲོག་ཏུ་འདུ་ཤེས་དང༌། གང་ཟག་ཏུ་འདུ་ཤེས་མ་བྱུང་ངོ་། །\n",
        "id": "677e0130-6e00-493a-894a-cb792d65cffc"
    },
    {
        "segment_content": "རབ་འབྱོར་དེ་ལྟ་བས་ན། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་འདུ་ཤེས་ཐམས་ཅད་རྣམ་པར་སྤངས་ཏེ། \n",
        "id": "13767ef3-eb58-4dd4-8156-8423d363f6ad"
    },
    {
        "segment_content": "བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་པར་བྱའོ། །\n",
        "id": "cef18839-812a-4f6d-b5a5-27dfc8f9a33a"
    },
    {
        "segment_content": "གཟུགས་ལ་ཡང་མི་གནས་པར་སེམས་བསྐྱེད་པར་བྱའོ། །\n",
        "id": "84713261-7399-4769-ae6c-de67dc5ba582"
    },
    {
        "segment_content": "སྒྲ་དང་དྲི་དང་རོ་དང༌། རེག་བྱ་ལ་ཡང་མི་གནས་པར་སེམས་བསྐྱེད་པར་བྱའོ། །\n",
        "id": "951ab246-6df6-42d2-9aa3-69d532c4478e"
    },
    {
        "segment_content": "ཆོས་ལ་ཡང་མི་གནས་པར་སེམས་བསྐྱེད་པར་བྱའོ། །\n",
        "id": "2bb25c16-6e2f-458a-94a5-0b4d9c07358c"
    },
    {
        "segment_content": "ཆོས་མེད་པ་ལ་ཡང་མི་གནས་པར་སེམས་བསྐྱེད་པར་བྱའོ། །\n",
        "id": "b7e0957d-3f61-41cb-9381-a07b74b1f784"
    },
    {
        "segment_content": "ཅི་ལ་ཡང་མི་གནས་པར་སེམས་བསྐྱེད་པར་བྱའོ། །\n",
        "id": "130f5567-aaa6-47d2-a065-cfd1799bd37f"
    },
    {
        "segment_content": "དེ་ཅིའི་ཕྱིར་ཞེ་ན། གནས་པ་གང་ཡིན་པ་དེ་ཉིད་མི་གནས་པའི་ཕྱིར་ཏེ། \n",
        "id": "f914ba3f-ee69-43ed-8e07-b2223451c864"
    },
    {
        "segment_content": "དེ་བས་ན་དེ་བཞིན་གཤེགས་པས་འདི་སྐད་དུ། བྱང་ཆུབ་སེམས་དཔའ་གང་ལ་ཡང་མི་གནས་པར་སྦྱིན་པ་སྦྱིན་པར་བྱའོ། ། ཞེས་གསུངས་སོ། །\n",
        "id": "072041fc-173c-41ff-a4a9-813a48fad50b"
    },
    {
        "segment_content": "ཡང་རབ་འབྱོར་བྱང་ཆུབ་སེམས་དཔའ་འདི་ལྟར་སེམས་ཅན་ཐམས་ཅད་ཀྱི་དོན་གྱི་ཕྱིར་སྦྱིན་པ་ཡོངས་སུ་གཏང་བར་བྱའོ། །\n",
        "id": "1eeb6a74-8aa5-4308-b2e5-46b05c2d3df3"
    },
    {
        "segment_content": "སེམས་ཅན་དུ་འདུ་ཤེས་པ་གང་ཡིན་པ་དེ་ཉིད་ཀྱང་འདུ་ཤེས་མེད་པ་སྟེ།\n",
        "id": "c9b8f1b4-c6ec-404b-a5b1-4a914385732c"
    },
    {
        "segment_content": "དེ་བཞིན་གཤེགས་པས་སེམས་ཅན་ཐམས་ཅད་ཅེས་གང་དག་གསུངས་པའི་སེམས་ཅན་དེ་དག་ཉིད་ཀྱང་མེད་པའོ། །\n",
        "id": "b0e71c43-6c95-4e59-99c8-700d5733ad92"
    },
    {
        "segment_content": "དེ་ཅིའི་ཕྱིར་ཞེ་ན། རབ་འབྱོར་དེ་བཞིན་གཤེགས་པ་ནི་ཡང་དག་པར་གསུང་བ། བདེན་པར་གསུང་བ། དེ་བཞིན་ཉིད་དུ་གསུང་བ་སྟེ། \n",
        "id": "94c37df0-fc60-4f17-883b-97f07b23fe34"
    },
    {
        "segment_content": "དེ་བཞིན་གཤེགས་པ་ནི་ལོག་པར་གསུང་བ་མ་ཡིན་པའི་ཕྱིར་རོ། །\n",
        "id": "d513275a-4cc9-4e25-a925-b59503496536"
    },
    {
        "segment_content": "ཡང་རབ་འབྱོར་དེ་བཞིན་གཤེགས་པས་ཆོས་གང་ཡང་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་པའམ། བསྟན་པ་དེ་ལ་བདེན་པ་ཡང་མེད། རྫུན་པ་ཡང་མེད་དོ། །\n",
        "id": "a49cca7f-94ac-4c63-9a6b-9dabcd5ea05e"
    },
    {
        "segment_content": "རབ་འབྱོར་འདི་ལྟ་སྟེ། དཔེར་ན་མིག་དང་ལྡན་པའི་མི་ཞིག་མུན་པར་ཞུགས་ན་ཅི་ཡང་མི་མཐོང་བ་དེ་བཞིན་དུ་གང་དངོས་པོར་ལྷུང་བས་སྦྱིན་པ་ཡོངས་སུ་གཏོང་བའི་བྱང་ཆུབ་སེམས་དཔའ་བལྟ་བར་བྱའོ། །\n",
        "id": "6b557aac-0510-49a0-95b4-1eb143ab43c4"
    },
    {
        "segment_content": "ཡང་རབ་འབྱོར་འདི་ལྟ་སྟེ། དཔེར་ན། ནམ་ལངས་ཏེ་ཉི་མ་ཤར་ནས་མིག་དང་ལྡན་པའི་མིས་གཟུགས་རྣམ་པ་སྣ་ཚོགས་དག་མཐོང་བ་དེ་བཞིན་དུ། གང་དངོས༌པོར་མ་ལྷུང་བས་སྦྱིན་པ་ཡོངས་སུ་གཏོང་བའི་བྱང་ཆུབ་སེམས་དཔའ་བལྟ་བར་བྱའོ། །\n",
        "id": "22039e4a-e349-4095-a39f-d1d2595b643d"
    },
    {
        "segment_content": "ཡང་རབ་འབྱོར་རིགས་ཀྱི་བུའམ་རིགས་ཀྱི་བུ་མོ་གང་དག་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་ལེན་པ་དང༌། འཛིན་པ་དང༌། འཆང་བ་དང༌། ཀློག་པ་དང༌། ཀུན་ཆུབ་པར་བྱེད་པ་དང༌། གཞན་དག་ལ་རྒྱ་ཆེར་ཡང་དག་པར་རབ་ཏུ་སྟོན་པ་དེ་དག་ནི་དེ་བཞིན་གཤེགས་པས་མཁྱེན། དེ་བཞིན་གཤེགས་པས་གཟིགས་ཏེ་\n",
        "id": "7e77cafe-2d86-489e-9752-023052c28c70"
    },
    {
        "segment_content": "སེམས་ཅན་དེ་དག་ཐམས་ཅད་ནི་བསོད་ནམས་ཀྱི་ཕུང་པོ་དཔག་ཏུ་མེད་པ་བསྐྱེད་པར་འགྱུར་རོ། །\n",
        "id": "46eb8601-0b8b-471a-adb9-0a4920faf9fa"
    },
    {
        "segment_content": "ཡང་རབ་འབྱོར་སྐྱེས་པའམ། བུད་མེད་གང་ཞིག་སྔ་དྲོའི་དུས་ཀྱི་ཚེ་ལུས་གངྒཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་ཡོངས་སུ་གཏོང་ལ། ཕྱེད་ཀྱི་དུས་དང༌། ཕྱི་དྲོའི་དུས་ཀྱི་ཚེ་ཡང་ལུས་གང་གཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་ཡོངས་སུ་གཏོང་སྟེ། རྣམ་གྲངས་འདི་ལྟ་བུར་བསྐལ་པ་བྱེ་བ་ཁྲག་ཁྲིག་འབུམ་ཕྲག་དུ་མར་ལུས་ཡོངས་སུ་གཏོང་བ་བས། \n",
        "id": "5852f0bf-d318-4634-ac44-9bf73bdc45e2"
    },
    {
        "segment_content": "གང་གིས་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་ཐོས་ནས་མི་སྤོང་ན། དེ་ཉིད་གཞི་དེ་ལས་བསོད་ནམས་ཆེས་མང་དུ་གྲངས་མེད་དཔག་ཏུ་མེད་པ་བསྐྱེད་ན། གང་གིས་ཡི་གེར་བྲིས་ནས་ལེན་པ་དང༌། འཛིན་པ་དང༌། འཆང་བ་དང༌། ཀློག་པ་དང༌། ཀུན་ཆུབ་པར་བྱེད་པ་དང༌། གཞན་དག་ལ་རྒྱ་ཆེར་ཡང་དག་པར་རབ་ཏུ་སྟོན་པ་ལྟ་ཅི་སྨོས།\n",
        "id": "aa1186ed-a406-455b-b625-414c62d38d54"
    },
    {
        "segment_content": "ཡང་རབ་འབྱོར་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་ནི་བསམ་གྱིས་མི་ཁྱབ་ཅིང༌། མཚུངས་པ་མེད་དེ།\n",
        "id": "b7aa1009-aaf2-4330-9a3f-1895631deebc"
    },
    {
        "segment_content": "འདིའི་རྣམ་པར་སྨིན་པ་ཡང་བསམ་གྱིས་མི་ཁྱབ་པ་ཉིད་དུ་རིག་པར་བྱའོ། །\n",
        "id": "f517eb5d-4859-45ab-9dd8-0144a3d61eaf"
    },
    {
        "segment_content": "ཆོས་ཀྱི་རྣམ་གྲངས་འདི་ནི་ཐེག་པ་མཆོག་ལ་ཡང་དག་པར་ཞུགས་པའི་སེམས་ཅན་རྣམས་ཀྱི་དོན་དང༌། ཐེག་པ་ཕུལ་དུ་ཕྱིན་པ་ལ་ཡང་དག་པར་ཞུགས་པའི་སེམས་ཅན་རྣམས་ཀྱི་དོན་གྱི་ཕྱིར་དེ་བཞིན་གཤེགས་པས་གསུངས་སོ། །\n",
        "id": "130e7ee5-33e6-4580-9abf-7605d0c58696"
    },
    {
        "segment_content": "གང་དག་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་ལེན་པ་དང༌། འཛིན་པ་དང༌། འཆང་བ་དང༌། ཀློག་པ་དང༌། ཀུན་ཆུབ་པར་བྱེད་པ་དང༌། གཞན་དག་ལ་རྒྱ་ཆེར་ཡང་དག་པར་རབ་ཏུ་སྟོན་པ་དེ་དག་ནི་དེ་བཞིན་གཤེགས་པས་མཁྱེན། དེ་བཞིན་གཤེགས་པས་གཟིགས་ཏེ། \n",
        "id": "0a5b8484-0507-4ead-a2f2-c7e853bdb131"
    },
    {
        "segment_content": "སེམས་ཅན་དེ་དག་ཐམས་ཅད་ནི་བསོད་ནམས་ཀྱི་ཕུང་པོ་དཔག་ཏུ་མེད་པ་དང་ལྡན་པར་འགྱུར་\n",
        "id": "1e806040-5be3-4d20-a5eb-fc82aec9b740"
    },
    {
        "segment_content": "བསོད་ནམས་ཀྱི་ཕུང་པོ་བསམ་གྱིས་མི་ཁྱབ་པ་དང༌། མཚུངས་པ་མེད་པ་དང༌། གཞལ་དུ་མེད་པ་དང༌། ཚད་མེད་པ་དང་ལྡན་པར་འགྱུར་ཏེ།\n",
        "id": "5c2f16a6-3675-44e8-8bce-397e0134f038"
    },
    {
        "segment_content": "སེམས་ཅན་དེ་དག་ཐམས་ཅད་ངའི་བྱང་ཆུབ་ཕྲག་པ་ལ་ཐོགས་པར་འགྱུར་རོ། །\n",
        "id": "a137533d-a716-4126-92bc-a7d952e47100"
    },
    {
        "segment_content": "དེ་ཅིའི་ཕྱིར་ཞེ་ན། རབ་འབྱོར་དམན་པ་ལ་མོས་པ་རྣམས་ཀྱིས་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་མཉན་པར་མི་ནུས་ཏེ།\n",
        "id": "3d46364f-5116-4853-af69-23a6d009ba5e"
    },
    {
        "segment_content": "བདག་ཏུ་ལྟ་བ་རྣམས་ཀྱིས་མ་ཡིན། སེམས་ཅན་དུ་ལྟ་བ་རྣམས་ཀྱིས་མ་ཡིན། སྲོག་ཏུ་ལྟ་བ་རྣམས་ཀྱིས་མ་ཡིན་ཞིང༌།\n",
        "id": "2464fcd4-7314-42c7-8c49-390bbc82d339"
    },
    {
        "segment_content": "གང་ཟག་ཏུ་ལྟ་བ་རྣམས་ཀྱིས་མཉན་པ་དང༌། བླང་བ་དང་། གཟུང་བ་དང༌། བཀླག་པ་དང༌། ཀུན་ཆུབ་པར་བྱེད་མི་ནུས་ཏེ། \n",
        "id": "028488bb-c715-4032-8a21-71445a030ad8"
    },
    {
        "segment_content": "དེ་ནི་གནས་མེད་པའི་ཕྱིར་རོ། །\n",
        "id": "e71009d3-4706-48a0-8af0-a670460bad31"
    },
    {
        "segment_content": "ཡང་རབ་འབྱོར་ས་ཕྱོགས་གང་ན་མདོ་སྡེ་འདི་སྟོན་པའི་ས་ཕྱོགས་དེ་ལྷ་དང་། མི་དང་། ལྷ་མ་ཡིན་དུ་བཅས་པའི་འཇིག་རྟེན་གྱིས་མཆོད་པ་བྱ་བར་འོས་པར་འགྱུར་རོ། །\n",
        "id": "12ac7475-4953-4159-9d88-fd315fc40621"
    },
    {
        "segment_content": "ས་ཕྱོགས་དེ་ཕྱག་བྱ་བར་འོས་པ་དང༌། བསྐོར་བ་བྱ་བར་འོས་པར་འགྱུར་ཏེ།\n",
        "id": "ffb88c21-6595-4c5f-a1dd-c8638cb43eeb"
    },
    {
        "segment_content": "ས་ཕྱོགས་དེ་མཆོད་རྟེན་ལྟ་བུར་འགྱུར་རོ། །\n",
        "id": "d5ee2820-4002-473f-a921-38d91baefc7b"
    },
    {
        "segment_content": "ཡང་རབ་འབྱོར་རིགས་ཀྱི་བུའམ། རིགས་ཀྱི་བུ་མོ་གང་དག་འདི་ལྟ་བུའི་མདོ་སྡེའི་ཚིག་འདི་དག་ལེན་པ་དང༌། འཛིན་པ་དང༌། འཆང་བ་དང༌། ཀློག་པ་དང༌། ཀུན་ཆུབ་པར་བྱེད་པ་དེ་དག་ནི་མནར་བར་འགྱུར་\n",
        "id": "7e94dda4-a5a0-42d4-8252-0d09d5d37c8d"
    },
    {
        "segment_content": "ཤིན་ཏུ་མནར་བར་འགྱུར་རོ། །\n",
        "id": "7660ccc9-b203-4e17-83ab-f4895456716e"
    },
    {
        "segment_content": "དེ་ཅིའི་ཕྱིར་ཞེ་ན། རབ་འབྱོར་སེམས་ཅན་དེ་དག་ནི་ཚེ་རབས་སྔ་མའི་མི་དགེ་བའི་ལས་ངན་སོང་དུ་སྐྱེ་བར་འགྱུར་བ་གང་དག་བྱས་པ་དེ་དག་ཚེ་འདི་ཉིད་ལ་མནར་བས། ཚེ་རབས་སྔ་མའི་མི་དགེ་བའི་ལས་ངན་སོང་དུ་སྐྱེ་བར་འགྱུར་བ་གང་དག་བྱས་པ་དེ་དག་བྱང་བར་འགྱུར་ཏེ། \n",
        "id": "1016770f-5b2f-4b28-8012-1747a77b0a72"
    },
    {
        "segment_content": "སངས་རྒྱས་ཀྱི་བྱང་ཆུབ་ཀྱང་ཐོབ་པར་འགྱུར་རོ། །\n",
        "id": "4e37ca44-4b4c-45f6-828b-90d1ae82a6a7"
    },
    {
        "segment_content": "རབ་འབྱོར་ངས་མངོན་པར་ཤེས་ཏེ། འདས་པའི་དུས་བསྐལ་པ་གྲངས་མེད་པའི་ཡང་ཆེས་གྲངས་མེད་པ་ན། དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་མར་མེ་མཛད་ཀྱི་སྔ་རོལ་གྱི་ཡང་ཆེས་སྔ་རོལ་ན་སངས་རྒྱས་བྱེ་བ་ཁྲག་ཁྲིག་འབུམ་ཕྲག་བརྒྱད་ཅུ་རྩ་བཞི་དག་བྱུང་བ་ངས་མཉེས་པར་བྱས་ཏེ།\n",
        "id": "ec141110-1d85-45af-9af9-e505cc813387"
    },
    {
        "segment_content": "མ་མཉེས་པར་མ་བྱས་ནས་ཐུགས་འབྱུང་བར་མ་བྱས་ཏེ།\n",
        "id": "3546191b-ae27-422a-bbcd-b2d7a5a95a84"
    },
    {
        "segment_content": "རབ་འབྱོར་སངས་རྒྱས་བཅོམ་ལྡན་འདས་དེ་དག་ངས་མཉེས་པར་བྱས་ནས་ཐུགས་འབྱུང་བར་མ་བྱས་པ་གང་ཡིན་པ་དང༌། ཕྱི་མའི་དུས་ལྔ་བརྒྱའི་ཐ་མར་གྱུར་པ་ན། མདོ་སྡེ་འདི་ལེན་པ་དང༌། འདྲི་བ་དང༌། འཛིན་པ་དང་འཆང་བ་དང༌། ཀློག་པ་དང༌། ཀུན་ཆུབ་པར་བྱེད་པ་གང་ཡིན་པ་ལས། རབ་འབྱོར་བསོད་ནམས་ཀྱི་ཕུང་པོ་འདི་ལ་བསོད་ནམས་ཀྱི་ཕུང་པོ་སྔ་མས་བརྒྱའི་ཆར་ཡང་ཉེ་བར་མི་འགྲོ།\n",
        "id": "a5ce9e14-1989-4b49-99b1-a72a2df6aa9e"
    },
    {
        "segment_content": "སྟོང་གི་ཆ་དང༌། འབུམ་གྱི་ཆ་དང༌། གྲངས་དང་ཚད་དང་བགྲང་བ་དང༌། དཔེ་དང་ཟླ་དང་རྒྱུར་ཡང་མི་བཟོད་དོ། །\n",
        "id": "934aba18-b23d-4460-beb7-c6351089aff8"
    },
    {
        "segment_content": "རབ་འབྱོར་གལ་ཏེ་དེའི་ཚེ་རིགས་ཀྱི་བུའམ་རིགས་ཀྱི་བུ་མོ་གང་དག་བསོད་ནམས་ཀྱི་ཕུང་པོ་ཇི་སྙེད་རབ་ཏུ་འཛིན་པར་འགྱུར་བའི་རིགས་ཀྱི་བུའམ་རིགས་ཀྱི་བུ་མོ་དེ་དག་གི་བསོད་ནམས་ཀྱི་ཕུང་པོ་ངས་བརྗོད་ན། སེམས་ཅན་རྣམས་མྱོ་མྱོ་པོར་འགྱུར་ཞིང་སེམས་འཁྲུགས་པར་འགྱུར་རོ། །\n",
        "id": "5579bc11-fae6-4176-b479-18c300abe18b"
    },
    {
        "segment_content": "ཡང་རབ་འབྱོར་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་བསམ་གྱིས་མི་ཁྱབ་སྟེ།\n",
        "id": "650f9f49-dec9-4006-9b2b-506f33fdbc4a"
    },
    {
        "segment_content": "འདིའི་རྣམ་པར་སྨིན་པ་ཡང་བསམ་གྱིས་མི་ཁྱབ་པ་ཉིད་དུ་རིག་པར་བྱའོ། །\n",
        "id": "239d920a-c4fa-4f48-b57c-3c7875ba4212"
    },
    {
        "segment_content": "དེ་ནས་བཅོམ་ལྡན་འདས་ལ་ཚེ་དང་ལྡན་པ་རབ་འབྱོར་གྱིས་འདི་སྐད་ཅེས་གསོལ་ཏོ། །\n",
        "id": "c78f1d46-99c2-4243-8a1f-896922802ad7"
    },
    {
        "segment_content": "བཅོམ་ལྡན་འདས་བྱང་ཆུབ་སེམས་དཔའི་ཐེག་པ་ལ་ཡང་དག་པར་ཞུགས་པ་རྣམས་ཀྱིས་ཇི་ལྟར་གནས་པར་བགྱི། \n",
        "id": "45da701b-a8c0-4dc6-8aba-1856e1eb2f93"
    },
    {
        "segment_content": "ཇི་ལྟར་བསྒྲུབ་པར་བགྱི།\n",
        "id": "50d5b236-71de-4c73-90d9-865abdb8e8d0"
    },
    {
        "segment_content": "ཇི་ལྟར་སེམས་རབ་ཏུ་གཟུང་བར་བགྱི།\n",
        "id": "35d4ea77-80eb-46c4-b22f-a97d39c4d753"
    },
    {
        "segment_content": "དེ་སྐད་ཅེས་གསོལ་པ་དང༌། བཅོམ་ལྡན་འདས་ཀྱིས་ཚེ་དང་ལྡན་པ་རབ་འབྱོར་ལ་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ། །\n",
        "id": "05d6f29a-4b3a-4032-ada3-d07edd7a9d29"
    },
    {
        "segment_content": "རབ་འབྱོར་འདི་ལ་བྱང་ཆུབ་སེམས་དཔའི་ཐེག་པ་ལ་ཡང་དག་པར་ཞུགས་པས་འདི་སྙམ་དུ་བདག་གིས་སེམས་ཅན་ཐམས་ཅད་ཕུང་པོ་ལྷག་མ་མེད་པའི་མྱ་ངན་ལས་འདས་པའི་དབྱིངས་སུ་ཡོངས་སུ་མྱ་ངན་ལས་འདའོ། །\n",
        "id": "45be9d37-39c2-4fd9-a9e0-a0e270b55e94"
    },
    {
        "segment_content": "དེ་ལྟར་སེམས་ཅན་ཚད་མེད་པ་ཡོངས་སུ་མྱ་ངན་ལས་འདས་ཀྱང༌། སེམས་ཅན་གང་ཡང་ཡོངས་སུ་མྱ་ངན་ལས་འདས་པར་གྱུར་པ་མེད་དོ་སྙམ་དུ་སེམས་བསྐྱེད་པར་བྱའོ། །\n",
        "id": "6b92e79f-cdc0-4ae7-b9dc-1967571e32be"
    },
    {
        "segment_content": "དེ་ཅིའི་ཕྱིར་ཞེ་ན། རབ་འབྱོར་གལ་ཏེ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་ཅན་དུ་འདུ་ཤེས་འཇུག་ན་དེ་བྱང་ཆུབ་སེམས་དཔའ་ཞེས་མི་བྱ་ལ།\n",
        "id": "77a0338f-5161-4d2b-8d6d-b3d0c2706e91"
    },
    {
        "segment_content": "གང་ཟག་གི་བར་དུ་འདུ་ཤེས་འཇུག་ན་ཡང༌། དེ་བྱང་ཆུབ་སེམས་དཔའ་ཞེས་མི་བྱ་བའི་ཕྱིར་རོ། །\n",
        "id": "516b6cd2-0dae-4896-9325-9c2f8efa9803"
    },
    {
        "segment_content": "དེ་ཅིའི་ཕྱིར་ཞེ་ན། རབ་འབྱོར་བྱང་ཆུབ་སེམས་དཔའི་ཐེག་པ་ལ་ཡང་དག་པར་ཞུགས་པ་ཞེས་བྱ་བའི་ཆོས་དེ་གང་ཡང་མེད་པའི་ཕྱིར་རོ། །\n",
        "id": "63029070-d7e2-4247-8db1-f2ebf2ed4064"
    },
    {
        "segment_content": "རབ་འབྱོར་འདི་ཇི་སྙམ་དུ་སེམས། \n",
        "id": "9a337f8e-331e-4d51-a9d2-df36deaf305d"
    },
    {
        "segment_content": "དེ་བཞིན་གཤེགས་པས་དེ་བཞིན་གཤེགས་པ་མར་མེ་མཛད་ལས་གང་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་པའི་ཆོས་གང་ཡང་ཡོད་སྙམ་མམ། \n",
        "id": "24bb6ee0-9a8f-4af1-84de-65c1ca2cfcc1"
    },
    {
        "segment_content": "དེ་སྐད་ཅེས་བཀའ་སྩལ་པ་དང༌།བཅོམ་ལྡན་འདས་ལ་ཚེ་དང༌ལྡན་པ་རབ་འབྱོར་གྱིས་འདི་སྐད་ཅེས་གསོལ་ཏོ། །\n",
        "id": "c602fe3f-4c2a-43fa-9428-21b103d26736"
    },
    {
        "segment_content": "བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པས་དེ་བཞིན་གཤེགས་པ་མར་མེ་མཛད་ལས་གང་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་པའི་ཆོས་དེ་གང་ཡང་མ་མཆིས་སོ། །\n",
        "id": "3eb1de30-6f42-4140-97cf-7a16ac1959ce"
    },
    {
        "segment_content": "དེ་སྐད་ཅེས་གསོལ་པ་དང༌། བཅོམ་ལྡན་འདས་ཀྱིས་ཚེ་དང་ལྡན་པ་རབ་འབྱོར་ལ་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ། །\n",
        "id": "787dade9-2bae-4e15-8254-b563ffb9a769"
    },
    {
        "segment_content": "རབ་འབྱོར་དེ་དེ་བཞིན་ནོ། །དེ་དེ་བཞིན་ཏེ། \n",
        "id": "98222076-2c6d-4706-9ee3-34299b7d5b22"
    },
    {
        "segment_content": "དེ་བཞིན་གཤེགས་པས་དེ་བཞིན་གཤེགས་པ་མར་མེ་མཛད་ལས་གང་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་པའི་ཆོས་དེ་གང་ཡང་མེད་དོ། །\n",
        "id": "4ac916c0-3bd1-41c6-8053-0c3ff30e9c3d"
    },
    {
        "segment_content": "རབ་འབྱོར་གལ་ཏེ་དེ་བཞིན་གཤེགས་པས་གང་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་པའི་ཆོས་དེ་འགའ་ཞིག་ཡོད་པར་གྱུར་ན། དེ་བཞིན་གཤེགས་པ་མར་མེ་མཛད་ཀྱིས་ང་ལ་བྲམ་ཟེའི་ཁྱེའུ་ཁྱོད་མ་འོངས་པའི་དུས་ན། དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཤཱཀྱ་ཐུབ་པ་ཞེས་བྱ་བར་འགྱུར་རོ། ། ཞེས་ལུང་མི་སྟོན་པ་ཞིག་ན། \n",
        "id": "5a1b28fe-f2ac-4d21-b7c6-6d9af98b9652"
    },
    {
        "segment_content": "རབ་འབྱོར་འདི་ལྟར་དེ་བཞིན་གཤེགས་པས་གང་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་པའི་ཆོས་དེ་གང་ཡང་མེད་པས་\n",
        "id": "cdb3c78a-11a7-45ad-a6f3-f70b27d4e9b5"
    },
    {
        "segment_content": "དེའི་ཕྱིར་དེ་བཞིན་གཤེགས་པ་མར་མེ་མཛད་ཀྱིས་ང་ལ་བྲམ་ཟེའི་ཁྱེའུ་ཁྱོད་མ་འོངས་པའི་དུས་ན་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཤཱཀྱ་ཐུབ་པ་ཞེས་བྱ་བར་འགྱུར་རོ་ཞེས་ལུང་བསྟན་ཏོ། །\n",
        "id": "4d89f2ce-2d74-41a0-b94e-84e0e10fc100"
    },
    {
        "segment_content": "དེ་ཅིའི་ཕྱིར་ཞེ་ན། རབ་འབྱོར་དེ་བཞིན་གཤེགས་པ་ཞེས་པ་ནི། ཡང་དག་པའི་དེ་བཞིན་ཉིད་ཀྱི་ཚིག་བླ་དྭགས་ཡིན་པའི་ཕྱིར་རོ། །\n",
        "id": "5b0eed5a-3652-4d24-afba-8b0063195eaf"
    },
    {
        "segment_content": "ཡང་རབ་འབྱོར་གང་ལ་ལ་ཞིག་འདི་སྐད་དུ། དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཀྱིས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་སོ་ཞེས་ཟེར་ན། དེ་ལོག་པར་སྨྲ་བ་ཡིན་ནོ། །\n",
        "id": "9cbba0f8-8e41-4b9f-987d-9439ce56a59d"
    },
    {
        "segment_content": "དེ་དེ་བཞིན་གཤེགས་པས་བྱང་ཆུབ་སེམས་དཔའ་བྱང་ཆུབ་སེམས་དཔའ་ཞེས་བརྗོད་དོ་\n",
        "id": "1ff5d512-f938-4ba4-bb27-771b18772b82"
    },
    {
        "segment_content": "དེ་ཅིའི་ཕྱིར་ཞེ་ན། རབ་འབྱོར་དེ་བཞིན་གཤེགས་པས་གང་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་པའི་ཆོས་དེ་གང་ཡང་མེད་པའི་ཕྱིར་རོ། །\n",
        "id": "ba29abad-02a9-43ce-884e-d707368a92bb"
    },
    {
        "segment_content": "རབ་འབྱོར་དེ་བཞིན་གཤེགས་པས་ཆོས་གང་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་པའམ། བསྟན་པ་དེ་ལ་བདེན་པའང་མེད། རྫུན་པ་ཡང་མེད་དོ། །\n",
        "id": "4ace5767-8557-461b-a6c7-91b53c491f2b"
    },
    {
        "segment_content": "དེ་བས་ན་དེ་བཞིན་གཤེགས་པས་ཆོས་ཐམས་ཅད་སངས་རྒྱས་ཀྱི་ཆོས་ཞེས་གསུངས་སོ། །\n",
        "id": "1b6da534-520b-4608-b539-8828e1f1ab3d"
    },
    {
        "segment_content": "རབ་འབྱོར་ཆོས་ཐམས་ཅད་ཅེས་བྱ་བ་ནི། དེ་དག་ཐམས་ཅད་ཆོས་མེད་པ་ཡིན་ཏེ། \n",
        "id": "263e5833-2b74-4968-be2d-86ff66f6986f"
    },
    {
        "segment_content": "དེས་ན་ཆོས་ཐམས་ཅད་སངས་རྒྱས་ཀྱི་ཆོས་ཞེས་བྱའོ། །\n",
        "id": "57554fda-376c-41fe-8f15-9ac741bc4f84"
    },
    {
        "segment_content": "རབ་འབྱོར་འདི་ལྟ་སྟེ་དཔེར་ན། སྐྱེས་བུ་ཞིག་མིའི་ལུས་དང་ལྡན་ཞིང་ལུས་ཆེན་པོར་གྱུར་པ་བཞིན་ནོ། །\n",
        "id": "1d9b3a1d-cef2-4650-9e77-f00665b33e44"
    },
    {
        "segment_content": "ཚེ་དང་ལྡན་པ་རབ་འབྱོར་གྱིས་གསོལ་པ། བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པས་སྐྱེས་བུ་མིའི་ལུས་དང་ལྡན་ཞིང་ལུས་ཆེན་པོ་ཞེས་གང་གསུངས་པ་དེ། དེ་བཞིན་གཤེགས་པས་ལུས་མ་མཆིས་པར་གསུངས་ཏེ། \n",
        "id": "17f1f85f-45f0-4754-96ed-93657151e903"
    },
    {
        "segment_content": "དེས་ན་ལུས་དང་ལྡན་ཞིང་ལུས་ཆེན་པོ་ཞེས་བགྱིའོ། །\n",
        "id": "6535f541-556f-4255-8194-0429a702b8c9"
    },
    {
        "segment_content": "བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། རབ་འབྱོར་དེ་དེ་བཞིན་ནོ། །དེ་བཞིན་ཏེ། \n",
        "id": "0be413fe-fa18-4907-8827-d1d56614597e"
    },
    {
        "segment_content": "བྱང་ཆུབ་སེམས་དཔའ་གང་འདི་སྐད་དུ་བདག་གིས་སེམས་ཅན་རྣམས་ཡོངས་སུ་མྱ་ངན་ལས་འདའོ་ཞེས་ཟེར་ན། དེ་བྱང་ཆུབ་སེམས་དཔའ་ཞེས་མི་བྱའོ། །\n",
        "id": "15303745-63d0-465a-9a96-bd86dc8bca72"
    },
    {
        "segment_content": "དེ་ཅིའི་ཕྱིར་ཞེ་ན། རབ་འབྱོར་བྱང་ཆུབ་སེམས་དཔའ་ཞེས་བྱ་བའི་ཆོས་དེ་གང་ཡང་ཡོད་སྙམ་མམ།\n",
        "id": "89329ca7-e929-4e3d-ba9d-290423138f13"
    },
    {
        "segment_content": "རབ་འབྱོར་གྱིས་གསོལ་པ། བཅོམ་ལྡན་འདས་དེ་ནི་མ་ལགས་སོ། །\n",
        "id": "6da5c01c-b82a-4f76-924e-3b6362b80cc5"
    },
    {
        "segment_content": "བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། རབ་འབྱོར་དེ་བས་ན། དེ་བཞིན་གཤེགས་པས་ཆོས་ཐམས་ཅད་ནི་སེམས་ཅན་མེད་པ། སྲོག་མེད་པ། གང་ཟག་མེད་པའོ། །ཞེས་གསུངས་སོ། །\n",
        "id": "086de3c5-0d0e-4d94-9e13-ef2d5aeaa7e8"
    },
    {
        "segment_content": "ཡང་རབ་འབྱོར་བྱང་ཆུབ་སེམས་དཔའ་གང་ཞིག་འདི་སྐད་དུ། བདག་གིས་ཞིང་བཀོད་པ་རྣམས་བསྒྲུབ་བོ་ཞེས་ཟེར་ན། དེ་ཡང་དེ་བཞིན་དུ་བརྗོད་པར་བྱའོ། །\n",
        "id": "83fbb75f-ef3d-4d4c-8146-ec20a9cebb4b"
    },
    {
        "segment_content": "དེ་ཅིའི་ཕྱིར་ཞེ་ན། རབ་འབྱོར་ཞིང་བཀོད་པ་རྣམས་ཞིང་བཀོད་པ་རྣམས་ཞེས་བྱ་བ་ནི། དེ་དག་བཀོད་པ་མེད་པར་དེ་བཞིན་གཤེགས་པས་གསུངས་པའི་ཕྱིར་ཏེ། \n",
        "id": "b819a62d-de6a-4ebf-a647-912d836868d7"
    },
    {
        "segment_content": "དེས་ན་ཞིང་བཀོད་པ་རྣམས་ཞེས་བྱའོ། །\n",
        "id": "dbab0081-9808-4801-9338-bb80065f89f8"
    },
    {
        "segment_content": "རབ་འབྱོར་བྱང་ཆུབ་སེམས་དཔའ་གང་ཞིག་འདི་སྐད་དུ། ཆོས་རྣམས་ནི་བདག་མེད་པ་ཆོས་རྣམས་ནི་བདག་མེད་པའོ་ཞེས་མོས་པ་དེ་ནི། དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཀྱིས། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཞེས་བརྗོད་དོ། །\n",
        "id": "22fb086f-9dbb-40a1-b495-69772b6c8d56"
    },
    {
        "segment_content": "རབ་འབྱོར་འདི་ཇི་སྙམ་དུ་སེམས། དེ་བཞིན་གཤེགས་པ་ལ་ཤའི་སྤྱན་མངའ་སྙམ་མམ། \n",
        "id": "91f1f544-1b49-40b9-9f11-1ef5dbd5bdbe"
    },
    {
        "segment_content": "རབ་འབྱོར་གྱིས་གསོལ་པ། བཅོམ་ལྡན་འདས་དེ་དེ་ལྟར་ལགས་ཏེ། དེ་བཞིན་གཤེགས་པ་ལ་ཤའི་སྤྱན་མངའོ། །\n",
        "id": "f6d160af-346d-4174-bae8-36e2997f87cb"
    },
    {
        "segment_content": "བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། རབ་འབྱོར་འདི་ཇི་སྙམ་དུ་སེམས། \n",
        "id": "94d328ef-39e0-4d57-b029-0f7f93253722"
    },
    {
        "segment_content": "དེ་བཞིན་གཤེགས་པ་ལ་ལྷའི་སྤྱན་མངའ་སྙམ་མམ། \n",
        "id": "471a285f-43a6-4fe6-90f9-ba9c3a268cc0"
    },
    {
        "segment_content": "རབ་འབྱོར་གྱིས་གསོལ་པ། བཅོམ་ལྡན་འདས་དེ་དེ་ལྟར་ལགས་ཏེ། དེ་བཞིན་གཤེགས་པ་ལ་ལྷའི་སྤྱན་མངའོ། །\n",
        "id": "64b7f258-23e6-4135-953b-a6e230b328c1"
    },
    {
        "segment_content": "བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། རབ་འབྱོར་འདི་ཇི་སྙམ་དུ་སེམས། \n",
        "id": "0710a1eb-a62a-4144-8f04-58d016672a57"
    },
    {
        "segment_content": "དེ་བཞིན་གཤེགས་པ་ལ་ཤེས་རབ་ཀྱི་སྤྱན་མངའ་སྙམ་མམ། \n",
        "id": "9faa87d5-4be2-4006-89a8-3fc21c165828"
    },
    {
        "segment_content": "རབ་འབྱོར་གྱིས་གསོལ་པ། བཅོམ་ལྡན་འདས་དེ་དེ་ལྟར་ལགས་ཏེ། \n",
        "id": "37a5cba1-7521-4bbe-ab50-a4ce11724a0b"
    },
    {
        "segment_content": "དེ་བཞིན་གཤེགས་པ་ལ་ཤེས་རབ་ཀྱི་སྤྱན་མངའོ། །\n",
        "id": "ed5d0e83-2677-4496-bcd4-f2f646762f2f"
    },
    {
        "segment_content": "བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། རབ་འབྱོར་འདི་ཇི་སྙམ་དུ་སེམས། \n",
        "id": "70799327-f231-4482-a4ce-734f4de31fdd"
    },
    {
        "segment_content": "དེ་བཞིན་གཤེགས་པ་ལ་ཆོས་ཀྱི་སྤྱན་མངའ་སྙམ་མམ། \n",
        "id": "8d9b6f80-2775-4ec7-9534-9f27582e326b"
    },
    {
        "segment_content": "རབ་འབྱོར་གྱིས་གསོལ་པ། བཅོམ་ལྡན་འདས་དེ་དེ་ལྟར་ལགས་ཏེ། \n",
        "id": "5464fe3e-c856-41c2-8bcf-f6b7848585e9"
    },
    {
        "segment_content": "དེ་བཞིན་གཤེགས་པ་ལ་ཆོས་ཀྱི་སྤྱན་མངའོ། །\n",
        "id": "0980d87c-8cf3-4b69-a50a-77a025d3f4d6"
    },
    {
        "segment_content": "བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། རབ་འབྱོར་འདི་ཇི་སྙམ་དུ་སེམས། \n",
        "id": "6fdaaa8e-fa2a-4bee-8838-30489b62725a"
    },
    {
        "segment_content": "དེ་བཞིན་གཤེགས་པ་ལ་སངས་རྒྱས་ཀྱི་སྤྱན་མངའ་སྙམ་མམ། \n",
        "id": "80589fff-3cd9-434c-be91-6d97a7c929a3"
    },
    {
        "segment_content": "རབ་འབྱོར་གྱིས་གསོལ་པ། བཅོམ་ལྡན་འདས་དེ་དེ་ལྟར་ལགས་ཏེ། \n",
        "id": "78c97e33-a231-4799-bb7f-f9e857397ff3"
    },
    {
        "segment_content": "དེ་བཞིན་གཤེགས་པ་ལ་སངས་རྒྱས་ཀྱི་སྤྱན་མངའོ། །\n",
        "id": "2e3545ee-6cd7-4921-a987-151a86228e05"
    },
    {
        "segment_content": "བཅོམ་ལྡན་འདས་ཀྱི་བཀའ་སྩལ་པ། རབ་འབྱོར་འདི་ཇི་སྙམ་དུ་སེམས། \n",
        "id": "0a9099a7-0726-456b-9c5f-1c68e62fd489"
    },
    {
        "segment_content": "གངྒཱའི་ཀླུང་གི་བྱེ་མ་ཇི་སྙེད་པ་གངྒཱའི་ཀླུང་ཡང་དེ་སྙེད་ཁོ་ནར་གྱུར་ལ། དེ་དག་གི་བྱེ་མ་དེ་སྙེད་ཀྱི་འཇིག་རྟེན་གྱི་ཁམས་སུ་གྱུར་ན། འཇིག་རྟེན་གྱི་ཁམས་དེ་དག་མང་བ་ཡིན་སྙམ་མམ། \n",
        "id": "88b7ed7f-af5c-4dea-b505-ddd951971e76"
    },
    {
        "segment_content": "རབ་འབྱོར་གྱིས་གསོལ་པ། བཅོམ་ལྡན་འདས་དེ་དེ་ལྟར་ལགས་ཏེ། \n",
        "id": "6c54e862-4d92-426a-8fad-c98fe4aa6585"
    },
    {
        "segment_content": "འཇིག་རྟེན་གྱི་ཁམས་དེ་དག་མང་ལགས་སོ། །\n",
        "id": "81eb1232-8fda-483e-b4d6-e60f8d6f5f3f"
    },
    {
        "segment_content": "བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། རབ་འབྱོར་འཇིག་རྟེན་གྱི་ཁམས་དེ་དག་ན་སེམས་ཅན་ཇི་སྙེད་ཡོད་པ་དེ་དག་གི་བསམ་པ་ཐ་དད་པའི་སེམས་ཀྱི་རྒྱུན་ངས་རབ་ཏུ་ཤེས་སོ། །\n",
        "id": "d42fb63c-e743-4907-9beb-974eb3de0c51"
    },
    {
        "segment_content": "དེ་ཅིའི་ཕྱིར་ཞེ་ན། རབ་འབྱོར་སེམས་ཀྱི་རྒྱུན་སེམས་ཀྱི་རྒྱུན་ཞེས་བྱ་བ་ནི། དེ་རྒྱུན་མེད་པར་དེ་བཞིན་གཤེགས་པས་གསུངས་པའི་ཕྱིར་ཏེ། \n",
        "id": "fb4b089a-f532-44b5-8750-db400dd8a032"
    },
    {
        "segment_content": "དེས་ན་སེམས་ཀྱི་རྒྱུན་ཞེས་བྱའོ། །\n",
        "id": "5e90a786-78c1-4b1e-9883-c2d182e9cb7a"
    },
    {
        "segment_content": "དེ་ཅིའི་ཕྱིར་ཞེ་ན། རབ་འབྱོར་འདས་པའི་སེམས་ཀྱང་དམིགས་སུ་མེད། \n",
        "id": "e93ad5dd-a7c5-4f8f-8a85-ae54f377494b"
    },
    {
        "segment_content": "མ་འོངས་པའི་སེམས་ཀྱང་དམིགས་སུ་མེད། \n",
        "id": "b51dce94-0c07-480a-b19f-738970f4397f"
    },
    {
        "segment_content": "ད་ལྟར་བྱུང་བའི་སེམས་ཀྱང་དམིགས་སུ་མེད་པའི་ཕྱིར་རོ། །\n",
        "id": "b04a61a4-94d6-422b-b0f3-d8a61eed5cdf"
    },
    {
        "segment_content": "རབ་འབྱོར་འདི་ཇི་སྙམ་དུ་སེམས། \n",
        "id": "0048ffba-bd70-4123-b429-f0ce80d53011"
    },
    {
        "segment_content": "གང་གིས་སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་འདི་རིན་པོ་ཆེ་སྣ་བདུན་གྱིས་རབ་ཏུ་གང་བར་བྱས་ཏེ་སྦྱིན་པ་བྱིན་ན། རིགས་ཀྱི་བུའམ་རིགས་ཀྱི་བུ་མོ་དེ་གཞི་དེ་ལས་བསོད་ནམས་མང་དུ་བསྐྱེད་དམ། \n",
        "id": "f8473dd5-bf2f-413c-8dbc-e68761421c11"
    },
    {
        "segment_content": "རབ་འབྱོར་གྱིས་གསོལ་པ། བཅོམ་ལྡན་འདས་མང་ལགས་སོ། །\n",
        "id": "4a1305b6-7dc0-4e72-9c4e-134209f80759"
    },
    {
        "segment_content": "བདེ་བར་གཤེགས་པ་མང་ལགས་སོ། །\n",
        "id": "76dea5ea-6f41-49a0-a62f-f9127e1df228"
    },
    {
        "segment_content": "བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། རབ་འབྱོར་དེ་དེ་བཞིན་ནོ། །དེ་དེ་བཞིན་ཏེ། \n",
        "id": "2c2f06aa-ac3c-43f1-882e-f5b70ce47cdc"
    },
    {
        "segment_content": "རིགས་ཀྱི་བུའམ་རིགས་ཀྱི་བུ་མོ་དེ་གཞི་དེ་ལས་བསོད་ནམས་ཀྱི་ཕུང་པོ་མང་དུ་བསྐྱེད་དོ། །\n",
        "id": "dc6060d7-23b6-4723-b6b4-fb249d519321"
    },
    {
        "segment_content": "ཡང་རབ་འབྱོར་གལ་ཏེ་བསོད་ནམས་ཀྱི་ཕུང་པོ་བསོད་ནམས་ཀྱི་ཕུང་པོར་གྱུར་པ་ན། བསོད་ནམས་ཀྱི་ཕུང་པོ་བསོད་ནམས་ཀྱི་ཕུང་པོ་ཞེས་དེ་བཞིན་གཤེགས་པ་མི་གསུང་ངོ་། །\n",
        "id": "7f3f1a74-4486-4ca8-a16c-00a01eac4616"
    },
    {
        "segment_content": "རབ་འབྱོར་འདི་ཇི་སྙམ་དུ་སེམས། \n",
        "id": "876e68a6-db1c-4c9a-a209-f36ff5ed8f35"
    },
    {
        "segment_content": "གཟུགས་ཀྱི་སྐུ་ཡོངས་སུ་གྲུབ་པས་དེ་བཞིན་གཤེགས་པར་བལྟ་བར་བྱ་སྙམ་མམ། \n",
        "id": "3b1f8fdc-cd0b-43a7-bfda-bf2a00c20b8c"
    },
    {
        "segment_content": "རབ་འབྱོར་གྱིས་གསོལ་པ། བཅོམ་ལྡན་འདས་དེ་ནི་མ་ལགས་སོ། །\n",
        "id": "5b65d835-171b-4d15-970a-14615d9aba93"
    },
    {
        "segment_content": "གཟུགས་ཀྱི་སྐུ་ཡོངས་སུ་གྲུབ་པས་དེ་བཞིན་གཤེགས་པར་བལྟ་བར་མི་བགྱི་ལགས་སོ། །\n",
        "id": "d004db36-9c98-489a-b8cd-0a59925a3ab0"
    },
    {
        "segment_content": "དེ་ཅིའི་སླད་དུ་ཞེ་ན། བཅོམ་ལྡན་འདས་གཟུགས་ཀྱི་སྐུ་ཡོངས་སུ་གྲུབ་པ་ཞེས་བགྱི་བ་ནི། དེ་ཡོངས་སུ་གྲུབ་པ་མ་མཆིས་པར་དེ་བཞིན་གཤེགས་པས་གསུངས་པའི་སླད་དུ་སྟེ། \n",
        "id": "1ded278a-ade8-47e2-9502-3f2cc084c8cf"
    },
    {
        "segment_content": "དེས་ན་གཟུགས་ཀྱི་སྐུ་ཡོངས་སུ་གྲུབ་པ་ཞེས་བགྱིའོ། །\n",
        "id": "7b800282-6bfb-44bd-9358-255f851b5a27"
    },
    {
        "segment_content": "བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། རབ་འབྱོར་འདི་ཇི་སྙམ་དུ་སེམས།\n",
        "id": "1937e789-5568-4657-9fab-d62389d06cd3"
    },
    {
        "segment_content": "མཚན་ཕུན་སུམ་ཚོགས་པས་དེ་བཞིན་གཤེགས་པར་བལྟ་བར་བྱ་སྙམ་མམ། \n",
        "id": "0b0aa5ef-8459-4549-9d9f-4e3b1da47094"
    },
    {
        "segment_content": "རབ་འབྱོར་གྱིས་གསོལ་པ། བཅོམ་ལྡན་འདས་དེ་ནི་མ་ལགས་སོ། །\n",
        "id": "abcd4cc0-dc99-4c5f-9c58-daab2e7427e4"
    },
    {
        "segment_content": "མཚན་ཕུན་སུམ་ཚོགས་པས་དེ་བཞིན་གཤེགས་པར་བལྟ་བར་མི་བགྱི་ལགས་སོ། །\n",
        "id": "016e6f3d-bdae-48b0-970c-4fda3132f30b"
    },
    {
        "segment_content": "དེ་ཅིའི་སླད་དུ་ཞེ་ན། དེ་བཞིན་གཤེགས་པས་མཚན་ཕུན་སུམ་ཚོགས་པ་གང་གསུངས་པ་དེ། མཚན་ཕུན་སུམ་ཚོགས་པ་མ་མཆིས་པར་དེ་བཞིན་གཤེགས་པས་གསུངས་པའི་སླད་དུ་སྟེ། \n",
        "id": "44daf173-7aaf-47a4-a0ec-29b6d69796b5"
    },
    {
        "segment_content": "དེས་ན་མཚན་ཕུན་སུམ་ཚོགས་པ་ཞེས་བགྱིའོ། །\n",
        "id": "d01d2549-07ba-4574-9761-3804559c4418"
    },
    {
        "segment_content": "བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། རབ་འབྱོར་འདི་ཇི་སྙམ་དུ་སེམས། \n",
        "id": "4eb064b9-155b-4bc0-813e-39b07328c025"
    },
    {
        "segment_content": "དེ་བཞིན་གཤེགས་པས་འདི་སྙམ་དུ་ངས་ཆོས་བསྟན་ཏོ་ཞེས་དགོངས་སོ་སྙམ་ན། རབ་འབྱོར་དེ་དེ་ལྟར་མི་ལྟ་སྟེ། \n",
        "id": "b36f4cb8-cfdf-4728-8990-6e0928c9ddd3"
    },
    {
        "segment_content": "དེ་བཞིན་གཤེགས་པས་གང་བསྟན་པའི་ཆོས་དེ་གང་ཡང་མེད་པའི་ཕྱིར་རོ། །\n",
        "id": "5e0c6802-24f9-44a9-8d5b-294b71d016d3"
    },
    {
        "segment_content": "རབ་འབྱོར་སུ་ཞིག་འདི་སྐད་དུ་དེ་བཞིན་གཤེགས་པས་ཆོས་བསྟན་ཏོ་ཞེས་ཟེར་ན། རབ་འབྱོར་དེ་ནི་མེད་པ་དང་ལོག་པར་ཟིན་པས་ང་ལ་སྐུར་བར་འགྱུར་རོ། །\n",
        "id": "ed400b39-8a76-4e55-a07a-e43f914b01ce"
    },
    {
        "segment_content": "དེ་ཅིའི་ཕྱིར་ཞེ་ན། རབ་འབྱོར་ཆོས་བསྟན་པ་ཞེས་བྱ་བ་ནི་གང་ཆོས་བསྟན་པ་ཆོས་བསྟན་པ་ཞེས་བྱ་བར་དམིགས་པར་འགྱུར་བའི་ཆོས་དེ་གང་ཡང་མེད་པའི་ཕྱིར་རོ། །\n",
        "id": "5279c2d3-63af-4f8d-ac12-26b7b1050f6c"
    },
    {
        "segment_content": "དེ་ནས་བཅོམ་ལྡན་འདས་ལ་ཚེ་དང་ལྡན་པ་རབ་འབྱོར་གྱིས་འདི་སྐད་ཅེས་གསོལ་ཏོ། །\n",
        "id": "0f914ed3-a2c3-4c37-b3cc-7134ae70e2f5"
    },
    {
        "segment_content": "བཅོམ་ལྡན་འདས་མ་འོངས་པའི་དུས་ན། སེམས་ཅན་གང་དག་འདི་ལྟ་བུའི་ཆོས་བཤད་པ་འདི་ཐོས་ནས། མངོན་པར་ཡིད་ཆེས་པར་འགྱུར་བ་འབྱུང་བ་ལྟ་མཆིས་ལགས་སམ། \n",
        "id": "c7e5d84f-bc6e-4675-8c4b-cdc320a44028"
    },
    {
        "segment_content": "བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། རབ་འབྱོར་དེ་དག་ནི་སེམས་ཅན་ཡང་མ་ཡིན། སེམས་ཅན་མེད་པ་ཡང་མ་ཡིན་ནོ། །\n",
        "id": "f6a29ed7-f2bd-4b65-896a-66818ae295e2"
    },
    {
        "segment_content": "དེ་ཅིའི་ཕྱིར་ཞེ་ན། རབ་འབྱོར་སེམས་ཅན་རྣམས་ཞེས་བྱ་བ་ནི། དེ་བཞིན་གཤེགས་པས་དེ་དག་སེམས་ཅན་མེད་པར་གསུངས་པའི་ཕྱིར་ཏེ། \n",
        "id": "3c290a9d-652c-4237-a9e6-07fc75796171"
    },
    {
        "segment_content": "དེ་བས་ན་སེམས་ཅན་རྣམས་ཞེས་བྱའོ། །\n",
        "id": "81443ee7-4ffa-4b94-85d0-112c702a8627"
    },
    {
        "segment_content": "རབ་འབྱོར་འདི་ཇི་སྙམ་དུ་སེམས། \n",
        "id": "58325648-2627-497c-af7c-0122271959c1"
    },
    {
        "segment_content": "དེ་བཞིན་གཤེགས་པས་གང་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་པའི་ཆོས་དེ་གང་ཡང་ཡོད་སྙམ་མམ།\n",
        "id": "f0417ec6-d11e-49a1-bd71-a4459a5aeb37"
    },
    {
        "segment_content": "ཚེ་དང་ལྡན་པ་རབ་འབྱོར་གྱིས་གསོལ་པ། བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པས་གང་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་པའི་ཆོས་དེ་གང་ཡང་མ་མཆིས་ལགས་སོ། །\n",
        "id": "c050c86e-304b-4975-8dd3-d22ff69318bb"
    },
    {
        "segment_content": "བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། རབ་འབྱོར་དེ་དེ་བཞིན་ནོ། །དེ་དེ་བཞིན་ཏེ། \n",
        "id": "fcc8127c-6a6e-4f5d-908d-21096abd8987"
    },
    {
        "segment_content": "དེ་ལ་ཆོས་ཅུང་ཟད་ཀྱང་མི་དམིགས་ཤིང་མེད་དེ། \n",
        "id": "50d4678a-5cc9-412f-9957-df7a6777f29c"
    },
    {
        "segment_content": "དེས་ན་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཅེས་བྱའོ། །\n",
        "id": "2e5dabbb-6b65-483c-b287-4aa245f5fe91"
    },
    {
        "segment_content": "ཡང་རབ་འབྱོར་ཆོས་དེ་ནི་མཉམ་པ་སྟེ། \n",
        "id": "cbb8c070-ac77-4f3e-8b01-229d9d8f60f7"
    },
    {
        "segment_content": "དེ་ལ་མི་མཉམ་པ་དང་མཉམ་པ་གང་ཡང་མེད་པས། དེས་ན་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཅེས་བྱའོ། །\n",
        "id": "f606d7e0-aec1-4304-8869-ae93fc40d07d"
    },
    {
        "segment_content": "བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་དེ་ནི་བདག་མེད་པ་དང༌། སེམས་ཅན་མེད་པ་དང༌། སྲོག་མེད་པ་དང༌། གང་ཟག་མེད་པར་མཉམ་པ་སྟེ། \n",
        "id": "7689c7b0-6ce1-45ee-bd5e-767be27b7b18"
    },
    {
        "segment_content": "དགེ་བའི་ཆོས་ཐམས་ཅད་ཀྱིས་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་སོ། །\n",
        "id": "8b8b3187-7532-4d7e-ad71-e37ab9256e91"
    },
    {
        "segment_content": "རབ་འབྱོར་དགེ་བའི་ཆོས་རྣམས་ཞེས་བྱ་བ་ནི། དེ་དག་ཆོས་མེད་པ་ཉིད་དུ་དེ་བཞིན་གཤེགས་པས་གསུངས་ཏེ། \n",
        "id": "5889464a-d292-4b76-b576-4cecc1c158c7"
    },
    {
        "segment_content": "དེས་ན་དགེ་བའི་ཆོས་རྣམས་ཞེས་བྱའོ། །\n",
        "id": "6d40480f-664e-4038-83bf-1ffb463a04b0"
    },
    {
        "segment_content": "ཡང་རབ་འབྱོར་རིགས་ཀྱི་བུའམ་རིགས་ཀྱི་བུ་མོ་གང་ལ་ལ་ཞིག་གིས་སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་ན་རིའི་རྒྱལ་པོ་རི་རབ་དག་ཇི་སྙེད་ཡོད་པ་དེ་ཙམ་གྱི་རིན་པོ་ཆེ་སྣ་བདུན་གྱི་ཕུང་པོ་མངོན་པར་བསྡུས་ཏེ། སྦྱིན་པ་བྱིན་པ་བས་གང་གིས་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་འདི་ལས་ཐ་ན་ཚིག་བཞི་པའི་ཚིགས་སུ་བཅད་པ་གཅིག་ཙམ་བཟུང་ནས་གཞན་དག་ལ་ཡང་བསྟན་ན། རབ་འབྱོར་བསོད་ནམས་ཀྱི་ཕུང་པོ་སྔ་མ་དེས་བརྒྱའི་ཆར་ཡང་ཉེ་བར་མི་འགྲོ་བ་ནས་རྒྱུའི་བར་དུ་ཡང་མི་བཟོད་དོ། །\n",
        "id": "725c722c-577a-4e43-b130-04acfecd4909"
    },
    {
        "segment_content": "རབ་འབྱོར་འདི་ཇི་སྙམ་དུ་སེམས། \n",
        "id": "68bef6dd-abb1-4551-86d3-d27e0fa6ecfc"
    },
    {
        "segment_content": "དེ་བཞིན་གཤེགས་པས་འདི་སྙམ་དུ་ངས་སེམས་ཅན་རྣམས་བཀྲོལ་ལོ་ཞེས་དགོངས་སོ་སྙམ་ན། རབ་འབྱོར་དེ་ལྟར་མི་བལྟའོ། །\n",
        "id": "81099a3e-aafa-4d3d-af12-9f1863e6c84a"
    },
    {
        "segment_content": "དེ་ཅིའི་ཕྱིར་ཞེ་ན། རབ་འབྱོར་དེ་བཞིན་གཤེགས་པས་གང་བཀྲོལ་བའི་སེམས་ཅན་དེ་དག་གང་ཡང་མེད་པའི་ཕྱིར་རོ། །\n",
        "id": "760d283a-70af-4fef-88f4-fc524fd77459"
    },
    {
        "segment_content": "རབ་འབྱོར་གལ་ཏེ་དེ་བཞིན་གཤེགས་པས་སེམས་ཅན་གང་ལ་ལ་ཞིག་བཀྲོལ་བར་གྱུར་ན། དེ་ཉིད་དེ་བཞིན་གཤེགས་པས་བདག་ཏུ་འཛིན་པར་འགྱུར།\n",
        "id": "a1b8d47f-b024-4c76-8c41-65fc75023ba7"
    },
    {
        "segment_content": "སེམས་ཅན་དུ་འཛིན་པ་དང༌། སྲོག་ཏུ་འཛིན་པ་དང༌། གང་ཟག་ཏུ་འཛིན་པར་འགྱུར་རོ། །\n",
        "id": "0d2bff8f-ad09-4c2f-81f1-68f581353d8d"
    },
    {
        "segment_content": "རབ་འབྱོར་བདག་ཏུ་འཛིན་ཅེས་བྱ་བ་ནི། འཛིན་པ་མེད་པར་དེ་བཞིན་གཤེགས་པས་གསུངས་ན། དེ་ཡང་བྱིས་པ་སོ་སོའི་སྐྱེ་བོ་རྣམས་ཀྱི་བཟུང་ངོ་། །\n",
        "id": "a66c02e4-916d-478f-a04b-3cf9f015e471"
    },
    {
        "segment_content": "རབ་འབྱོར་བྱིས་པ་སོ་སོའི་སྐྱེ་བོ་རྣམས་ཞེས་བྱ་བ་ནི། དེ་དག་སྐྱེ་བོ་མེད་པ་ཉིད་དུ་དེ་བཞིན་གཤེགས་པས་གསུངས་ཏེ། \n",
        "id": "d68922f2-8014-40d0-8fc7-c87d403a91b0"
    },
    {
        "segment_content": "དེས་ན་བྱིས་པ་སོ་སོའི་སྐྱེ་བོ་རྣམས་ཞེས་བྱའོ། །\n",
        "id": "18f9a501-bce1-41f4-8d3d-c4d3f3a4d495"
    },
    {
        "segment_content": "རབ་འབྱོར་འདི་ཇི་སྙམ་དུ་སེམས། \n",
        "id": "239c31ed-6d46-45cf-89a8-cc5cffe096ed"
    },
    {
        "segment_content": "མཚན་ཕུན་སུམ་ཚོགས་པས་དེ་བཞིན་གཤེགས་པར་བལྟ་བར་བྱ་སྙམ་མམ། \n",
        "id": "e3d33d37-d46c-4c59-967d-cdc2371b8cd8"
    },
    {
        "segment_content": "རབ་འབྱོར་གྱིས་གསོལ་པ། བཅོམ་ལྡན་འདས་དེ་ནི་མ་ལགས་སོ། །\n",
        "id": "d16e90f6-a44d-4284-9bda-e132e407d390"
    },
    {
        "segment_content": "མཚན་ཕུན་སུམ་ཚོགས་པས་དེ་བཞིན་གཤེགས་པར་བལྟ་བར་མི་བགྱི་ལགས་སོ། །\n",
        "id": "d276b4ad-bb5c-486a-883a-35f133ae8527"
    },
    {
        "segment_content": "བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། རབ་འབྱོར་དེ་དེ་བཞིན་ནོ། །དེ་དེ་བཞིན་ཏེ། \n",
        "id": "c38b263b-1c3f-4822-a4a1-372fe1f16f38"
    },
    {
        "segment_content": "མཚན་ཕུན་སུམ་ཚོགས་པས་དེ་བཞིན་གཤེགས་པར་བལྟ་བར་མི་བྱ་སྟེ།\n",
        "id": "743e87b7-488a-4953-a6ba-ea2af99247c5"
    },
    {
        "segment_content": "རབ་འབྱོར་གལ་ཏེ་མཚན་ཕུན་སུམ་ཚོགས་པས་དེ་བཞིན་གཤེགས་པར་བལྟ་བར་འགྱུར་ན། འཁོར་ལོས་སྒྱུར་བའི་རྒྱལ་པོ་ཡང་དེ་བཞིན་གཤེགས་པར་འགྱུར་ཏེ།\n",
        "id": "1792a0d3-e4f4-4e52-8675-63e4ed2359e8"
    },
    {
        "segment_content": "དེ་བས་ན་མཚན་ཕུན་སུམ་ཚོགས་པས་དེ་བཞིན་གཤེགས་པར་བལྟ་བར་མི་བྱའོ། །\n",
        "id": "91989159-2ff4-478a-a6f8-a4bd84f1b98b"
    },
    {
        "segment_content": "དེ་ནས་བཅོམ་ལྡན་འདས་ལ་ཚེ་དང་ལྡན་པ་རབ་འབྱོར་གྱིས་འདི་སྐད་ཅེས་གསོལ་ཏོ། །\n",
        "id": "a339d394-6f45-45cd-bad4-63ea6eea1e91"
    },
    {
        "segment_content": "བཅོམ་ལྡན་འདས་བདག་གིས་ཇི་ལྟར་བཅོམ་ལྡན་འདས་ཀྱིས་གསུངས་པའི་དོན་འཚལ་བ་ལྟར་ན། མཚན་ཕུན་སུམ་ཚོགས་པས་དེ་བཞིན་གཤེགས་པར་བལྟ་བར་མི་བགྱི་ལགས་སོ། །\n",
        "id": "28ee650a-9cd3-4f20-ab02-1367e5f43842"
    },
    {
        "segment_content": "དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་དེའི་ཚེ་ཚིགས་སུ་བཅད་པ་འདི་དག་བཀའ་སྩལ་ཏོ། །\n",
        "id": "a3466d0f-77c8-451a-96c3-f0a8ce7e7e5a"
    },
    {
        "segment_content": "གང་དག་ང་ལ་གཟུགས་སུ་མཐོང༌། །གང་དག་ང་ལ་སྒྲར་ཤེས་པ། །ལོག་པའི་ལམ་དུ་ཞུགས་པ་སྟེ། །\n",
        "id": "a66ca732-0b21-4036-bff0-787cbdbaae2b"
    },
    {
        "segment_content": "སྐྱེ་བོ་དེ་དག་ང་མི་མཐོང༌། །\n",
        "id": "c14746f0-275a-486f-b53a-8ed3c72e41e0"
    },
    {
        "segment_content": "སངས་རྒྱས་རྣམས་ནི་ཆོས་ཉིད་ལྟ། །\n",
        "id": "85b21477-8caa-4924-8434-f1d9865bb1a6"
    },
    {
        "segment_content": "འདྲེན་པ་རྣམས་ནི་ཆོས་ཀྱི་སྐུ། །ཆོས་ཉིད་ཤེས་པར་བྱ་མིན་པས། །དེ་ནི་རྣམ་པར་ཤེས་མི་ནུས། །\n",
        "id": "d3a14246-5afb-4694-badc-28c08f26631d"
    },
    {
        "segment_content": "རབ་འབྱོར་འདི་ཇི་སྙམ་དུ་སེམས། \n",
        "id": "b4b6fa5a-629a-473c-993e-b15e8aa58292"
    },
    {
        "segment_content": "མཚན་ཕུན་སུམ་ཚོགས་པས་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་སོ་སྙམ་དུ་འཛིན་ན། རབ་འབྱོར་ཁྱོད་ཀྱིས་དེ་ལྟར་བལྟ་བར་མི་བྱ་སྟེ། \n",
        "id": "82ef3d28-f4f0-4cdb-a05e-a45c24cb215f"
    },
    {
        "segment_content": "རབ་འབྱོར་མཚན་ཕུན་སུམ་ཚོགས་པས་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་པ་མེད་དོ། །\n",
        "id": "b897b3f3-a069-4a72-b4d9-ebf137aec17e"
    },
    {
        "segment_content": "རབ་འབྱོར་ཁྱོད་འདི་སྙམ་དུ་བྱང་ཆུབ་སེམས་དཔའི་ཐེག་པ་ལ་ཡང་དག་པར་ཞུགས་པ་རྣམས་ཀྱིས། ཆོས་གང་ལ་ལ་ཞིག་རྣམ་པར་བཤིག་པའམ་ཆད་པར་བཏགས་པའོ་སྙམ་དུ་འཛིན་ན། རབ་འབྱོར་དེ་དེ་ལྟར་བལྟ་བར་མི་བྱ་སྟེ། \n",
        "id": "60590a66-cbf9-494d-a1bd-a4c6a1265124"
    },
    {
        "segment_content": "བྱང་ཆུབ་སེམས་དཔའི་ཐེག་པ་ལ་ཡང་དག་པར་ཞུགས་པ་རྣམས་ཀྱིས། ཆོས་གང་ཡང་རྣམ་པར་བཤིག་པའམ། ཆད་པར་བཏགས་པ་མེད་དོ། །\n",
        "id": "fe9617bf-287a-4814-9839-2e15a062ad86"
    },
    {
        "segment_content": "ཡང་རབ་འབྱོར་རིགས་ཀྱི་བུའམ་རིགས་ཀྱི་བུ་མོ་གང་གིས་འཇིག་རྟེན་གྱི་ཁམས་གངྒཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་དག་རིན་པོ་ཆེ་སྣ་བདུན་གྱིས་རབ་ཏུ་གང་བར་བྱས་ཏེ་སྦྱིན་པ་བྱིན་པ་བས། བྱང་ཆུབ་སེམས་དཔའ་གང་གིས་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་བདག་མེད་ཅིང་སྐྱེ་བ་མེད་པ་ལ་བཟོད་པ་ཐོབ་ན། དེ་ཉིད་གཞི་དེ་ལས་བསོད་ནམས་ཀྱི་ཕུང་པོ་ཆོས་མང་དུ་གྲངས་མེད་དཔག་ཏུ་མེད་པ་བསྐྱེད་དོ། །\n",
        "id": "5314117d-4ea5-434a-a7b1-2f0c27dd960f"
    },
    {
        "segment_content": "ཡང་རབ་འབྱོར་བྱང་ཆུབ་སེམས་དཔས་བསོད་ནམས་ཀྱི་ཕུང་པོ་ཡོངས་སུ་གཟུང་བར་མི་བྱའོ། །\n",
        "id": "79011bf1-62a9-4382-911d-21445abb041c"
    },
    {
        "segment_content": "ཚེ་དང་ལྡན་པ་རབ་འབྱོར་གྱིས་གསོལ་པ། བཅོམ་ལྡན་འདས་བྱང་ཆུབ་སེམས་དཔས་བསོད་ནམས་ཀྱི་ཕུང་པོ་ཡོངས་སུ་གཟུང་བར་མི་བགྱི་ལགས་སམ། \n",
        "id": "7f63fdba-52ef-43f1-b926-eecc061f0b29"
    },
    {
        "segment_content": "བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། རབ་འབྱོར་ཡོངས་སུ་གཟུང་མོད་ཀྱིས། ལོག་པར་མི་བཟུང་སྟེ་\n",
        "id": "eea5ca85-b164-4fe2-8b4a-f96ec2dc4a00"
    },
    {
        "segment_content": "དེས་ན་ཡོངས་སུ་གཟུང་བ་ཞེས་བྱའོ། །\n",
        "id": "fd8f9ea1-628a-475f-8476-53eb052cc38c"
    },
    {
        "segment_content": "ཡང་རབ་འབྱོར་གང་ལ་ལ་ཞིག་འདི་སྐད་དུ། དེ་བཞིན་གཤེགས་པ་བཞུད་དམ་བྱོན་ཏམ། བཞེངས་སམ། བཞུགས་སམ། མནལ་བར་མཛད་དོ་ཞེས་ཟེར་ན། དེས་ངས་བཤད་པའི་དོན་མི་ཤེས་སོ། །\n",
        "id": "39c82fb0-9a20-4084-afca-b35ba4a2337c"
    },
    {
        "segment_content": "དེ་ཅིའི་ཕྱིར་ཞེ་ན། རབ་འབྱོར་དེ་བཞིན་གཤེགས་པ་ཞེས་བྱ་བ་ནི། གར་ཡང་མ་བཞུད། གང་ནས་ཀྱང་མ་བྱོན་པའི་ཕྱིར་ཏེ། \n",
        "id": "631755e1-776a-4622-91c1-fbac280f264b"
    },
    {
        "segment_content": "དེས་ན་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཞེས་བྱའོ། །\n",
        "id": "c133cde8-08ac-4108-a235-67d845e73320"
    },
    {
        "segment_content": "ཡང་རབ་འབྱོར་རིགས་ཀྱི་བུའམ་རིགས་ཀྱི་བུ་མོ་གང་ལ་ལ་ཞིག་གིས། སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་ན་སའི་རྡུལ་ཇི་སྙེད་ཡོད་པ་དེ་དག །འདི་ལྟ་སྟེ་དཔེར་ན་རྡུལ་ཕྲ་རབ་ཀྱི་ཚོགས་བཞིན་དུ་ཕྱེ་མར་བྱས་ན། རབ་འབྱོར་འདི་ཇི་སྙམ་དུ་སེམས། རྡུལ་ཕྲ་རབ་ཀྱི་ཚོགས་དེ་མང་བ་ཡིན་སྙམ་མམ། \n",
        "id": "120708b8-c8f2-43f7-9c47-f0ff98e7145c"
    },
    {
        "segment_content": "རབ་འབྱོར་གྱིས་གསོལ་པ། བཅོམ་ལྡན་འདས་དེ་དེ་ལྟར་ལགས་ཏེ། \n",
        "id": "7c9a73f8-5da3-4ddc-ae09-4356212448e0"
    },
    {
        "segment_content": "རྡུལ་ཕྲ་རབ་ཀྱི་ཚོགས་དེ་མང་བ་ལགས་སོ། །\n",
        "id": "d80a92ed-3185-45d5-82be-349a3e9d9ba4"
    },
    {
        "segment_content": "དེ་ཅིའི་སླད་དུ་ཞེ་ན། བཅོམ་ལྡན་འདས་གལ་ཏེ་རྡུལ་ཕྲ་རབ་ཀྱི་ཚོགས་ཤིག་མཆིས་པར་གྱུར་ན། བཅོམ་ལྡན་འདས་ཀྱིས་རྡུལ་ཕྲ་རབ་ཀྱི་ཚོགས་ཞེས་བཀའ་མི་སྩོལ་བའི་སླད་དུའོ། །\n",
        "id": "36a95b0f-5401-4ccc-a328-69f5c0a46cf2"
    },
    {
        "segment_content": "དེ་ཅིའི་སླད་དུ་ཞེ་ན། བཅོམ་ལྡན་འདས་ཀྱི་རྡུལ་ཕྲ་རབ་ཀྱི་ཚོགས་ཞེས་གང་གསུངས་པ་དེ་ཚོགས་མ་མཆིས་པར་དེ་བཞིན་གཤེགས་པའི་གསུངས་པའི་སླད་དུ་སྟེ། \n",
        "id": "f8d2f74b-7012-4aab-8f20-5a682bbfb9ea"
    },
    {
        "segment_content": "དེས་ན་རྡུལ་ཕྲ་རབ་ཀྱི་ཚོགས་ཞེས་བགྱིའོ། །\n",
        "id": "5a9fe981-5f3e-4239-9a12-0ba81af87132"
    },
    {
        "segment_content": "དེ་བཞིན་གཤེགས་པས་སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་ཞེས་གང་གསུངས་པ་དེ་ཁམས་མ་མཆིས་པར་དེ་བཞིན་གཤེགས་པས་གསུངས་ཏེ། \n",
        "id": "e621af6c-0a6a-43cd-9155-adb1bcff8be4"
    },
    {
        "segment_content": "དེས་ན་སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་ཞེས་བགྱིའོ། །\n",
        "id": "885e3eda-43fa-41c9-a2e0-62e567e0f73e"
    },
    {
        "segment_content": "དེ་ཅིའི་སླད་དུ་ཞེ་ན། བཅོམ་ལྡན་འདས་གལ་ཏེ་འཇིག་རྟེན་གྱི་ཁམས་ཤིག་མཆིས་པར་གྱུར་ན། དེ་ཉིད་རིལ་པོར་འཛིན་པར་འགྱུར་བའི་སླད་དུའོ། །\n",
        "id": "3a6e33f2-e5bb-40de-b91e-5ff3eae7bda5"
    },
    {
        "segment_content": "དེ་བཞིན་གཤེགས་པས་རིལ་པོར་འཛིན་པར་གསུངས་པ་དེ་འཛིན་པ་མ་མཆིས་པར་དེ་བཞིན་གཤེགས་པས་གསུངས་པའི་སླད་དུ་སྟེ། \n",
        "id": "b5bb7e02-3163-4f01-a1d5-bb0c78b641af"
    },
    {
        "segment_content": "དེས་ན་རིལ་པོར་འཛིན་པ་ཞེས་བགྱིའོ། །\n",
        "id": "bb92fdcd-dd42-4b21-a2ec-e16ee22681d0"
    },
    {
        "segment_content": "བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། རབ་འབྱོར་རིལ་པོར་འཛིན་པ་ཉིད་ནི་ཐ་སྙད་དེ། \n",
        "id": "1023ea7e-5ec7-4627-b483-125d63cfedf1"
    },
    {
        "segment_content": "ཆོས་དེ་ནི་བརྗོད་དུ་མེད་པ་ཡིན་ན། དེ་ཡང་བྱིས་པ་སོ་སོའི་སྐྱེ་བོ་རྣམས་ཀྱིས་གཟུང་ངོ་། །\n",
        "id": "0a7f31d5-ef5b-4e00-aa11-5429b68f828f"
    },
    {
        "segment_content": "རབ་འབྱོར་གང་ལ་ལ་ཞིག་འདི་སྐད་དུ། དེ་བཞིན་གཤེགས་པས་བདག་ཏུ་ལྟ་བར་གསུངས། \n",
        "id": "67c12b4b-f72a-4416-8ad5-4eff85eeadb9"
    },
    {
        "segment_content": "དེ་བཞིན་གཤེགས་པས་སེམས་ཅན་དུ་ལྟ་བ་དང༌། སྲོག་ཏུ་ལྟ་བ་དང༌། གང་ཟག་ཏུ་ལྟ་བར་གསུངས་སོ། །ཞེས་ཟེར་ན་དེ་ཡང་དག་པར་སྨྲ་བས་སྨྲ་བ་ཡིན་ནམ། \n",
        "id": "f87fc0b5-d766-4e77-9cbb-4787233462ee"
    },
    {
        "segment_content": "རབ་འབྱོར་གྱིས་གསོལ་པ། བཅོམ་ལྡན་འདས་དེ་ནི་མ་ལགས་སོ། །\n",
        "id": "f263642c-9151-48ce-825d-425203283a76"
    },
    {
        "segment_content": "བདེ་བར་གཤེགས་པ་དེ་ནི་མ་ལགས་སོ། །\n",
        "id": "f323d965-7fd7-477d-b554-5df9f03906d1"
    },
    {
        "segment_content": "དེ་ཅིའི་སླད་དུ་ཞེ་ན། བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པས་བདག་ཏུ་ལྟ་བར་གང་གསུངས་པ་དེ་ནི་ལྟ་བ་མ་མཆིས་པར་དེ་བཞིན་གཤེགས་པས་གསུངས་པའི་སླད་དུ་སྟེ། \n",
        "id": "a5702edd-8cff-499d-a15e-d8a515db3209"
    },
    {
        "segment_content": "དེས་ན་བདག་ཏུ་ལྟ་བ་ཞེས་བགྱིའོ། །\n",
        "id": "daa5833b-2319-4018-9997-fc4eb6b5141b"
    },
    {
        "segment_content": "བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། རབ་འབྱོར་འདི་ལ་བྱང་ཆུབ་སེམས་དཔའི་ཐེག་པ་ལ་ཡང་དག་པར་ཞུགས་པས། འདི་ལྟར་ཆོས་ཐམས་ཅད་ཤེས་པར་བྱ། བལྟ་བར་བྱ། མོས་པར་བྱ་སྟེ།\n",
        "id": "9f080bf5-4234-4ba5-b174-b5b5aee69d3f"
    },
    {
        "segment_content": "ཅི་ནས་ཆོས་སུ་འདུ་ཤེས་པ་ལ་མི་གནས་པར་ཤེས་པར་བྱའོ། །\n",
        "id": "0e54808e-5630-4de9-ab6d-8a10e7f750f7"
    },
    {
        "segment_content": "དེ་ཅིའི་ཕྱིར་ཞེ་ན། རབ་འབྱོར་ཆོས་སུ་འདུ་ཤེས་ཆོས་སུ་འདུ་ཤེས་ཞེས་བྱ་བ་ནི། དེ་འདུ་ཤེས་མེད་པར་དེ་བཞིན་གཤེགས་པས་གསུངས་པའི་ཕྱིར་ཏེ། \n",
        "id": "77786708-c357-4172-beb6-a7de79294eed"
    },
    {
        "segment_content": "དེས་ན་ཆོས་སུ་འདུ་ཤེས་ཆོས་སུ་འདུ་ཤེས་ཞེས་བྱའོ། །\n",
        "id": "87b537b8-1d66-4d92-96a3-f0355fd78c7b"
    },
    {
        "segment_content": "ཡང་རབ་འབྱོར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་གང་གིས་འཇིག་རྟེན་གྱི་ཁམས་དཔག་ཏུ་མེད་ཅིང་གྲངས་མེད་པ་དག་རིན་པོ་ཆེ་སྣ་བདུན་གྱིས་རབ་ཏུ་གང་བར་བྱས་ཏེ་སྦྱིན་པ་བྱིན་པ་བས། རིགས་ཀྱི་བུའམ་རིགས་ཀྱི་བུ་མོ་གང་གིས་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་འདི་ལས་ཐ་ན་ཚིག་བཞི་པའི་ཚིགས་སུ་བཅད་པ་ཙམ་བྲིས་ནས་འཛིན་ཏམ། འཆང་ངམ། ཀློག་གམ། ཀུན་ཆུབ་པར་བྱེད་དམ། གཞན་དག་ལ་རྒྱ་ཆེར་ཡང་དག་པར་རབ་ཏུ་སྟོན་ན་དེ་ཉིད་གཞི་དེ་ལས་བསོད་ནམས་ཆེས་མང་དུ་གྲངས་མེད་དཔག་ཏུ་མེད་པ་བསྐྱེད་དོ། །\n",
        "id": "0e4cd082-d225-4bdc-b7f2-27a42b7341f5"
    },
    {
        "segment_content": "ཇི་ལྟར་ཡང་དག་པར་རབ་ཏུ་སྟོན་ཅེ་ན། ཇི་ལྟར་ཡང་དག་པར་རབ་ཏུ་མི་སྟོན་པ་དེ་བཞིན་དུ་ཡང་དག་པར་རབ་ཏུ་སྟོན་པ་སྟེ། \n",
        "id": "d315e402-0cbd-4e34-81d2-339bba9aafa4"
    },
    {
        "segment_content": "དེས་ན་ཡང་དག་པར་རབ་ཏུ་སྟོན་པ་ཞེས་བྱའོ། །\n",
        "id": "2c3ca8a0-d205-401c-9e9b-695123e1e74c"
    },
    {
        "segment_content": "སྐར་མ་རབ་རིབ་མར་མེ་དང༌། །སྒྱུ་མ་ཟིལ་བ་ཆུ་བུར་དང༌། །རྨི་ལམ་གློག་དང་སྤྲིན་ལྟ་བུ། །འདུས་བྱས་ཐམས་ཅད་དེ་ལྟར་ལྟ། །\n",
        "id": "1159a6b6-8598-44fe-a178-502db707b530"
    },
    {
        "segment_content": "བཅོམ་ལྡན་འདས་ཀྱིས་དེ་སྐད་ཅེས་བཀའ་སྩལ་ནས། གནས་བརྟན་རབ་འབྱོར་དང༌། དགེ་སློང་དེ་དག་དང༌། བྱང་ཆུབ་སེམས་དཔའ་དེ་དག་དང༌། འཁོར་བཞི་པོ་དགེ་སློང་དང༌། དགེ་སློང་མ་དང༌། དགེ་བསྙེན་དང༌། དགེ་བསྙེན་མ་དང༌། ལྷ་དང༌། མི་དང་ལྷ་མ་ཡིན་དང༌། དྲི་ཟར་བཅས་པའི་འཇིག་རྟེན་ཡི་རངས་ཏེ། \n",
        "id": "edc0b1dc-b949-4156-8d22-38a7773d0f7b"
    },
    {
        "segment_content": "བཅོམ་ལྡན་འདས་ཀྱིས་གསུངས་པ་ལ་མངོན་པར་བསྟོད་དོ།། །།\n",
        "id": "2cfb97ea-7145-403f-a2c7-102250771bff"
    },
    {
        "segment_content": "འཕགས་པ་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་རྡོ་རྗེ་གཅོད་པ་ཞེས་བྱ་བ་ཐེག་པ་ཆེན་པོའི་མདོ་རྫོགས་སོ།། །།\n",
        "id": "2e074567-1e49-41d9-816f-f51e07b47481"
    },
    {
        "segment_content": "ན་མོ་བྷ་ག་ཝ་ཏེ། པྲཛྙཱ་པ་ར་མི་ཏ་ཡེ། ཨོཾ་ན་ཏ་ད་ཏི་ཏ། ཨི་ལི་ཤི །ཨི་ལི་ཤི །མི་ལི་ཤི །མི་ལི་ཤི །བྷི་ན་ཡན་བྷི་ན་ཡན། ན་མོ་བྷ་ག་ཝ་ཏེ། པྲད་ཏྱཾ་པྲ་ཏེ། ཨི་རི་ཏི། ཨི་རི་ཏི། མི་ར་ཏི། མི་རི་ཏི། ཤུ་རི་ཏི། ཤུ་རི་ཏི། ཨུ་ཤུ་རི་ཨུ་ཤུ་རི། བྷུ་ཡུ་ཡེ་བྷུ་ཡུ་ཡེ་སྭཱཧཱ།\n",
        "id": "a60244f4-f207-4996-88c4-ac2e5efdd240"
    },
    {
        "segment_content": "རྡོ་རྗེ་གཅོད་པའི་སྙིང་པོ་འདི་ལན་གཅིག་བཟླས་པས་རྡོ་རྗེ་གཅོད་པ་ཁྲི་དགུ་སྟོང་བཀླགས་པ་དང་མཉམ་པར་འགྱུར་རོ། །\n",
        "id": "68a07d67-9963-4fb5-b979-69ec924f2d51"
    },
    {
        "segment_content": "ཡེ་དྷརྨ་ཧེ་ཏུ་པྲ་བྷ་ཝ་ཧེ་ཏུནྟེ་ཥཱནྟ་ཐཱ་ག་ཏོ་ཧྱ་བ་དཏ། ཏེ་ཥཱཉྩ་ཡོ་ནི་རོ་དྷ་ཨེ་ཝཾ་བཱ་དཱི་མི་ཧཱ་ཤྲ་མ་ཎ་ཡེ་སྭཱཧཱ།། །།\n",
        "id": "69d01580-bad4-4b38-b6cb-7e1c0d2b0693"
    }
]